[Killed] BlockStatement
security/pep.ts:77:35
 export class PepDeniedError extends Error {
   readonly reason_code: string;
 
-  constructor(reasonCode: string) {
-    super(`Policy enforcement denied: ${reasonCode}`);
-    this.name = 'PepDeniedError';
-    this.reason_code = reasonCode;
-  }
+  constructor(reasonCode: string) {}
 }
 
killedBy: AH-POLICY-ENGINE-001: PEP is mandatory at every action re-evaluates the current policy before capability validation and tool execution
statusReason: expected ReferenceError: Must call super construct… to match object { name: 'PepDeniedError', …(1) }

[Killed] BlockStatement
security/pep.ts:84:37
   }
 }
 
-function deepFreeze<T>(value: T): T {
-  if ((typeof value !== 'object' && typeof value !== 'function') || value === null) return value;
-  if (Object.isFrozen(value)) return value;
-  for (const child of Object.values(value as Record<string, unknown>)) deepFreeze(child);
-  return Object.freeze(value);
-}
+function deepFreeze<T>(value: T): T {}
 
 function strictTimestamp(value: unknown): number | undefined {
killedBy: AH-POLICY-ENGINE-001: PEP is mandatory at every action executes a network action only after destination and DNS binding validation
statusReason: expected undefined to match object { …(2) }

[Killed] EqualityOperator
security/pep.ts:85:8
 }
 
 function deepFreeze<T>(value: T): T {
-  if ((typeof value !== 'object' && typeof value !== 'function') || value === null) return value;
+  if ((typeof value === 'object' && typeof value !== 'function') || value === null) return value;
   if (Object.isFrozen(value)) return value;
   for (const child of Object.values(value as Record<string, unknown>)) deepFreeze(child);
killedBy: AH-POLICY-ENGINE-001: PEP is mandatory at every action executes a network action only after destination and DNS binding validation
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
security/pep.ts:85:8
 }
 
 function deepFreeze<T>(value: T): T {
-  if ((typeof value !== 'object' && typeof value !== 'function') || value === null) return value;
+  if ((true && typeof value !== 'function') || value === null) return value;
   if (Object.isFrozen(value)) return value;
   for (const child of Object.values(value as Record<string, unknown>)) deepFreeze(child);
killedBy: AH-POLICY-ENGINE-001: PEP is mandatory at every action executes a network action only after destination and DNS binding validation
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
security/pep.ts:86:7
 
 function deepFreeze<T>(value: T): T {
   if ((typeof value !== 'object' && typeof value !== 'function') || value === null) return value;
-  if (Object.isFrozen(value)) return value;
+  if (true) return value;
   for (const child of Object.values(value as Record<string, unknown>)) deepFreeze(child);
   return Object.freeze(value);
killedBy: AH-POLICY-ENGINE-001: PEP is mandatory at every action executes a network action only after destination and DNS binding validation
statusReason: expected false to be true // Object.is equality

[Survived] ConditionalExpression
security/pep.ts:86:7
 
 function deepFreeze<T>(value: T): T {
   if ((typeof value !== 'object' && typeof value !== 'function') || value === null) return value;
-  if (Object.isFrozen(value)) return value;
+  if (false) return value;
   for (const child of Object.values(value as Record<string, unknown>)) deepFreeze(child);
   return Object.freeze(value);

[Killed] BlockStatement
security/pep.ts:91:62
   return Object.freeze(value);
 }
 
-function strictTimestamp(value: unknown): number | undefined {
-  return isStrictDateTime(value) ? Date.parse(value) : undefined;
-}
+function strictTimestamp(value: unknown): number | undefined {}
 
 export class PolicyEnforcementPoint {
killedBy: AH-POLICY-ENGINE-001: PEP is mandatory at every action executes exactly once only after policy, capability and consumption checks pass
statusReason: promise rejected "PepDeniedError: Policy enforcement denied… { reason_code: '…' }" instead of resolving

[Killed] BlockStatement
security/pep.ts:107:6
     capability_authority: CapabilityAuthorityPort;
     audit_sink: AuditSinkPort;
     now: () => string;
-  }) {
-    if (!(options.policy_engine instanceof PolicyEngine)) {
-      throw new TypeError('policy_engine is required');
-    }
-    if (
-      typeof options.capability_authority?.verify_signature !== 'function' ||
-      typeof options.capability_authority.consume !== 'function'
-    ) {
-      throw new TypeError('capability_authority is required');
-    }
-    if (typeof options.audit_sink?.write !== 'function') throw new TypeError('audit_sink is required');
-    if (typeof options.now !== 'function') throw new TypeError('now is required');
-    this.#policyEngine = options.policy_engine;
-    this.#verifySignature = options.capability_authority.verify_signature.bind(options.capability_authority);
-    this.#consume = options.capability_authority.consume.bind(options.capability_authority);
-    this.#writeAudit = options.audit_sink.write.bind(options.audit_sink);
-    this.#now = options.now;
-  }
+  }) {}
 
   async enforce<T>(request: PepRequest, execute: (authorization: PepAuthorization) => Promise<T>): Promise<T> {
killedBy: AH-POLICY-ENGINE-001: PEP is mandatory at every action re-evaluates the current policy before capability validation and tool execution
statusReason: expected TypeError: this[#now] is not a function to match object { name: 'PepDeniedError', …(1) }

[Killed] ConditionalExpression
security/pep.ts:108:9
     audit_sink: AuditSinkPort;
     now: () => string;
   }) {
-    if (!(options.policy_engine instanceof PolicyEngine)) {
+    if (true) {
       throw new TypeError('policy_engine is required');
     }
killedBy: AH-POLICY-ENGINE-001: PEP is mandatory at every action re-evaluates the current policy before capability validation and tool execution
statusReason: policy_engine is required

[Killed] BooleanLiteral
security/pep.ts:108:9
     audit_sink: AuditSinkPort;
     now: () => string;
   }) {
-    if (!(options.policy_engine instanceof PolicyEngine)) {
+    if (options.policy_engine instanceof PolicyEngine) {
       throw new TypeError('policy_engine is required');
     }
killedBy: AH-POLICY-ENGINE-001: PEP is mandatory at every action re-evaluates the current policy before capability validation and tool execution
statusReason: policy_engine is required

[NoCoverage] StringLiteral
security/pep.ts:109:27
     now: () => string;
   }) {
     if (!(options.policy_engine instanceof PolicyEngine)) {
-      throw new TypeError('policy_engine is required');
+      throw new TypeError("");
     }
     if (

[Killed] ConditionalExpression
security/pep.ts:112:7
       throw new TypeError('policy_engine is required');
     }
     if (
-      typeof options.capability_authority?.verify_signature !== 'function' ||
-      typeof options.capability_authority.consume !== 'function'
+      true
     ) {
       throw new TypeError('capability_authority is required');
killedBy: AH-POLICY-ENGINE-001: PEP is mandatory at every action re-evaluates the current policy before capability validation and tool execution
statusReason: capability_authority is required

[Killed] EqualityOperator
security/pep.ts:112:7
       throw new TypeError('policy_engine is required');
     }
     if (
-      typeof options.capability_authority?.verify_signature !== 'function' ||
+      typeof options.capability_authority?.verify_signature === 'function' ||
       typeof options.capability_authority.consume !== 'function'
     ) {
killedBy: AH-POLICY-ENGINE-001: PEP is mandatory at every action re-evaluates the current policy before capability validation and tool execution
statusReason: capability_authority is required

[Killed] EqualityOperator
security/pep.ts:113:7
     }
     if (
       typeof options.capability_authority?.verify_signature !== 'function' ||
-      typeof options.capability_authority.consume !== 'function'
+      typeof options.capability_authority.consume === 'function'
     ) {
       throw new TypeError('capability_authority is required');
killedBy: AH-POLICY-ENGINE-001: PEP is mandatory at every action re-evaluates the current policy before capability validation and tool execution
statusReason: capability_authority is required

[Survived] ConditionalExpression
security/pep.ts:113:7
     }
     if (
       typeof options.capability_authority?.verify_signature !== 'function' ||
-      typeof options.capability_authority.consume !== 'function'
+      false
     ) {
       throw new TypeError('capability_authority is required');

[NoCoverage] BlockStatement
security/pep.ts:114:7
     if (
       typeof options.capability_authority?.verify_signature !== 'function' ||
       typeof options.capability_authority.consume !== 'function'
-    ) {
-      throw new TypeError('capability_authority is required');
-    }
+    ) {}
     if (typeof options.audit_sink?.write !== 'function') throw new TypeError('audit_sink is required');
     if (typeof options.now !== 'function') throw new TypeError('now is required');

[Killed] EqualityOperator
security/pep.ts:117:9
     ) {
       throw new TypeError('capability_authority is required');
     }
-    if (typeof options.audit_sink?.write !== 'function') throw new TypeError('audit_sink is required');
+    if (typeof options.audit_sink?.write === 'function') throw new TypeError('audit_sink is required');
     if (typeof options.now !== 'function') throw new TypeError('now is required');
     this.#policyEngine = options.policy_engine;
killedBy: AH-POLICY-ENGINE-001: PEP is mandatory at every action re-evaluates the current policy before capability validation and tool execution
statusReason: audit_sink is required

[Killed] ConditionalExpression
security/pep.ts:117:9
     ) {
       throw new TypeError('capability_authority is required');
     }
-    if (typeof options.audit_sink?.write !== 'function') throw new TypeError('audit_sink is required');
+    if (true) throw new TypeError('audit_sink is required');
     if (typeof options.now !== 'function') throw new TypeError('now is required');
     this.#policyEngine = options.policy_engine;
killedBy: AH-POLICY-ENGINE-001: PEP is mandatory at every action re-evaluates the current policy before capability validation and tool execution
statusReason: audit_sink is required

[Killed] ConditionalExpression
security/pep.ts:118:9
       throw new TypeError('capability_authority is required');
     }
     if (typeof options.audit_sink?.write !== 'function') throw new TypeError('audit_sink is required');
-    if (typeof options.now !== 'function') throw new TypeError('now is required');
+    if (true) throw new TypeError('now is required');
     this.#policyEngine = options.policy_engine;
     this.#verifySignature = options.capability_authority.verify_signature.bind(options.capability_authority);
killedBy: AH-POLICY-ENGINE-001: PEP is mandatory at every action re-evaluates the current policy before capability validation and tool execution
statusReason: now is required

[Killed] EqualityOperator
security/pep.ts:118:9
       throw new TypeError('capability_authority is required');
     }
     if (typeof options.audit_sink?.write !== 'function') throw new TypeError('audit_sink is required');
-    if (typeof options.now !== 'function') throw new TypeError('now is required');
+    if (typeof options.now === 'function') throw new TypeError('now is required');
     this.#policyEngine = options.policy_engine;
     this.#verifySignature = options.capability_authority.verify_signature.bind(options.capability_authority);
killedBy: AH-POLICY-ENGINE-001: PEP is mandatory at every action re-evaluates the current policy before capability validation and tool execution
statusReason: now is required

[Killed] ConditionalExpression
security/pep.ts:127:9
   }
 
   async enforce<T>(request: PepRequest, execute: (authorization: PepAuthorization) => Promise<T>): Promise<T> {
-    if (typeof execute !== 'function') throw new TypeError('execute must be a function');
+    if (true) throw new TypeError('execute must be a function');
     const now = this.#now();
     const policyContext = { ...request.context, now };
killedBy: AH-POLICY-ENGINE-001: PEP is mandatory at every action re-evaluates the current policy before capability validation and tool execution
statusReason: expected TypeError: execute must be a function to match object { name: 'PepDeniedError', …(1) }

[Killed] EqualityOperator
security/pep.ts:127:9
   }
 
   async enforce<T>(request: PepRequest, execute: (authorization: PepAuthorization) => Promise<T>): Promise<T> {
-    if (typeof execute !== 'function') throw new TypeError('execute must be a function');
+    if (typeof execute === 'function') throw new TypeError('execute must be a function');
     const now = this.#now();
     const policyContext = { ...request.context, now };
killedBy: AH-POLICY-ENGINE-001: PEP is mandatory at every action re-evaluates the current policy before capability validation and tool execution
statusReason: expected TypeError: execute must be a function to match object { name: 'PepDeniedError', …(1) }

[Killed] ObjectLiteral
security/pep.ts:129:27
   async enforce<T>(request: PepRequest, execute: (authorization: PepAuthorization) => Promise<T>): Promise<T> {
     if (typeof execute !== 'function') throw new TypeError('execute must be a function');
     const now = this.#now();
-    const policyContext = { ...request.context, now };
+    const policyContext = {};
     let tier: DerivedRiskTier | null = null;
     let decision;
killedBy: AH-POLICY-ENGINE-001: PEP is mandatory at every action re-evaluates the current policy before capability validation and tool execution
statusReason: expected PepDeniedError: Policy enforcement denied… { reason_code: '…' } to match object { name: 'PepDeniedError', …(1) }

[Killed] BlockStatement
security/pep.ts:132:9
     const policyContext = { ...request.context, now };
     let tier: DerivedRiskTier | null = null;
     let decision;
-    try {
-      decision = this.#policyEngine.evaluate({
-        tool_name: request.manifest.tool_name,
-        resource_ids: request.manifest.resource_ids,
-        risk: request.risk,
-        context: policyContext,
-      });
-      tier = decision.derived_risk_tier;
-    } catch {
+    try {} catch {
       return this.#deny(request, 'invalid_policy_input', tier);
     }
killedBy: AH-POLICY-ENGINE-001: PEP is mandatory at every action re-evaluates the current policy before capability validation and tool execution
statusReason: expected TypeError: Cannot read properties of unde… to match object { name: 'PepDeniedError', …(1) }

[Killed] ObjectLiteral
security/pep.ts:133:46
     let tier: DerivedRiskTier | null = null;
     let decision;
     try {
-      decision = this.#policyEngine.evaluate({
-        tool_name: request.manifest.tool_name,
-        resource_ids: request.manifest.resource_ids,
-        risk: request.risk,
-        context: policyContext,
-      });
+      decision = this.#policyEngine.evaluate({});
       tier = decision.derived_risk_tier;
     } catch {
killedBy: AH-POLICY-ENGINE-001: PEP is mandatory at every action re-evaluates the current policy before capability validation and tool execution
statusReason: expected PepDeniedError: Policy enforcement denied… { reason_code: '…' } to match object { name: 'PepDeniedError', …(1) }

[NoCoverage] BlockStatement
security/pep.ts:140:13
         context: policyContext,
       });
       tier = decision.derived_risk_tier;
-    } catch {
-      return this.#deny(request, 'invalid_policy_input', tier);
-    }
+    } catch {}
     if (!decision.allowed) return this.#deny(request, 'policy_denied', tier);
 

[NoCoverage] StringLiteral
security/pep.ts:141:34
       });
       tier = decision.derived_risk_tier;
     } catch {
-      return this.#deny(request, 'invalid_policy_input', tier);
+      return this.#deny(request, "", tier);
     }
     if (!decision.allowed) return this.#deny(request, 'policy_denied', tier);

[Killed] ConditionalExpression
security/pep.ts:143:9
     } catch {
       return this.#deny(request, 'invalid_policy_input', tier);
     }
-    if (!decision.allowed) return this.#deny(request, 'policy_denied', tier);
+    if (false) return this.#deny(request, 'policy_denied', tier);
 
     if (request.context.policy_hash !== this.#policyEngine.policy_hash) {
killedBy: AH-POLICY-ENGINE-001: PEP is mandatory at every action re-evaluates the current policy before capability validation and tool execution
statusReason: expected PepDeniedError: Policy enforcement denied… { reason_code: '…' } to match object { name: 'PepDeniedError', …(1) }

[Killed] BooleanLiteral
security/pep.ts:143:9
     } catch {
       return this.#deny(request, 'invalid_policy_input', tier);
     }
-    if (!decision.allowed) return this.#deny(request, 'policy_denied', tier);
+    if (decision.allowed) return this.#deny(request, 'policy_denied', tier);
 
     if (request.context.policy_hash !== this.#policyEngine.policy_hash) {
killedBy: AH-POLICY-ENGINE-001: PEP is mandatory at every action re-evaluates the current policy before capability validation and tool execution
statusReason: expected PepDeniedError: Policy enforcement denied… { reason_code: '…' } to match object { name: 'PepDeniedError', …(1) }

[Killed] EqualityOperator
security/pep.ts:145:9
     }
     if (!decision.allowed) return this.#deny(request, 'policy_denied', tier);
 
-    if (request.context.policy_hash !== this.#policyEngine.policy_hash) {
+    if (request.context.policy_hash === this.#policyEngine.policy_hash) {
       return this.#deny(request, 'wrong_policy_hash', tier);
     }
killedBy: AH-POLICY-ENGINE-001: PEP is mandatory at every action executes exactly once only after policy, capability and consumption checks pass
statusReason: promise rejected "PepDeniedError: Policy enforcement denied… { reason_code: '…' }" instead of resolving

[Killed] ConditionalExpression
security/pep.ts:145:9
     }
     if (!decision.allowed) return this.#deny(request, 'policy_denied', tier);
 
-    if (request.context.policy_hash !== this.#policyEngine.policy_hash) {
+    if (false) {
       return this.#deny(request, 'wrong_policy_hash', tier);
     }
killedBy: AH-POLICY-ENGINE-001: PEP binds every authorization dimension rejects a mismatched policy hash
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
security/pep.ts:148:73
     if (request.context.policy_hash !== this.#policyEngine.policy_hash) {
       return this.#deny(request, 'wrong_policy_hash', tier);
     }
-    if (request.manifest.policy_version !== this.#policyEngine.version) {
-      return this.#deny(request, 'wrong_policy_version', tier);
-    }
+    if (request.manifest.policy_version !== this.#policyEngine.version) {}
 
     let signatureValid: boolean;
killedBy: AH-POLICY-ENGINE-001: PEP binds every authorization dimension rejects a mismatched policy version
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
security/pep.ts:148:9
     if (request.context.policy_hash !== this.#policyEngine.policy_hash) {
       return this.#deny(request, 'wrong_policy_hash', tier);
     }
-    if (request.manifest.policy_version !== this.#policyEngine.version) {
+    if (true) {
       return this.#deny(request, 'wrong_policy_version', tier);
     }
killedBy: AH-POLICY-ENGINE-001: PEP is mandatory at every action executes exactly once only after policy, capability and consumption checks pass
statusReason: promise rejected "PepDeniedError: Policy enforcement denied… { reason_code: '…' }" instead of resolving

[Killed] BlockStatement
security/pep.ts:153:9
     }
 
     let signatureValid: boolean;
-    try {
-      signatureValid = await this.#verifySignature(request.token);
-    } catch {
+    try {} catch {
       signatureValid = false;
     }
killedBy: AH-POLICY-ENGINE-001: PEP is mandatory at every action executes exactly once only after policy, capability and consumption checks pass
statusReason: promise rejected "PepDeniedError: Policy enforcement denied… { reason_code: '…' }" instead of resolving

[NoCoverage] BlockStatement
security/pep.ts:155:13
     let signatureValid: boolean;
     try {
       signatureValid = await this.#verifySignature(request.token);
-    } catch {
-      signatureValid = false;
-    }
+    } catch {}
     if (!signatureValid) return this.#deny(request, 'invalid_signature', tier);
 

[NoCoverage] BooleanLiteral
security/pep.ts:156:24
     try {
       signatureValid = await this.#verifySignature(request.token);
     } catch {
-      signatureValid = false;
+      signatureValid = true;
     }
     if (!signatureValid) return this.#deny(request, 'invalid_signature', tier);

[Killed] ConditionalExpression
security/pep.ts:158:9
     } catch {
       signatureValid = false;
     }
-    if (!signatureValid) return this.#deny(request, 'invalid_signature', tier);
+    if (false) return this.#deny(request, 'invalid_signature', tier);
 
     const issuedAt = strictTimestamp(request.token.issued_at);
killedBy: AH-POLICY-ENGINE-001: PEP is mandatory at every action rejects an invalid signature through the injected Authorization Service boundary
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
security/pep.ts:158:9
     } catch {
       signatureValid = false;
     }
-    if (!signatureValid) return this.#deny(request, 'invalid_signature', tier);
+    if (true) return this.#deny(request, 'invalid_signature', tier);
 
     const issuedAt = strictTimestamp(request.token.issued_at);
killedBy: AH-POLICY-ENGINE-001: PEP is mandatory at every action executes exactly once only after policy, capability and consumption checks pass
statusReason: promise rejected "PepDeniedError: Policy enforcement denied… { reason_code: '…' }" instead of resolving

[Killed] EqualityOperator
security/pep.ts:165:7
     const expiresAt = strictTimestamp(request.token.expires_at);
     const nowValue = strictTimestamp(now);
     if (
-      issuedAt === undefined ||
+      issuedAt !== undefined ||
       notBefore === undefined ||
       expiresAt === undefined ||
killedBy: AH-POLICY-ENGINE-001: PEP is mandatory at every action executes exactly once only after policy, capability and consumption checks pass
statusReason: promise rejected "PepDeniedError: Policy enforcement denied… { reason_code: '…' }" instead of resolving

[Killed] LogicalOperator
security/pep.ts:165:7
     const expiresAt = strictTimestamp(request.token.expires_at);
     const nowValue = strictTimestamp(now);
     if (
-      issuedAt === undefined ||
-      notBefore === undefined ||
-      expiresAt === undefined ||
+      (issuedAt === undefined || notBefore === undefined) && expiresAt === undefined ||
       nowValue === undefined
     ) {
killedBy: AH-POLICY-ENGINE-001: token time validation rejects malformed date-time strings
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
security/pep.ts:166:7
     const nowValue = strictTimestamp(now);
     if (
       issuedAt === undefined ||
-      notBefore === undefined ||
+      false ||
       expiresAt === undefined ||
       nowValue === undefined
killedBy: AH-POLICY-ENGINE-001: token time validation rejects malformed date-time strings
statusReason: promise resolved "undefined" instead of rejecting

[Killed] EqualityOperator
security/pep.ts:166:7
     const nowValue = strictTimestamp(now);
     if (
       issuedAt === undefined ||
-      notBefore === undefined ||
+      notBefore !== undefined ||
       expiresAt === undefined ||
       nowValue === undefined
killedBy: AH-POLICY-ENGINE-001: PEP is mandatory at every action executes exactly once only after policy, capability and consumption checks pass
statusReason: promise rejected "PepDeniedError: Policy enforcement denied… { reason_code: '…' }" instead of resolving

[Killed] ConditionalExpression
security/pep.ts:167:7
     if (
       issuedAt === undefined ||
       notBefore === undefined ||
-      expiresAt === undefined ||
+      false ||
       nowValue === undefined
     ) {
killedBy: AH-POLICY-ENGINE-001: token time validation rejects malformed date-time strings
statusReason: promise resolved "undefined" instead of rejecting

[Killed] EqualityOperator
security/pep.ts:167:7
     if (
       issuedAt === undefined ||
       notBefore === undefined ||
-      expiresAt === undefined ||
+      expiresAt !== undefined ||
       nowValue === undefined
     ) {
killedBy: AH-POLICY-ENGINE-001: PEP is mandatory at every action executes exactly once only after policy, capability and consumption checks pass
statusReason: promise rejected "PepDeniedError: Policy enforcement denied… { reason_code: '…' }" instead of resolving

[Killed] EqualityOperator
security/pep.ts:168:7
       issuedAt === undefined ||
       notBefore === undefined ||
       expiresAt === undefined ||
-      nowValue === undefined
+      nowValue !== undefined
     ) {
       return this.#deny(request, 'invalid_time', tier);
killedBy: AH-POLICY-ENGINE-001: PEP is mandatory at every action executes exactly once only after policy, capability and consumption checks pass
statusReason: promise rejected "PepDeniedError: Policy enforcement denied… { reason_code: '…' }" instead of resolving

[Survived] ConditionalExpression
security/pep.ts:168:7
       issuedAt === undefined ||
       notBefore === undefined ||
       expiresAt === undefined ||
-      nowValue === undefined
+      false
     ) {
       return this.#deny(request, 'invalid_time', tier);

[Killed] BlockStatement
security/pep.ts:169:7
       notBefore === undefined ||
       expiresAt === undefined ||
       nowValue === undefined
-    ) {
-      return this.#deny(request, 'invalid_time', tier);
-    }
+    ) {}
     if (issuedAt > notBefore || notBefore >= expiresAt) {
       return this.#deny(request, 'invalid_time_order', tier);
killedBy: AH-POLICY-ENGINE-001: token time validation rejects malformed date-time strings
statusReason: promise resolved "undefined" instead of rejecting

[Killed] EqualityOperator
security/pep.ts:172:33
     ) {
       return this.#deny(request, 'invalid_time', tier);
     }
-    if (issuedAt > notBefore || notBefore >= expiresAt) {
+    if (issuedAt > notBefore || notBefore < expiresAt) {
       return this.#deny(request, 'invalid_time_order', tier);
     }
killedBy: AH-POLICY-ENGINE-001: PEP is mandatory at every action executes exactly once only after policy, capability and consumption checks pass
statusReason: promise rejected "PepDeniedError: Policy enforcement denied… { reason_code: '…' }" instead of resolving

[Killed] BlockStatement
security/pep.ts:172:57
     ) {
       return this.#deny(request, 'invalid_time', tier);
     }
-    if (issuedAt > notBefore || notBefore >= expiresAt) {
-      return this.#deny(request, 'invalid_time_order', tier);
-    }
+    if (issuedAt > notBefore || notBefore >= expiresAt) {}
     if (nowValue < notBefore) return this.#deny(request, 'not_yet_valid', tier);
     if (nowValue >= expiresAt) return this.#deny(request, 'expired', tier);
killedBy: AH-POLICY-ENGINE-001: token time validation rejects invalid temporal ordering
statusReason: expected PepDeniedError: Policy enforcement denied… { reason_code: '…' } to match object { name: 'PepDeniedError', …(1) }

[Killed] EqualityOperator
security/pep.ts:175:9
     if (issuedAt > notBefore || notBefore >= expiresAt) {
       return this.#deny(request, 'invalid_time_order', tier);
     }
-    if (nowValue < notBefore) return this.#deny(request, 'not_yet_valid', tier);
+    if (nowValue <= notBefore) return this.#deny(request, 'not_yet_valid', tier);
     if (nowValue >= expiresAt) return this.#deny(request, 'expired', tier);
     const manifestExpiresAt = strictTimestamp(request.manifest.expires_at);
killedBy: AH-POLICY-ENGINE-001: PEP is mandatory at every action executes exactly once only after policy, capability and consumption checks pass
statusReason: promise rejected "PepDeniedError: Policy enforcement denied… { reason_code: '…' }" instead of resolving

[Killed] EqualityOperator
security/pep.ts:175:9
     if (issuedAt > notBefore || notBefore >= expiresAt) {
       return this.#deny(request, 'invalid_time_order', tier);
     }
-    if (nowValue < notBefore) return this.#deny(request, 'not_yet_valid', tier);
+    if (nowValue >= notBefore) return this.#deny(request, 'not_yet_valid', tier);
     if (nowValue >= expiresAt) return this.#deny(request, 'expired', tier);
     const manifestExpiresAt = strictTimestamp(request.manifest.expires_at);
killedBy: AH-POLICY-ENGINE-001: PEP is mandatory at every action executes exactly once only after policy, capability and consumption checks pass
statusReason: promise rejected "PepDeniedError: Policy enforcement denied… { reason_code: '…' }" instead of resolving

[Killed] ConditionalExpression
security/pep.ts:176:9
       return this.#deny(request, 'invalid_time_order', tier);
     }
     if (nowValue < notBefore) return this.#deny(request, 'not_yet_valid', tier);
-    if (nowValue >= expiresAt) return this.#deny(request, 'expired', tier);
+    if (false) return this.#deny(request, 'expired', tier);
     const manifestExpiresAt = strictTimestamp(request.manifest.expires_at);
     if (manifestExpiresAt === undefined) return this.#deny(request, 'invalid_manifest_time', tier);
killedBy: AH-POLICY-ENGINE-001: token time validation treats expires_at as an exclusive boundary
statusReason: promise resolved "undefined" instead of rejecting
