[Killed] BlockStatement
runtime/notifications.ts:20:32
 }
 
 export class NotificationError extends Error {
-  constructor(message: string) { super(message); this.name = 'NotificationError'; Object.setPrototypeOf(this, NotificationError.prototype); }
+  constructor(message: string) {}
 }
 
killedBy: AH-CAPMAP-020 in-app notifications body max 500 chars
statusReason: expected error to be instance of NotificationError

[Killed] BlockStatement
runtime/notifications.ts:26:24
 const MAX_BODY = 500;
 const DEFAULT_TTL_DAYS = 30;
 
-function uid(): string { return 'n-' + Math.random().toString(36).slice(2, 12) + Date.now().toString(36); }
+function uid(): string {}
 
 export class NotificationService {
killedBy: AH-CAPMAP-020 in-app notifications POST creates notification with id, user_id, type, title, body, created_at, read=false
statusReason: expected undefined to be truthy

[Killed] ArithmeticOperator
runtime/notifications.ts:26:33
 const MAX_BODY = 500;
 const DEFAULT_TTL_DAYS = 30;
 
-function uid(): string { return 'n-' + Math.random().toString(36).slice(2, 12) + Date.now().toString(36); }
+function uid(): string { return 'n-' + Math.random().toString(36).slice(2, 12) - Date.now().toString(36); }
 
 export class NotificationService {
killedBy: AH-CAPMAP-020 in-app notifications POST creates notification with id, user_id, type, title, body, created_at, read=false
statusReason: expected NaN to be truthy

[Killed] BlockStatement
runtime/notifications.ts:34:43
   private readonly ttlDays: number;
   private seq = 0;
 
-  constructor(ttlDays = DEFAULT_TTL_DAYS) { this.ttlDays = ttlDays; }
+  constructor(ttlDays = DEFAULT_TTL_DAYS) {}
 
   /** POST /notifications — requires authenticated user. */
killedBy: AH-CAPMAP-020 in-app notifications POST creates notification with id, user_id, type, title, body, created_at, read=false
statusReason: Invalid time value

[Killed] BlockStatement
runtime/notifications.ts:37:94
   constructor(ttlDays = DEFAULT_TTL_DAYS) { this.ttlDays = ttlDays; }
 
   /** POST /notifications — requires authenticated user. */
-  create(user_id: string, type: NotificationType, title: string, body: string): Notification {
-    if (!user_id) throw new NotificationError('authenticated session required');
-    if (body.length > MAX_BODY) throw new NotificationError(`body exceeds ${MAX_BODY} chars`);
-    const now = new Date();
-    const expires = new Date(now.getTime() + this.ttlDays * 86400_000);
-    const n: Notification = { id: uid(), user_id, type, title, body, created_at: now.toISOString(), read: false, expires_at: expires.toISOString(), seq: ++this.seq };
-    this.notifications.set(n.id, n);
-    if (!this.userIndex.has(user_id)) this.userIndex.set(user_id, new Set());
-    this.userIndex.get(user_id)!.add(n.id);
-    return n;
-  }
+  create(user_id: string, type: NotificationType, title: string, body: string): Notification {}
 
   /** GET /notifications — returns unread for user, sorted by created_at desc. */
killedBy: AH-CAPMAP-020 in-app notifications POST creates notification with id, user_id, type, title, body, created_at, read=false
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] BooleanLiteral
runtime/notifications.ts:38:9
 
   /** POST /notifications — requires authenticated user. */
   create(user_id: string, type: NotificationType, title: string, body: string): Notification {
-    if (!user_id) throw new NotificationError('authenticated session required');
+    if (user_id) throw new NotificationError('authenticated session required');
     if (body.length > MAX_BODY) throw new NotificationError(`body exceeds ${MAX_BODY} chars`);
     const now = new Date();
killedBy: AH-CAPMAP-020 in-app notifications POST creates notification with id, user_id, type, title, body, created_at, read=false
statusReason: authenticated session required

[Killed] ConditionalExpression
runtime/notifications.ts:38:9
 
   /** POST /notifications — requires authenticated user. */
   create(user_id: string, type: NotificationType, title: string, body: string): Notification {
-    if (!user_id) throw new NotificationError('authenticated session required');
+    if (false) throw new NotificationError('authenticated session required');
     if (body.length > MAX_BODY) throw new NotificationError(`body exceeds ${MAX_BODY} chars`);
     const now = new Date();
killedBy: AH-CAPMAP-020 in-app notifications notification creation requires authenticated session
statusReason: expected function to throw an error, but it didn't

[Killed] EqualityOperator
runtime/notifications.ts:39:9
   /** POST /notifications — requires authenticated user. */
   create(user_id: string, type: NotificationType, title: string, body: string): Notification {
     if (!user_id) throw new NotificationError('authenticated session required');
-    if (body.length > MAX_BODY) throw new NotificationError(`body exceeds ${MAX_BODY} chars`);
+    if (body.length >= MAX_BODY) throw new NotificationError(`body exceeds ${MAX_BODY} chars`);
     const now = new Date();
     const expires = new Date(now.getTime() + this.ttlDays * 86400_000);
killedBy: AH-CAPMAP-020 in-app notifications body max 500 chars
statusReason: expected [Function] to not throw an error but 'NotificationError: body exceeds 500 c…' was thrown

[Killed] ConditionalExpression
runtime/notifications.ts:39:9
   /** POST /notifications — requires authenticated user. */
   create(user_id: string, type: NotificationType, title: string, body: string): Notification {
     if (!user_id) throw new NotificationError('authenticated session required');
-    if (body.length > MAX_BODY) throw new NotificationError(`body exceeds ${MAX_BODY} chars`);
+    if (true) throw new NotificationError(`body exceeds ${MAX_BODY} chars`);
     const now = new Date();
     const expires = new Date(now.getTime() + this.ttlDays * 86400_000);
killedBy: AH-CAPMAP-020 in-app notifications POST creates notification with id, user_id, type, title, body, created_at, read=false
statusReason: body exceeds 500 chars

[Killed] ArithmeticOperator
runtime/notifications.ts:41:46
     if (!user_id) throw new NotificationError('authenticated session required');
     if (body.length > MAX_BODY) throw new NotificationError(`body exceeds ${MAX_BODY} chars`);
     const now = new Date();
-    const expires = new Date(now.getTime() + this.ttlDays * 86400_000);
+    const expires = new Date(now.getTime() + this.ttlDays / 86400_000);
     const n: Notification = { id: uid(), user_id, type, title, body, created_at: now.toISOString(), read: false, expires_at: expires.toISOString(), seq: ++this.seq };
     this.notifications.set(n.id, n);
killedBy: AH-CAPMAP-020 in-app notifications GET returns unread notifications sorted by created_at desc
statusReason: expected [] to have a length of 2 but got +0

[Killed] ArithmeticOperator
runtime/notifications.ts:41:30
     if (!user_id) throw new NotificationError('authenticated session required');
     if (body.length > MAX_BODY) throw new NotificationError(`body exceeds ${MAX_BODY} chars`);
     const now = new Date();
-    const expires = new Date(now.getTime() + this.ttlDays * 86400_000);
+    const expires = new Date(now.getTime() - this.ttlDays * 86400_000);
     const n: Notification = { id: uid(), user_id, type, title, body, created_at: now.toISOString(), read: false, expires_at: expires.toISOString(), seq: ++this.seq };
     this.notifications.set(n.id, n);
killedBy: AH-CAPMAP-020 in-app notifications GET returns unread notifications sorted by created_at desc
statusReason: expected [] to have a length of 2 but got +0

[Killed] UpdateOperator
runtime/notifications.ts:42:154
     if (body.length > MAX_BODY) throw new NotificationError(`body exceeds ${MAX_BODY} chars`);
     const now = new Date();
     const expires = new Date(now.getTime() + this.ttlDays * 86400_000);
-    const n: Notification = { id: uid(), user_id, type, title, body, created_at: now.toISOString(), read: false, expires_at: expires.toISOString(), seq: ++this.seq };
+    const n: Notification = { id: uid(), user_id, type, title, body, created_at: now.toISOString(), read: false, expires_at: expires.toISOString(), seq: --this.seq };
     this.notifications.set(n.id, n);
     if (!this.userIndex.has(user_id)) this.userIndex.set(user_id, new Set());
killedBy: AH-CAPMAP-020 in-app notifications GET returns unread notifications sorted by created_at desc
statusReason: expected 'n-ef710jy676mrv498qa' to be 'n-f4eo13zf9nmrv498qa' // Object.is equality

[Killed] BooleanLiteral
runtime/notifications.ts:42:107
     if (body.length > MAX_BODY) throw new NotificationError(`body exceeds ${MAX_BODY} chars`);
     const now = new Date();
     const expires = new Date(now.getTime() + this.ttlDays * 86400_000);
-    const n: Notification = { id: uid(), user_id, type, title, body, created_at: now.toISOString(), read: false, expires_at: expires.toISOString(), seq: ++this.seq };
+    const n: Notification = { id: uid(), user_id, type, title, body, created_at: now.toISOString(), read: true, expires_at: expires.toISOString(), seq: ++this.seq };
     this.notifications.set(n.id, n);
     if (!this.userIndex.has(user_id)) this.userIndex.set(user_id, new Set());
killedBy: AH-CAPMAP-020 in-app notifications POST creates notification with id, user_id, type, title, body, created_at, read=false
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
runtime/notifications.ts:44:9
     const expires = new Date(now.getTime() + this.ttlDays * 86400_000);
     const n: Notification = { id: uid(), user_id, type, title, body, created_at: now.toISOString(), read: false, expires_at: expires.toISOString(), seq: ++this.seq };
     this.notifications.set(n.id, n);
-    if (!this.userIndex.has(user_id)) this.userIndex.set(user_id, new Set());
+    if (false) this.userIndex.set(user_id, new Set());
     this.userIndex.get(user_id)!.add(n.id);
     return n;
killedBy: AH-CAPMAP-020 in-app notifications POST creates notification with id, user_id, type, title, body, created_at, read=false
statusReason: Cannot read properties of undefined (reading 'add')

[Killed] ConditionalExpression
runtime/notifications.ts:44:9
     const expires = new Date(now.getTime() + this.ttlDays * 86400_000);
     const n: Notification = { id: uid(), user_id, type, title, body, created_at: now.toISOString(), read: false, expires_at: expires.toISOString(), seq: ++this.seq };
     this.notifications.set(n.id, n);
-    if (!this.userIndex.has(user_id)) this.userIndex.set(user_id, new Set());
+    if (true) this.userIndex.set(user_id, new Set());
     this.userIndex.get(user_id)!.add(n.id);
     return n;
killedBy: AH-CAPMAP-020 in-app notifications GET returns unread notifications sorted by created_at desc
statusReason: expected [ Array(1) ] to have a length of 2 but got 1

[Killed] BooleanLiteral
runtime/notifications.ts:50:39
   }
 
   /** GET /notifications — returns unread for user, sorted by created_at desc. */
-  list(user_id: string, includeRead = false): Notification[] {
+  list(user_id: string, includeRead = true): Notification[] {
     const ids = this.userIndex.get(user_id);
     if (!ids) return [];
killedBy: AH-CAPMAP-020 in-app notifications GET ?include_read=true returns all
statusReason: expected [ Array(1) ] to have a length of +0 but got 1

[Killed] BlockStatement
runtime/notifications.ts:50:62
   }
 
   /** GET /notifications — returns unread for user, sorted by created_at desc. */
-  list(user_id: string, includeRead = false): Notification[] {
-    const ids = this.userIndex.get(user_id);
-    if (!ids) return [];
-    const now = new Date().toISOString();
-    return [...ids]
-      .map(id => this.notifications.get(id)!)
-      .filter(n => n && n.expires_at > now)
-      .filter(n => includeRead || !n.read)
-      .sort((a, b) => b.created_at.localeCompare(a.created_at) || b.seq - a.seq);
-  }
+  list(user_id: string, includeRead = false): Notification[] {}
 
   /** PATCH /notifications/{id} — mark as read. */
killedBy: AH-CAPMAP-020 in-app notifications GET returns unread notifications sorted by created_at desc
statusReason: Target cannot be null or undefined.

[Killed] BooleanLiteral
runtime/notifications.ts:52:9
   /** GET /notifications — returns unread for user, sorted by created_at desc. */
   list(user_id: string, includeRead = false): Notification[] {
     const ids = this.userIndex.get(user_id);
-    if (!ids) return [];
+    if (ids) return [];
     const now = new Date().toISOString();
     return [...ids]
killedBy: AH-CAPMAP-020 in-app notifications GET returns unread notifications sorted by created_at desc
statusReason: expected [] to have a length of 2 but got +0

[Killed] ConditionalExpression
runtime/notifications.ts:52:9
   /** GET /notifications — returns unread for user, sorted by created_at desc. */
   list(user_id: string, includeRead = false): Notification[] {
     const ids = this.userIndex.get(user_id);
-    if (!ids) return [];
+    if (true) return [];
     const now = new Date().toISOString();
     return [...ids]
killedBy: AH-CAPMAP-020 in-app notifications GET returns unread notifications sorted by created_at desc
statusReason: expected [] to have a length of 2 but got +0

[Killed] MethodExpression
runtime/notifications.ts:54:12
     const ids = this.userIndex.get(user_id);
     if (!ids) return [];
     const now = new Date().toISOString();
-    return [...ids]
-      .map(id => this.notifications.get(id)!)
-      .filter(n => n && n.expires_at > now)
-      .filter(n => includeRead || !n.read)
+    return [...ids].map(id => this.notifications.get(id)!).filter(n => n && n.expires_at > now)
       .sort((a, b) => b.created_at.localeCompare(a.created_at) || b.seq - a.seq);
   }
killedBy: AH-CAPMAP-020 in-app notifications GET ?include_read=true returns all
statusReason: expected [ Array(1) ] to have a length of +0 but got 1

[Killed] MethodExpression
runtime/notifications.ts:54:12
     const ids = this.userIndex.get(user_id);
     if (!ids) return [];
     const now = new Date().toISOString();
-    return [...ids]
-      .map(id => this.notifications.get(id)!)
-      .filter(n => n && n.expires_at > now)
-      .filter(n => includeRead || !n.read)
-      .sort((a, b) => b.created_at.localeCompare(a.created_at) || b.seq - a.seq);
+    return [...ids].map(id => this.notifications.get(id)!).filter(n => n && n.expires_at > now).filter(n => includeRead || !n.read);
   }
 
killedBy: AH-CAPMAP-020 in-app notifications GET returns unread notifications sorted by created_at desc
statusReason: expected 'n-2m4yyjgp8cmrv4994s' to be 'n-bagzaw8sq5mrv4994s' // Object.is equality

[Killed] ArrowFunction
runtime/notifications.ts:55:12
     if (!ids) return [];
     const now = new Date().toISOString();
     return [...ids]
-      .map(id => this.notifications.get(id)!)
+      .map(() => undefined)
       .filter(n => n && n.expires_at > now)
       .filter(n => includeRead || !n.read)
killedBy: AH-CAPMAP-020 in-app notifications GET returns unread notifications sorted by created_at desc
statusReason: expected [] to have a length of 2 but got +0

[Killed] ConditionalExpression
runtime/notifications.ts:56:20
     const now = new Date().toISOString();
     return [...ids]
       .map(id => this.notifications.get(id)!)
-      .filter(n => n && n.expires_at > now)
+      .filter(n => false)
       .filter(n => includeRead || !n.read)
       .sort((a, b) => b.created_at.localeCompare(a.created_at) || b.seq - a.seq);
killedBy: AH-CAPMAP-020 in-app notifications GET returns unread notifications sorted by created_at desc
statusReason: expected [] to have a length of 2 but got +0

[Killed] ArrowFunction
runtime/notifications.ts:56:15
     const now = new Date().toISOString();
     return [...ids]
       .map(id => this.notifications.get(id)!)
-      .filter(n => n && n.expires_at > now)
+      .filter(() => undefined)
       .filter(n => includeRead || !n.read)
       .sort((a, b) => b.created_at.localeCompare(a.created_at) || b.seq - a.seq);
killedBy: AH-CAPMAP-020 in-app notifications GET returns unread notifications sorted by created_at desc
statusReason: expected [] to have a length of 2 but got +0

[Killed] ConditionalExpression
runtime/notifications.ts:57:20
     return [...ids]
       .map(id => this.notifications.get(id)!)
       .filter(n => n && n.expires_at > now)
-      .filter(n => includeRead || !n.read)
+      .filter(n => true)
       .sort((a, b) => b.created_at.localeCompare(a.created_at) || b.seq - a.seq);
   }
killedBy: AH-CAPMAP-020 in-app notifications GET ?include_read=true returns all
statusReason: expected [ Array(1) ] to have a length of +0 but got 1

[Killed] ConditionalExpression
runtime/notifications.ts:57:20
     return [...ids]
       .map(id => this.notifications.get(id)!)
       .filter(n => n && n.expires_at > now)
-      .filter(n => includeRead || !n.read)
+      .filter(n => false)
       .sort((a, b) => b.created_at.localeCompare(a.created_at) || b.seq - a.seq);
   }
killedBy: AH-CAPMAP-020 in-app notifications GET returns unread notifications sorted by created_at desc
statusReason: expected [] to have a length of 2 but got +0

[Killed] ArrowFunction
runtime/notifications.ts:58:13
       .map(id => this.notifications.get(id)!)
       .filter(n => n && n.expires_at > now)
       .filter(n => includeRead || !n.read)
-      .sort((a, b) => b.created_at.localeCompare(a.created_at) || b.seq - a.seq);
+      .sort(() => undefined);
   }
 
killedBy: AH-CAPMAP-020 in-app notifications GET returns unread notifications sorted by created_at desc
statusReason: expected 'n-bjrf63pcywmrv499vi' to be 'n-80rho78yznmrv499vi' // Object.is equality

[Killed] ConditionalExpression
runtime/notifications.ts:58:23
       .map(id => this.notifications.get(id)!)
       .filter(n => n && n.expires_at > now)
       .filter(n => includeRead || !n.read)
-      .sort((a, b) => b.created_at.localeCompare(a.created_at) || b.seq - a.seq);
+      .sort((a, b) => true);
   }
 
killedBy: AH-CAPMAP-020 in-app notifications GET returns unread notifications sorted by created_at desc
statusReason: expected 'n-ky9y35h3l1mrv499x1' to be 'n-fq7llrl01qmrv499x1' // Object.is equality

[Killed] BlockStatement
runtime/notifications.ts:62:47
   }
 
   /** PATCH /notifications/{id} — mark as read. */
-  markRead(user_id: string, id: string): void {
-    const n = this.notifications.get(id);
-    if (!n || n.user_id !== user_id) throw new NotificationError('not found or not owner');
-    n.read = true;
-  }
+  markRead(user_id: string, id: string): void {}
 
   /** DELETE /notifications/{id} — dismiss. */
killedBy: AH-CAPMAP-020 in-app notifications GET ?include_read=true returns all
statusReason: expected [ Array(1) ] to have a length of +0 but got 1

[Killed] BooleanLiteral
runtime/notifications.ts:64:9
   /** PATCH /notifications/{id} — mark as read. */
   markRead(user_id: string, id: string): void {
     const n = this.notifications.get(id);
-    if (!n || n.user_id !== user_id) throw new NotificationError('not found or not owner');
+    if (n || n.user_id !== user_id) throw new NotificationError('not found or not owner');
     n.read = true;
   }
killedBy: AH-CAPMAP-020 in-app notifications GET ?include_read=true returns all
statusReason: not found or not owner

[Killed] ConditionalExpression
runtime/notifications.ts:64:9
   /** PATCH /notifications/{id} — mark as read. */
   markRead(user_id: string, id: string): void {
     const n = this.notifications.get(id);
-    if (!n || n.user_id !== user_id) throw new NotificationError('not found or not owner');
+    if (true) throw new NotificationError('not found or not owner');
     n.read = true;
   }
killedBy: AH-CAPMAP-020 in-app notifications GET ?include_read=true returns all
statusReason: not found or not owner

[Killed] BooleanLiteral
runtime/notifications.ts:65:14
   markRead(user_id: string, id: string): void {
     const n = this.notifications.get(id);
     if (!n || n.user_id !== user_id) throw new NotificationError('not found or not owner');
-    n.read = true;
+    n.read = false;
   }
 
killedBy: AH-CAPMAP-020 in-app notifications GET ?include_read=true returns all
statusReason: expected [ Array(1) ] to have a length of +0 but got 1

[Killed] BlockStatement
runtime/notifications.ts:69:46
   }
 
   /** DELETE /notifications/{id} — dismiss. */
-  dismiss(user_id: string, id: string): void {
-    const n = this.notifications.get(id);
-    if (!n || n.user_id !== user_id) throw new NotificationError('not found or not owner');
-    this.notifications.delete(id);
-    this.userIndex.get(user_id)?.delete(id);
-  }
+  dismiss(user_id: string, id: string): void {}
 
   /** Purge expired notifications. */
killedBy: AH-CAPMAP-020 in-app notifications DELETE dismisses notification
statusReason: expected [ Array(1) ] to have a length of +0 but got 1

[Survived] OptionalChaining
runtime/notifications.ts:73:5
     const n = this.notifications.get(id);
     if (!n || n.user_id !== user_id) throw new NotificationError('not found or not owner');
     this.notifications.delete(id);
-    this.userIndex.get(user_id)?.delete(id);
+    this.userIndex.get(user_id).delete(id);
   }
 

[Survived] BlockStatement
runtime/notifications.ts:77:26
   }
 
   /** Purge expired notifications. */
-  purgeExpired(): number {
-    const now = new Date().toISOString();
-    let purged = 0;
-    for (const [id, n] of this.notifications) {
-      if (n.expires_at <= now) { this.notifications.delete(id); this.userIndex.get(n.user_id)?.delete(id); purged++; }
-    }
-    return purged;
-  }
+  purgeExpired(): number {}
 }
 

[Survived] BlockStatement
runtime/notifications.ts:80:47
   purgeExpired(): number {
     const now = new Date().toISOString();
     let purged = 0;
-    for (const [id, n] of this.notifications) {
-      if (n.expires_at <= now) { this.notifications.delete(id); this.userIndex.get(n.user_id)?.delete(id); purged++; }
-    }
+    for (const [id, n] of this.notifications) {}
     return purged;
   }

[Survived] ConditionalExpression
runtime/notifications.ts:81:11
     const now = new Date().toISOString();
     let purged = 0;
     for (const [id, n] of this.notifications) {
-      if (n.expires_at <= now) { this.notifications.delete(id); this.userIndex.get(n.user_id)?.delete(id); purged++; }
+      if (false) { this.notifications.delete(id); this.userIndex.get(n.user_id)?.delete(id); purged++; }
     }
     return purged;

[Survived] EqualityOperator
runtime/notifications.ts:81:11
     const now = new Date().toISOString();
     let purged = 0;
     for (const [id, n] of this.notifications) {
-      if (n.expires_at <= now) { this.notifications.delete(id); this.userIndex.get(n.user_id)?.delete(id); purged++; }
+      if (n.expires_at > now) { this.notifications.delete(id); this.userIndex.get(n.user_id)?.delete(id); purged++; }
     }
     return purged;
