[Killed] BlockStatement
runtime/retry.ts:43:53
 export class RetryExhausted extends Error {
   readonly lastError: unknown;
   readonly attempts: number;
-  constructor(lastError: unknown, attempts: number) {
-    super(`retry exhausted after ${attempts} attempts: ${(lastError as Error)?.message ?? String(lastError)}`);
-    this.name = 'RetryExhausted';
-    this.lastError = lastError;
-    this.attempts = attempts;
-    Object.setPrototypeOf(this, RetryExhausted.prototype);
-  }
+  constructor(lastError: unknown, attempts: number) {}
 }
 
killedBy: AH-CAPMAP-013 retry + circuit breaker retry RetryExhausted includes last error and attempt count
statusReason: expected ReferenceError: Must call super construct… to be an instance of RetryExhausted

[Survived] LogicalOperator
runtime/retry.ts:44:58
   readonly lastError: unknown;
   readonly attempts: number;
   constructor(lastError: unknown, attempts: number) {
-    super(`retry exhausted after ${attempts} attempts: ${(lastError as Error)?.message ?? String(lastError)}`);
+    super(`retry exhausted after ${attempts} attempts: ${(lastError as Error)?.message && String(lastError)}`);
     this.name = 'RetryExhausted';
     this.lastError = lastError;

[Survived] OptionalChaining
runtime/retry.ts:44:58
   readonly lastError: unknown;
   readonly attempts: number;
   constructor(lastError: unknown, attempts: number) {
-    super(`retry exhausted after ${attempts} attempts: ${(lastError as Error)?.message ?? String(lastError)}`);
+    super(`retry exhausted after ${attempts} attempts: ${(lastError as Error).message ?? String(lastError)}`);
     this.name = 'RetryExhausted';
     this.lastError = lastError;

[Survived] StringLiteral
runtime/retry.ts:45:17
   readonly attempts: number;
   constructor(lastError: unknown, attempts: number) {
     super(`retry exhausted after ${attempts} attempts: ${(lastError as Error)?.message ?? String(lastError)}`);
-    this.name = 'RetryExhausted';
+    this.name = "";
     this.lastError = lastError;
     this.attempts = attempts;

[Killed] BlockStatement
runtime/retry.ts:54:37
 
 export class CircuitOpenError extends Error {
   readonly retryAfterMs: number;
-  constructor(retryAfterMs: number) {
-    super(`circuit breaker open; retry after ${retryAfterMs}ms`);
-    this.name = 'CircuitOpenError';
-    this.retryAfterMs = retryAfterMs;
-    Object.setPrototypeOf(this, CircuitOpenError.prototype);
-  }
+  constructor(retryAfterMs: number) {}
 }
 
killedBy: AH-CAPMAP-013 retry + circuit breaker circuit breaker opens after 5 consecutive failures, blocks for 60s
statusReason: expected error to be instance of CircuitOpenError

[Survived] StringLiteral
runtime/retry.ts:55:11
 export class CircuitOpenError extends Error {
   readonly retryAfterMs: number;
   constructor(retryAfterMs: number) {
-    super(`circuit breaker open; retry after ${retryAfterMs}ms`);
+    super(``);
     this.name = 'CircuitOpenError';
     this.retryAfterMs = retryAfterMs;

[Survived] ObjectLiteral
runtime/retry.ts:62:18
   }
 }
 
-const DEFAULTS = { maxAttempts: 3, baseDelay: 1000, maxDelay: 30000, jitterMs: 500 };
+const DEFAULTS = {};
 
 /** Classify an error as retryable or non-retryable. */

[Killed] BlockStatement
runtime/retry.ts:65:61
 const DEFAULTS = { maxAttempts: 3, baseDelay: 1000, maxDelay: 30000, jitterMs: 500 };
 
 /** Classify an error as retryable or non-retryable. */
-export function classifyError(err: unknown): RetryableError {
-  if (err && typeof err === 'object' && 'status' in err) {
-    const status = (err as { status: number }).status;
-    if (status === 400 || status === 401 || status === 403 || status === 404 || status === 422) {
-      return { kind: 'unknown', status, retryable: false, message: (err as { message?: string })?.message ?? `status ${status}` };
-    }
-    if (status === 429) return { kind: 'rate_limited', status, retryable: true, message: 'rate limited' };
-    if (status >= 500) return { kind: 'server', status, retryable: true, message: `server error ${status}` };
-  }
-  const msg = (err as Error)?.message ?? String(err);
-  if (/network|econnreset|econnrefused|etimedout|socket hang up|fetch failed/i.test(msg)) {
-    return { kind: 'network', retryable: true, message: msg, cause: err };
-  }
-  if (/timeout|timed out/i.test(msg)) return { kind: 'timeout', retryable: true, message: msg, cause: err };
-  return { kind: 'unknown', retryable: false, message: msg, cause: err };
-}
+export function classifyError(err: unknown): RetryableError {}
 
 /** Circuit breaker: opens after 5 consecutive failures, blocks 60s, half-open allows 1 probe. */
killedBy: AH-CAPMAP-013 retry + circuit breaker retry calls fn at most maxAttempts times
statusReason: promise rejected "TypeError: Cannot read properties of unde…" instead of resolving

[Killed] ConditionalExpression
runtime/retry.ts:66:7
 
 /** Classify an error as retryable or non-retryable. */
 export function classifyError(err: unknown): RetryableError {
-  if (err && typeof err === 'object' && 'status' in err) {
+  if (false) {
     const status = (err as { status: number }).status;
     if (status === 400 || status === 401 || status === 403 || status === 404 || status === 422) {
killedBy: AH-CAPMAP-013 retry + circuit breaker retry calls fn at most maxAttempts times
statusReason: promise rejected "Error: srv { status: 500 }" instead of resolving

[Killed] BlockStatement
runtime/retry.ts:66:58
 
 /** Classify an error as retryable or non-retryable. */
 export function classifyError(err: unknown): RetryableError {
-  if (err && typeof err === 'object' && 'status' in err) {
-    const status = (err as { status: number }).status;
-    if (status === 400 || status === 401 || status === 403 || status === 404 || status === 422) {
-      return { kind: 'unknown', status, retryable: false, message: (err as { message?: string })?.message ?? `status ${status}` };
-    }
-    if (status === 429) return { kind: 'rate_limited', status, retryable: true, message: 'rate limited' };
-    if (status >= 500) return { kind: 'server', status, retryable: true, message: `server error ${status}` };
-  }
+  if (err && typeof err === 'object' && 'status' in err) {}
   const msg = (err as Error)?.message ?? String(err);
   if (/network|econnreset|econnrefused|etimedout|socket hang up|fetch failed/i.test(msg)) {
killedBy: AH-CAPMAP-013 retry + circuit breaker retry calls fn at most maxAttempts times
statusReason: promise rejected "Error: srv { status: 500 }" instead of resolving

[Killed] EqualityOperator
runtime/retry.ts:68:45
 export function classifyError(err: unknown): RetryableError {
   if (err && typeof err === 'object' && 'status' in err) {
     const status = (err as { status: number }).status;
-    if (status === 400 || status === 401 || status === 403 || status === 404 || status === 422) {
+    if (status === 400 || status === 401 || status !== 403 || status === 404 || status === 422) {
       return { kind: 'unknown', status, retryable: false, message: (err as { message?: string })?.message ?? `status ${status}` };
     }
killedBy: AH-CAPMAP-013 retry + circuit breaker retry calls fn at most maxAttempts times
statusReason: promise rejected "Error: srv { status: 500 }" instead of resolving

[Killed] EqualityOperator
runtime/retry.ts:68:63
 export function classifyError(err: unknown): RetryableError {
   if (err && typeof err === 'object' && 'status' in err) {
     const status = (err as { status: number }).status;
-    if (status === 400 || status === 401 || status === 403 || status === 404 || status === 422) {
+    if (status === 400 || status === 401 || status === 403 || status !== 404 || status === 422) {
       return { kind: 'unknown', status, retryable: false, message: (err as { message?: string })?.message ?? `status ${status}` };
     }
killedBy: AH-CAPMAP-013 retry + circuit breaker retry calls fn at most maxAttempts times
statusReason: promise rejected "Error: srv { status: 500 }" instead of resolving

[Killed] BooleanLiteral
runtime/retry.ts:69:52
   if (err && typeof err === 'object' && 'status' in err) {
     const status = (err as { status: number }).status;
     if (status === 400 || status === 401 || status === 403 || status === 404 || status === 422) {
-      return { kind: 'unknown', status, retryable: false, message: (err as { message?: string })?.message ?? `status ${status}` };
+      return { kind: 'unknown', status, retryable: true, message: (err as { message?: string })?.message ?? `status ${status}` };
     }
     if (status === 429) return { kind: 'rate_limited', status, retryable: true, message: 'rate limited' };
killedBy: AH-CAPMAP-013 retry + circuit breaker retry non-retryable error (400) does NOT trigger retry
statusReason: expected 3 to be 1 // Object.is equality

[Survived] LogicalOperator
runtime/retry.ts:69:68
   if (err && typeof err === 'object' && 'status' in err) {
     const status = (err as { status: number }).status;
     if (status === 400 || status === 401 || status === 403 || status === 404 || status === 422) {
-      return { kind: 'unknown', status, retryable: false, message: (err as { message?: string })?.message ?? `status ${status}` };
+      return { kind: 'unknown', status, retryable: false, message: (err as {
+  message?: string;
+})?.message && `status ${status}` };
     }
     if (status === 429) return { kind: 'rate_limited', status, retryable: true, message: 'rate limited' };

[Killed] ConditionalExpression
runtime/retry.ts:71:9
     if (status === 400 || status === 401 || status === 403 || status === 404 || status === 422) {
       return { kind: 'unknown', status, retryable: false, message: (err as { message?: string })?.message ?? `status ${status}` };
     }
-    if (status === 429) return { kind: 'rate_limited', status, retryable: true, message: 'rate limited' };
+    if (false) return { kind: 'rate_limited', status, retryable: true, message: 'rate limited' };
     if (status >= 500) return { kind: 'server', status, retryable: true, message: `server error ${status}` };
   }
killedBy: AH-CAPMAP-013 retry + circuit breaker retry retryable errors: 429, 500, 502, 503, 504, network, timeout
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
runtime/retry.ts:71:9
     if (status === 400 || status === 401 || status === 403 || status === 404 || status === 422) {
       return { kind: 'unknown', status, retryable: false, message: (err as { message?: string })?.message ?? `status ${status}` };
     }
-    if (status === 429) return { kind: 'rate_limited', status, retryable: true, message: 'rate limited' };
+    if (status !== 429) return { kind: 'rate_limited', status, retryable: true, message: 'rate limited' };
     if (status >= 500) return { kind: 'server', status, retryable: true, message: `server error ${status}` };
   }
killedBy: AH-CAPMAP-013 retry + circuit breaker retry retryable errors: 429, 500, 502, 503, 504, network, timeout
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
runtime/retry.ts:72:9
       return { kind: 'unknown', status, retryable: false, message: (err as { message?: string })?.message ?? `status ${status}` };
     }
     if (status === 429) return { kind: 'rate_limited', status, retryable: true, message: 'rate limited' };
-    if (status >= 500) return { kind: 'server', status, retryable: true, message: `server error ${status}` };
+    if (status < 500) return { kind: 'server', status, retryable: true, message: `server error ${status}` };
   }
   const msg = (err as Error)?.message ?? String(err);
killedBy: AH-CAPMAP-013 retry + circuit breaker retry calls fn at most maxAttempts times
statusReason: promise rejected "Error: srv { status: 500 }" instead of resolving

[Killed] BooleanLiteral
runtime/retry.ts:72:68
       return { kind: 'unknown', status, retryable: false, message: (err as { message?: string })?.message ?? `status ${status}` };
     }
     if (status === 429) return { kind: 'rate_limited', status, retryable: true, message: 'rate limited' };
-    if (status >= 500) return { kind: 'server', status, retryable: true, message: `server error ${status}` };
+    if (status >= 500) return { kind: 'server', status, retryable: false, message: `server error ${status}` };
   }
   const msg = (err as Error)?.message ?? String(err);
killedBy: AH-CAPMAP-013 retry + circuit breaker retry calls fn at most maxAttempts times
statusReason: promise rejected "Error: srv { status: 500 }" instead of resolving

[Survived] LogicalOperator
runtime/retry.ts:74:15
     if (status === 429) return { kind: 'rate_limited', status, retryable: true, message: 'rate limited' };
     if (status >= 500) return { kind: 'server', status, retryable: true, message: `server error ${status}` };
   }
-  const msg = (err as Error)?.message ?? String(err);
+  const msg = (err as Error)?.message && String(err);
   if (/network|econnreset|econnrefused|etimedout|socket hang up|fetch failed/i.test(msg)) {
     return { kind: 'network', retryable: true, message: msg, cause: err };

[Survived] OptionalChaining
runtime/retry.ts:74:15
     if (status === 429) return { kind: 'rate_limited', status, retryable: true, message: 'rate limited' };
     if (status >= 500) return { kind: 'server', status, retryable: true, message: `server error ${status}` };
   }
-  const msg = (err as Error)?.message ?? String(err);
+  const msg = (err as Error).message ?? String(err);
   if (/network|econnreset|econnrefused|etimedout|socket hang up|fetch failed/i.test(msg)) {
     return { kind: 'network', retryable: true, message: msg, cause: err };

[Killed] BlockStatement
runtime/retry.ts:75:91
     if (status >= 500) return { kind: 'server', status, retryable: true, message: `server error ${status}` };
   }
   const msg = (err as Error)?.message ?? String(err);
-  if (/network|econnreset|econnrefused|etimedout|socket hang up|fetch failed/i.test(msg)) {
-    return { kind: 'network', retryable: true, message: msg, cause: err };
-  }
+  if (/network|econnreset|econnrefused|etimedout|socket hang up|fetch failed/i.test(msg)) {}
   if (/timeout|timed out/i.test(msg)) return { kind: 'timeout', retryable: true, message: msg, cause: err };
   return { kind: 'unknown', retryable: false, message: msg, cause: err };
killedBy: AH-CAPMAP-013 retry + circuit breaker retry retryable errors: 429, 500, 502, 503, 504, network, timeout
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
runtime/retry.ts:75:7
     if (status >= 500) return { kind: 'server', status, retryable: true, message: `server error ${status}` };
   }
   const msg = (err as Error)?.message ?? String(err);
-  if (/network|econnreset|econnrefused|etimedout|socket hang up|fetch failed/i.test(msg)) {
+  if (false) {
     return { kind: 'network', retryable: true, message: msg, cause: err };
   }
killedBy: AH-CAPMAP-013 retry + circuit breaker retry retryable errors: 429, 500, 502, 503, 504, network, timeout
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
runtime/retry.ts:76:42
   }
   const msg = (err as Error)?.message ?? String(err);
   if (/network|econnreset|econnrefused|etimedout|socket hang up|fetch failed/i.test(msg)) {
-    return { kind: 'network', retryable: true, message: msg, cause: err };
+    return { kind: 'network', retryable: false, message: msg, cause: err };
   }
   if (/timeout|timed out/i.test(msg)) return { kind: 'timeout', retryable: true, message: msg, cause: err };
killedBy: AH-CAPMAP-013 retry + circuit breaker retry retryable errors: 429, 500, 502, 503, 504, network, timeout
statusReason: expected false to be true // Object.is equality

[NoCoverage] BooleanLiteral
runtime/retry.ts:78:76
   if (/network|econnreset|econnrefused|etimedout|socket hang up|fetch failed/i.test(msg)) {
     return { kind: 'network', retryable: true, message: msg, cause: err };
   }
-  if (/timeout|timed out/i.test(msg)) return { kind: 'timeout', retryable: true, message: msg, cause: err };
+  if (/timeout|timed out/i.test(msg)) return { kind: 'timeout', retryable: false, message: msg, cause: err };
   return { kind: 'unknown', retryable: false, message: msg, cause: err };
 }

[NoCoverage] ConditionalExpression
runtime/retry.ts:78:7
   if (/network|econnreset|econnrefused|etimedout|socket hang up|fetch failed/i.test(msg)) {
     return { kind: 'network', retryable: true, message: msg, cause: err };
   }
-  if (/timeout|timed out/i.test(msg)) return { kind: 'timeout', retryable: true, message: msg, cause: err };
+  if (true) return { kind: 'timeout', retryable: true, message: msg, cause: err };
   return { kind: 'unknown', retryable: false, message: msg, cause: err };
 }

[NoCoverage] BooleanLiteral
runtime/retry.ts:79:40
     return { kind: 'network', retryable: true, message: msg, cause: err };
   }
   if (/timeout|timed out/i.test(msg)) return { kind: 'timeout', retryable: true, message: msg, cause: err };
-  return { kind: 'unknown', retryable: false, message: msg, cause: err };
+  return { kind: 'unknown', retryable: true, message: msg, cause: err };
 }
 

[NoCoverage] ObjectLiteral
runtime/retry.ts:79:10
     return { kind: 'network', retryable: true, message: msg, cause: err };
   }
   if (/timeout|timed out/i.test(msg)) return { kind: 'timeout', retryable: true, message: msg, cause: err };
-  return { kind: 'unknown', retryable: false, message: msg, cause: err };
+  return {};
 }
 

[Killed] BlockStatement
runtime/retry.ts:93:17
   ) {}
 
   /** Throw CircuitOpenError if the circuit is open and cooldown hasn't elapsed. */
-  allow(): void {
-    if (this.state === 'open') {
-      const elapsed = Date.now() - this.openedAt;
-      if (elapsed >= this.cooldownMs) {
-        this.state = 'half_open'; // allow 1 probe
-      } else {
-        throw new CircuitOpenError(this.cooldownMs - elapsed);
-      }
-    }
-  }
+  allow(): void {}
 
   recordSuccess(): void {
killedBy: AH-CAPMAP-013 retry + circuit breaker circuit breaker opens after 5 consecutive failures, blocks for 60s
statusReason: expected function to throw an error, but it didn't

[Killed] BlockStatement
runtime/retry.ts:94:32
 
   /** Throw CircuitOpenError if the circuit is open and cooldown hasn't elapsed. */
   allow(): void {
-    if (this.state === 'open') {
-      const elapsed = Date.now() - this.openedAt;
-      if (elapsed >= this.cooldownMs) {
-        this.state = 'half_open'; // allow 1 probe
-      } else {
-        throw new CircuitOpenError(this.cooldownMs - elapsed);
-      }
-    }
+    if (this.state === 'open') {}
   }
 
killedBy: AH-CAPMAP-013 retry + circuit breaker circuit breaker opens after 5 consecutive failures, blocks for 60s
statusReason: expected function to throw an error, but it didn't

[Killed] ConditionalExpression
runtime/retry.ts:94:9
 
   /** Throw CircuitOpenError if the circuit is open and cooldown hasn't elapsed. */
   allow(): void {
-    if (this.state === 'open') {
+    if (false) {
       const elapsed = Date.now() - this.openedAt;
       if (elapsed >= this.cooldownMs) {
killedBy: AH-CAPMAP-013 retry + circuit breaker circuit breaker opens after 5 consecutive failures, blocks for 60s
statusReason: expected function to throw an error, but it didn't

[Killed] ArithmeticOperator
runtime/retry.ts:95:23
   /** Throw CircuitOpenError if the circuit is open and cooldown hasn't elapsed. */
   allow(): void {
     if (this.state === 'open') {
-      const elapsed = Date.now() - this.openedAt;
+      const elapsed = Date.now() + this.openedAt;
       if (elapsed >= this.cooldownMs) {
         this.state = 'half_open'; // allow 1 probe
killedBy: AH-CAPMAP-013 retry + circuit breaker circuit breaker opens after 5 consecutive failures, blocks for 60s
statusReason: expected function to throw an error, but it didn't

[Killed] ConditionalExpression
runtime/retry.ts:96:11
   allow(): void {
     if (this.state === 'open') {
       const elapsed = Date.now() - this.openedAt;
-      if (elapsed >= this.cooldownMs) {
+      if (false) {
         this.state = 'half_open'; // allow 1 probe
       } else {
killedBy: AH-CAPMAP-013 retry + circuit breaker circuit breaker half-open allows 1 probe request after cooldown
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] EqualityOperator
runtime/retry.ts:96:11
   allow(): void {
     if (this.state === 'open') {
       const elapsed = Date.now() - this.openedAt;
-      if (elapsed >= this.cooldownMs) {
+      if (elapsed < this.cooldownMs) {
         this.state = 'half_open'; // allow 1 probe
       } else {
killedBy: AH-CAPMAP-013 retry + circuit breaker circuit breaker opens after 5 consecutive failures, blocks for 60s
statusReason: expected function to throw an error, but it didn't

[Killed] StringLiteral
runtime/retry.ts:97:22
     if (this.state === 'open') {
       const elapsed = Date.now() - this.openedAt;
       if (elapsed >= this.cooldownMs) {
-        this.state = 'half_open'; // allow 1 probe
+        this.state = ""; // allow 1 probe
       } else {
         throw new CircuitOpenError(this.cooldownMs - elapsed);
killedBy: AH-CAPMAP-013 retry + circuit breaker circuit breaker half-open allows 1 probe request after cooldown
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
runtime/retry.ts:98:14
       const elapsed = Date.now() - this.openedAt;
       if (elapsed >= this.cooldownMs) {
         this.state = 'half_open'; // allow 1 probe
-      } else {
-        throw new CircuitOpenError(this.cooldownMs - elapsed);
-      }
+      } else {}
     }
   }
killedBy: AH-CAPMAP-013 retry + circuit breaker circuit breaker opens after 5 consecutive failures, blocks for 60s
statusReason: expected function to throw an error, but it didn't

[Survived] ArithmeticOperator
runtime/retry.ts:99:36
       if (elapsed >= this.cooldownMs) {
         this.state = 'half_open'; // allow 1 probe
       } else {
-        throw new CircuitOpenError(this.cooldownMs - elapsed);
+        throw new CircuitOpenError(this.cooldownMs + elapsed);
       }
     }

[Killed] BlockStatement
runtime/retry.ts:104:25
     }
   }
 
-  recordSuccess(): void {
-    this.consecutiveFailures = 0;
-    this.state = 'closed';
-  }
+  recordSuccess(): void {}
 
   recordFailure(): void {
killedBy: AH-CAPMAP-013 retry + circuit breaker circuit breaker half-open allows 1 probe request after cooldown
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
runtime/retry.ts:109:25
     this.state = 'closed';
   }
 
-  recordFailure(): void {
-    this.consecutiveFailures++;
-    if (this.consecutiveFailures >= this.threshold) {
-      this.state = 'open';
-      this.openedAt = Date.now();
-    }
-  }
+  recordFailure(): void {}
 
   get state_(): 'closed' | 'open' | 'half_open' { return this.state; }
killedBy: AH-CAPMAP-013 retry + circuit breaker circuit breaker opens after 5 consecutive failures, blocks for 60s
statusReason: expected 'closed' to be 'open' // Object.is equality

[Killed] UpdateOperator
runtime/retry.ts:110:5
   }
 
   recordFailure(): void {
-    this.consecutiveFailures++;
+    this.consecutiveFailures--;
     if (this.consecutiveFailures >= this.threshold) {
       this.state = 'open';
killedBy: AH-CAPMAP-013 retry + circuit breaker circuit breaker opens after 5 consecutive failures, blocks for 60s
statusReason: expected 'closed' to be 'open' // Object.is equality

[Killed] EqualityOperator
runtime/retry.ts:111:9
 
   recordFailure(): void {
     this.consecutiveFailures++;
-    if (this.consecutiveFailures >= this.threshold) {
+    if (this.consecutiveFailures < this.threshold) {
       this.state = 'open';
       this.openedAt = Date.now();
killedBy: AH-CAPMAP-013 retry + circuit breaker circuit breaker opens after 5 consecutive failures, blocks for 60s
statusReason: circuit breaker open; retry after 60000ms

[Killed] ConditionalExpression
runtime/retry.ts:111:9
 
   recordFailure(): void {
     this.consecutiveFailures++;
-    if (this.consecutiveFailures >= this.threshold) {
+    if (false) {
       this.state = 'open';
       this.openedAt = Date.now();
killedBy: AH-CAPMAP-013 retry + circuit breaker circuit breaker opens after 5 consecutive failures, blocks for 60s
statusReason: expected 'closed' to be 'open' // Object.is equality

[Killed] BlockStatement
runtime/retry.ts:117:49
     }
   }
 
-  get state_(): 'closed' | 'open' | 'half_open' { return this.state; }
+  get state_(): 'closed' | 'open' | 'half_open' {}
   get consecutiveFailures_(): number { return this.consecutiveFailures; }
 }
killedBy: AH-CAPMAP-013 retry + circuit breaker circuit breaker opens after 5 consecutive failures, blocks for 60s
statusReason: expected undefined to be 'open' // Object.is equality

[Killed] BlockStatement
runtime/retry.ts:118:38
   }
 
   get state_(): 'closed' | 'open' | 'half_open' { return this.state; }
-  get consecutiveFailures_(): number { return this.consecutiveFailures; }
+  get consecutiveFailures_(): number {}
 }
 
killedBy: AH-CAPMAP-013 retry + circuit breaker circuit breaker success resets consecutive failures
statusReason: expected undefined to be +0 // Object.is equality

[Survived] BlockStatement
runtime/retry.ts:121:43
   get consecutiveFailures_(): number { return this.consecutiveFailures; }
 }
 
-function delay(ms: number): Promise<void> {
-  return ms > 0 ? new Promise(r => setTimeout(r, ms)) : Promise.resolve();
-}
+function delay(ms: number): Promise<void> {}
 
 /**

[Killed] ArrowFunction
runtime/retry.ts:122:31
 }
 
 function delay(ms: number): Promise<void> {
-  return ms > 0 ? new Promise(r => setTimeout(r, ms)) : Promise.resolve();
+  return ms > 0 ? new Promise(() => undefined) : Promise.resolve();
 }
 
killedBy: AH-CAPMAP-013 retry + circuit breaker retry calls fn at most maxAttempts times
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Survived] ConditionalExpression
runtime/retry.ts:122:10
 }
 
 function delay(ms: number): Promise<void> {
-  return ms > 0 ? new Promise(r => setTimeout(r, ms)) : Promise.resolve();
+  return false ? new Promise(r => setTimeout(r, ms)) : Promise.resolve();
 }
 

[Killed] BlockStatement
runtime/retry.ts:129:106
  * retry(fn, opts): calls fn at most maxAttempts times with exponential backoff.
  * Non-retryable errors fail immediately. Non-idempotent ops require idempotencyKey.
  */
-export async function retry<T>(fn: (attempt: number) => Promise<T>, opts: RetryOptions = {}): Promise<T> {
-  const { maxAttempts = DEFAULTS.maxAttempts, baseDelay = DEFAULTS.baseDelay, maxDelay = DEFAULTS.maxDelay, jitterMs = DEFAULTS.jitterMs, idempotencyKey, log } = opts;
-  if (!idempotencyKey) {
-    // caller asserts idempotency by providing a key; without one, only 1 attempt for non-idempotent ops
-    // but we allow the caller to opt in; if no key, we still retry but the caller bears responsibility
-  }
-  let lastError: unknown;
-  for (let attempt = 1; attempt <= maxAttempts; attempt++) {
-    try {
-      const result = await fn(attempt);
-      return result;
-    } catch (err) {
-      lastError = err;
-      const classified = classifyError(err);
-      const isLast = attempt >= maxAttempts;
-      const delayMs = isLast || !classified.retryable ? 0 : Math.min(baseDelay * Math.pow(2, attempt - 1) + randomInt(0, jitterMs), maxDelay);
-      log?.({ attempt, delayMs, error: classified.message, timestamp: new Date().toISOString() });
-      if (!classified.retryable) throw err;
-      if (isLast) throw new RetryExhausted(err, attempt);
-      await delay(delayMs);
-    }
-  }
-  throw new RetryExhausted(lastError, maxAttempts);
-}
+export async function retry<T>(fn: (attempt: number) => Promise<T>, opts: RetryOptions = {}): Promise<T> {}
 
killedBy: AH-CAPMAP-013 retry + circuit breaker retry calls fn at most maxAttempts times
statusReason: expected undefined to be 'ok' // Object.is equality

[Survived] BooleanLiteral
runtime/retry.ts:131:7
  */
 export async function retry<T>(fn: (attempt: number) => Promise<T>, opts: RetryOptions = {}): Promise<T> {
   const { maxAttempts = DEFAULTS.maxAttempts, baseDelay = DEFAULTS.baseDelay, maxDelay = DEFAULTS.maxDelay, jitterMs = DEFAULTS.jitterMs, idempotencyKey, log } = opts;
-  if (!idempotencyKey) {
+  if (idempotencyKey) {
     // caller asserts idempotency by providing a key; without one, only 1 attempt for non-idempotent ops
     // but we allow the caller to opt in; if no key, we still retry but the caller bears responsibility

[Survived] ConditionalExpression
runtime/retry.ts:131:7
  */
 export async function retry<T>(fn: (attempt: number) => Promise<T>, opts: RetryOptions = {}): Promise<T> {
   const { maxAttempts = DEFAULTS.maxAttempts, baseDelay = DEFAULTS.baseDelay, maxDelay = DEFAULTS.maxDelay, jitterMs = DEFAULTS.jitterMs, idempotencyKey, log } = opts;
-  if (!idempotencyKey) {
+  if (true) {
     // caller asserts idempotency by providing a key; without one, only 1 attempt for non-idempotent ops
     // but we allow the caller to opt in; if no key, we still retry but the caller bears responsibility
