[Killed] EqualityOperator
security/pep.ts:176:9
       return this.#deny(request, 'invalid_time_order', tier);
     }
     if (nowValue < notBefore) return this.#deny(request, 'not_yet_valid', tier);
-    if (nowValue >= expiresAt) return this.#deny(request, 'expired', tier);
+    if (nowValue > expiresAt) return this.#deny(request, 'expired', tier);
     const manifestExpiresAt = strictTimestamp(request.manifest.expires_at);
     if (manifestExpiresAt === undefined) return this.#deny(request, 'invalid_manifest_time', tier);
killedBy: AH-POLICY-ENGINE-001: token time validation treats expires_at as an exclusive boundary
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
security/pep.ts:178:9
     if (nowValue < notBefore) return this.#deny(request, 'not_yet_valid', tier);
     if (nowValue >= expiresAt) return this.#deny(request, 'expired', tier);
     const manifestExpiresAt = strictTimestamp(request.manifest.expires_at);
-    if (manifestExpiresAt === undefined) return this.#deny(request, 'invalid_manifest_time', tier);
+    if (true) return this.#deny(request, 'invalid_manifest_time', tier);
     if (nowValue >= manifestExpiresAt) return this.#deny(request, 'manifest_expired', tier);
     if (request.token.use_limit !== 1) return this.#deny(request, 'invalid_use_limit', tier);
killedBy: AH-POLICY-ENGINE-001: PEP is mandatory at every action executes exactly once only after policy, capability and consumption checks pass
statusReason: promise rejected "PepDeniedError: Policy enforcement denied… { reason_code: '…' }" instead of resolving

[Killed] EqualityOperator
security/pep.ts:178:9
     if (nowValue < notBefore) return this.#deny(request, 'not_yet_valid', tier);
     if (nowValue >= expiresAt) return this.#deny(request, 'expired', tier);
     const manifestExpiresAt = strictTimestamp(request.manifest.expires_at);
-    if (manifestExpiresAt === undefined) return this.#deny(request, 'invalid_manifest_time', tier);
+    if (manifestExpiresAt !== undefined) return this.#deny(request, 'invalid_manifest_time', tier);
     if (nowValue >= manifestExpiresAt) return this.#deny(request, 'manifest_expired', tier);
     if (request.token.use_limit !== 1) return this.#deny(request, 'invalid_use_limit', tier);
killedBy: AH-POLICY-ENGINE-001: PEP is mandatory at every action executes exactly once only after policy, capability and consumption checks pass
statusReason: promise rejected "PepDeniedError: Policy enforcement denied… { reason_code: '…' }" instead of resolving

[Killed] ConditionalExpression
security/pep.ts:179:9
     if (nowValue >= expiresAt) return this.#deny(request, 'expired', tier);
     const manifestExpiresAt = strictTimestamp(request.manifest.expires_at);
     if (manifestExpiresAt === undefined) return this.#deny(request, 'invalid_manifest_time', tier);
-    if (nowValue >= manifestExpiresAt) return this.#deny(request, 'manifest_expired', tier);
+    if (true) return this.#deny(request, 'manifest_expired', tier);
     if (request.token.use_limit !== 1) return this.#deny(request, 'invalid_use_limit', tier);
 
killedBy: AH-POLICY-ENGINE-001: PEP is mandatory at every action executes exactly once only after policy, capability and consumption checks pass
statusReason: promise rejected "PepDeniedError: Policy enforcement denied… { reason_code: '…' }" instead of resolving

[Killed] EqualityOperator
security/pep.ts:179:9
     if (nowValue >= expiresAt) return this.#deny(request, 'expired', tier);
     const manifestExpiresAt = strictTimestamp(request.manifest.expires_at);
     if (manifestExpiresAt === undefined) return this.#deny(request, 'invalid_manifest_time', tier);
-    if (nowValue >= manifestExpiresAt) return this.#deny(request, 'manifest_expired', tier);
+    if (nowValue > manifestExpiresAt) return this.#deny(request, 'manifest_expired', tier);
     if (request.token.use_limit !== 1) return this.#deny(request, 'invalid_use_limit', tier);
 
killedBy: AH-POLICY-ENGINE-001: token time validation rejects an expired ActionManifest even when the capability token is still valid
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
security/pep.ts:180:9
     const manifestExpiresAt = strictTimestamp(request.manifest.expires_at);
     if (manifestExpiresAt === undefined) return this.#deny(request, 'invalid_manifest_time', tier);
     if (nowValue >= manifestExpiresAt) return this.#deny(request, 'manifest_expired', tier);
-    if (request.token.use_limit !== 1) return this.#deny(request, 'invalid_use_limit', tier);
+    if (true) return this.#deny(request, 'invalid_use_limit', tier);
 
     const mismatches: Array<[boolean, string]> = [
killedBy: AH-POLICY-ENGINE-001: PEP is mandatory at every action executes exactly once only after policy, capability and consumption checks pass
statusReason: promise rejected "PepDeniedError: Policy enforcement denied… { reason_code: '…' }" instead of resolving

[Killed] EqualityOperator
security/pep.ts:180:9
     const manifestExpiresAt = strictTimestamp(request.manifest.expires_at);
     if (manifestExpiresAt === undefined) return this.#deny(request, 'invalid_manifest_time', tier);
     if (nowValue >= manifestExpiresAt) return this.#deny(request, 'manifest_expired', tier);
-    if (request.token.use_limit !== 1) return this.#deny(request, 'invalid_use_limit', tier);
+    if (request.token.use_limit === 1) return this.#deny(request, 'invalid_use_limit', tier);
 
     const mismatches: Array<[boolean, string]> = [
killedBy: AH-POLICY-ENGINE-001: PEP is mandatory at every action executes exactly once only after policy, capability and consumption checks pass
statusReason: promise rejected "PepDeniedError: Policy enforcement denied… { reason_code: '…' }" instead of resolving

[Killed] ConditionalExpression
security/pep.ts:183:8
     if (request.token.use_limit !== 1) return this.#deny(request, 'invalid_use_limit', tier);
 
     const mismatches: Array<[boolean, string]> = [
-      [request.token.tenant_id !== request.context.tenant_id, 'wrong_tenant'],
+      [true, 'wrong_tenant'],
       [request.token.audience !== request.context.audience, 'wrong_audience'],
       [request.token.subject_workload !== request.context.subject_workload, 'wrong_workload'],
killedBy: AH-POLICY-ENGINE-001: PEP is mandatory at every action executes exactly once only after policy, capability and consumption checks pass
statusReason: promise rejected "PepDeniedError: Policy enforcement denied… { reason_code: '…' }" instead of resolving

[Killed] EqualityOperator
security/pep.ts:183:8
     if (request.token.use_limit !== 1) return this.#deny(request, 'invalid_use_limit', tier);
 
     const mismatches: Array<[boolean, string]> = [
-      [request.token.tenant_id !== request.context.tenant_id, 'wrong_tenant'],
+      [request.token.tenant_id === request.context.tenant_id, 'wrong_tenant'],
       [request.token.audience !== request.context.audience, 'wrong_audience'],
       [request.token.subject_workload !== request.context.subject_workload, 'wrong_workload'],
killedBy: AH-POLICY-ENGINE-001: PEP is mandatory at every action executes exactly once only after policy, capability and consumption checks pass
statusReason: promise rejected "PepDeniedError: Policy enforcement denied… { reason_code: '…' }" instead of resolving

[Killed] EqualityOperator
security/pep.ts:184:8
 
     const mismatches: Array<[boolean, string]> = [
       [request.token.tenant_id !== request.context.tenant_id, 'wrong_tenant'],
-      [request.token.audience !== request.context.audience, 'wrong_audience'],
+      [request.token.audience === request.context.audience, 'wrong_audience'],
       [request.token.subject_workload !== request.context.subject_workload, 'wrong_workload'],
       [request.token.operation_id !== request.context.operation_id, 'wrong_operation'],
killedBy: AH-POLICY-ENGINE-001: PEP is mandatory at every action executes exactly once only after policy, capability and consumption checks pass
statusReason: promise rejected "PepDeniedError: Policy enforcement denied… { reason_code: '…' }" instead of resolving

[Killed] ConditionalExpression
security/pep.ts:184:8
 
     const mismatches: Array<[boolean, string]> = [
       [request.token.tenant_id !== request.context.tenant_id, 'wrong_tenant'],
-      [request.token.audience !== request.context.audience, 'wrong_audience'],
+      [false, 'wrong_audience'],
       [request.token.subject_workload !== request.context.subject_workload, 'wrong_workload'],
       [request.token.operation_id !== request.context.operation_id, 'wrong_operation'],
killedBy: AH-POLICY-ENGINE-001: PEP binds every authorization dimension rejects a mismatched audience
statusReason: promise resolved "undefined" instead of rejecting

[Killed] EqualityOperator
security/pep.ts:185:8
     const mismatches: Array<[boolean, string]> = [
       [request.token.tenant_id !== request.context.tenant_id, 'wrong_tenant'],
       [request.token.audience !== request.context.audience, 'wrong_audience'],
-      [request.token.subject_workload !== request.context.subject_workload, 'wrong_workload'],
+      [request.token.subject_workload === request.context.subject_workload, 'wrong_workload'],
       [request.token.operation_id !== request.context.operation_id, 'wrong_operation'],
       [request.token.attempt_id !== request.context.attempt_id, 'wrong_attempt'],
killedBy: AH-POLICY-ENGINE-001: PEP is mandatory at every action executes exactly once only after policy, capability and consumption checks pass
statusReason: promise rejected "PepDeniedError: Policy enforcement denied… { reason_code: '…' }" instead of resolving

[Killed] ConditionalExpression
security/pep.ts:185:8
     const mismatches: Array<[boolean, string]> = [
       [request.token.tenant_id !== request.context.tenant_id, 'wrong_tenant'],
       [request.token.audience !== request.context.audience, 'wrong_audience'],
-      [request.token.subject_workload !== request.context.subject_workload, 'wrong_workload'],
+      [false, 'wrong_workload'],
       [request.token.operation_id !== request.context.operation_id, 'wrong_operation'],
       [request.token.attempt_id !== request.context.attempt_id, 'wrong_attempt'],
killedBy: AH-POLICY-ENGINE-001: PEP binds every authorization dimension rejects a mismatched workload
statusReason: promise resolved "undefined" instead of rejecting

[Killed] EqualityOperator
security/pep.ts:186:8
       [request.token.tenant_id !== request.context.tenant_id, 'wrong_tenant'],
       [request.token.audience !== request.context.audience, 'wrong_audience'],
       [request.token.subject_workload !== request.context.subject_workload, 'wrong_workload'],
-      [request.token.operation_id !== request.context.operation_id, 'wrong_operation'],
+      [request.token.operation_id === request.context.operation_id, 'wrong_operation'],
       [request.token.attempt_id !== request.context.attempt_id, 'wrong_attempt'],
       [request.token.execution_epoch !== request.context.execution_epoch, 'wrong_execution_epoch'],
killedBy: AH-POLICY-ENGINE-001: PEP is mandatory at every action executes exactly once only after policy, capability and consumption checks pass
statusReason: promise rejected "PepDeniedError: Policy enforcement denied… { reason_code: '…' }" instead of resolving

[Killed] ConditionalExpression
security/pep.ts:186:8
       [request.token.tenant_id !== request.context.tenant_id, 'wrong_tenant'],
       [request.token.audience !== request.context.audience, 'wrong_audience'],
       [request.token.subject_workload !== request.context.subject_workload, 'wrong_workload'],
-      [request.token.operation_id !== request.context.operation_id, 'wrong_operation'],
+      [false, 'wrong_operation'],
       [request.token.attempt_id !== request.context.attempt_id, 'wrong_attempt'],
       [request.token.execution_epoch !== request.context.execution_epoch, 'wrong_execution_epoch'],
killedBy: AH-POLICY-ENGINE-001: PEP binds every authorization dimension rejects a mismatched operation
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
security/pep.ts:187:8
       [request.token.audience !== request.context.audience, 'wrong_audience'],
       [request.token.subject_workload !== request.context.subject_workload, 'wrong_workload'],
       [request.token.operation_id !== request.context.operation_id, 'wrong_operation'],
-      [request.token.attempt_id !== request.context.attempt_id, 'wrong_attempt'],
+      [false, 'wrong_attempt'],
       [request.token.execution_epoch !== request.context.execution_epoch, 'wrong_execution_epoch'],
       [request.token.manifest_hash !== request.manifest.manifest_hash, 'wrong_manifest_hash'],
killedBy: AH-POLICY-ENGINE-001: PEP binds every authorization dimension rejects a mismatched attempt
statusReason: promise resolved "undefined" instead of rejecting

[Killed] EqualityOperator
security/pep.ts:187:8
       [request.token.audience !== request.context.audience, 'wrong_audience'],
       [request.token.subject_workload !== request.context.subject_workload, 'wrong_workload'],
       [request.token.operation_id !== request.context.operation_id, 'wrong_operation'],
-      [request.token.attempt_id !== request.context.attempt_id, 'wrong_attempt'],
+      [request.token.attempt_id === request.context.attempt_id, 'wrong_attempt'],
       [request.token.execution_epoch !== request.context.execution_epoch, 'wrong_execution_epoch'],
       [request.token.manifest_hash !== request.manifest.manifest_hash, 'wrong_manifest_hash'],
killedBy: AH-POLICY-ENGINE-001: PEP is mandatory at every action executes exactly once only after policy, capability and consumption checks pass
statusReason: promise rejected "PepDeniedError: Policy enforcement denied… { reason_code: '…' }" instead of resolving

[Killed] EqualityOperator
security/pep.ts:188:8
       [request.token.subject_workload !== request.context.subject_workload, 'wrong_workload'],
       [request.token.operation_id !== request.context.operation_id, 'wrong_operation'],
       [request.token.attempt_id !== request.context.attempt_id, 'wrong_attempt'],
-      [request.token.execution_epoch !== request.context.execution_epoch, 'wrong_execution_epoch'],
+      [request.token.execution_epoch === request.context.execution_epoch, 'wrong_execution_epoch'],
       [request.token.manifest_hash !== request.manifest.manifest_hash, 'wrong_manifest_hash'],
       [request.token.tool_grant_hash !== request.context.tool_grant_hash, 'wrong_tool_grant'],
killedBy: AH-POLICY-ENGINE-001: PEP is mandatory at every action executes exactly once only after policy, capability and consumption checks pass
statusReason: promise rejected "PepDeniedError: Policy enforcement denied… { reason_code: '…' }" instead of resolving

[Killed] ConditionalExpression
security/pep.ts:188:8
       [request.token.subject_workload !== request.context.subject_workload, 'wrong_workload'],
       [request.token.operation_id !== request.context.operation_id, 'wrong_operation'],
       [request.token.attempt_id !== request.context.attempt_id, 'wrong_attempt'],
-      [request.token.execution_epoch !== request.context.execution_epoch, 'wrong_execution_epoch'],
+      [false, 'wrong_execution_epoch'],
       [request.token.manifest_hash !== request.manifest.manifest_hash, 'wrong_manifest_hash'],
       [request.token.tool_grant_hash !== request.context.tool_grant_hash, 'wrong_tool_grant'],
killedBy: AH-POLICY-ENGINE-001: PEP binds every authorization dimension rejects a mismatched execution epoch
statusReason: promise resolved "undefined" instead of rejecting

[Killed] EqualityOperator
security/pep.ts:189:8
       [request.token.operation_id !== request.context.operation_id, 'wrong_operation'],
       [request.token.attempt_id !== request.context.attempt_id, 'wrong_attempt'],
       [request.token.execution_epoch !== request.context.execution_epoch, 'wrong_execution_epoch'],
-      [request.token.manifest_hash !== request.manifest.manifest_hash, 'wrong_manifest_hash'],
+      [request.token.manifest_hash === request.manifest.manifest_hash, 'wrong_manifest_hash'],
       [request.token.tool_grant_hash !== request.context.tool_grant_hash, 'wrong_tool_grant'],
       [request.token.resource_grant_hash !== request.context.resource_grant_hash, 'wrong_resource_grant'],
killedBy: AH-POLICY-ENGINE-001: PEP is mandatory at every action executes exactly once only after policy, capability and consumption checks pass
statusReason: promise rejected "PepDeniedError: Policy enforcement denied… { reason_code: '…' }" instead of resolving

[Killed] ConditionalExpression
security/pep.ts:189:8
       [request.token.operation_id !== request.context.operation_id, 'wrong_operation'],
       [request.token.attempt_id !== request.context.attempt_id, 'wrong_attempt'],
       [request.token.execution_epoch !== request.context.execution_epoch, 'wrong_execution_epoch'],
-      [request.token.manifest_hash !== request.manifest.manifest_hash, 'wrong_manifest_hash'],
+      [true, 'wrong_manifest_hash'],
       [request.token.tool_grant_hash !== request.context.tool_grant_hash, 'wrong_tool_grant'],
       [request.token.resource_grant_hash !== request.context.resource_grant_hash, 'wrong_resource_grant'],
killedBy: AH-POLICY-ENGINE-001: PEP is mandatory at every action executes exactly once only after policy, capability and consumption checks pass
statusReason: promise rejected "PepDeniedError: Policy enforcement denied… { reason_code: '…' }" instead of resolving

[Killed] ConditionalExpression
security/pep.ts:190:8
       [request.token.attempt_id !== request.context.attempt_id, 'wrong_attempt'],
       [request.token.execution_epoch !== request.context.execution_epoch, 'wrong_execution_epoch'],
       [request.token.manifest_hash !== request.manifest.manifest_hash, 'wrong_manifest_hash'],
-      [request.token.tool_grant_hash !== request.context.tool_grant_hash, 'wrong_tool_grant'],
+      [false, 'wrong_tool_grant'],
       [request.token.resource_grant_hash !== request.context.resource_grant_hash, 'wrong_resource_grant'],
       [request.token.budget_ceiling_hash !== request.context.budget_ceiling_hash, 'wrong_budget_ceiling'],
killedBy: AH-POLICY-ENGINE-001: PEP binds every authorization dimension rejects a mismatched tool grant
statusReason: promise resolved "undefined" instead of rejecting

[Killed] EqualityOperator
security/pep.ts:190:8
       [request.token.attempt_id !== request.context.attempt_id, 'wrong_attempt'],
       [request.token.execution_epoch !== request.context.execution_epoch, 'wrong_execution_epoch'],
       [request.token.manifest_hash !== request.manifest.manifest_hash, 'wrong_manifest_hash'],
-      [request.token.tool_grant_hash !== request.context.tool_grant_hash, 'wrong_tool_grant'],
+      [request.token.tool_grant_hash === request.context.tool_grant_hash, 'wrong_tool_grant'],
       [request.token.resource_grant_hash !== request.context.resource_grant_hash, 'wrong_resource_grant'],
       [request.token.budget_ceiling_hash !== request.context.budget_ceiling_hash, 'wrong_budget_ceiling'],
killedBy: AH-POLICY-ENGINE-001: PEP is mandatory at every action executes exactly once only after policy, capability and consumption checks pass
statusReason: promise rejected "PepDeniedError: Policy enforcement denied… { reason_code: '…' }" instead of resolving

[Killed] ConditionalExpression
security/pep.ts:191:8
       [request.token.execution_epoch !== request.context.execution_epoch, 'wrong_execution_epoch'],
       [request.token.manifest_hash !== request.manifest.manifest_hash, 'wrong_manifest_hash'],
       [request.token.tool_grant_hash !== request.context.tool_grant_hash, 'wrong_tool_grant'],
-      [request.token.resource_grant_hash !== request.context.resource_grant_hash, 'wrong_resource_grant'],
+      [true, 'wrong_resource_grant'],
       [request.token.budget_ceiling_hash !== request.context.budget_ceiling_hash, 'wrong_budget_ceiling'],
       [
killedBy: AH-POLICY-ENGINE-001: PEP is mandatory at every action executes exactly once only after policy, capability and consumption checks pass
statusReason: promise rejected "PepDeniedError: Policy enforcement denied… { reason_code: '…' }" instead of resolving

[Killed] ConditionalExpression
security/pep.ts:191:8
       [request.token.execution_epoch !== request.context.execution_epoch, 'wrong_execution_epoch'],
       [request.token.manifest_hash !== request.manifest.manifest_hash, 'wrong_manifest_hash'],
       [request.token.tool_grant_hash !== request.context.tool_grant_hash, 'wrong_tool_grant'],
-      [request.token.resource_grant_hash !== request.context.resource_grant_hash, 'wrong_resource_grant'],
+      [false, 'wrong_resource_grant'],
       [request.token.budget_ceiling_hash !== request.context.budget_ceiling_hash, 'wrong_budget_ceiling'],
       [
killedBy: AH-POLICY-ENGINE-001: PEP binds every authorization dimension rejects a mismatched resource grant
statusReason: promise resolved "undefined" instead of rejecting

[Killed] EqualityOperator
security/pep.ts:192:8
       [request.token.manifest_hash !== request.manifest.manifest_hash, 'wrong_manifest_hash'],
       [request.token.tool_grant_hash !== request.context.tool_grant_hash, 'wrong_tool_grant'],
       [request.token.resource_grant_hash !== request.context.resource_grant_hash, 'wrong_resource_grant'],
-      [request.token.budget_ceiling_hash !== request.context.budget_ceiling_hash, 'wrong_budget_ceiling'],
+      [request.token.budget_ceiling_hash === request.context.budget_ceiling_hash, 'wrong_budget_ceiling'],
       [
         request.token.tool_effect_contract_hash !== request.context.tool_effect_contract_hash,
killedBy: AH-POLICY-ENGINE-001: PEP is mandatory at every action executes exactly once only after policy, capability and consumption checks pass
statusReason: promise rejected "PepDeniedError: Policy enforcement denied… { reason_code: '…' }" instead of resolving

[Killed] ConditionalExpression
security/pep.ts:192:8
       [request.token.manifest_hash !== request.manifest.manifest_hash, 'wrong_manifest_hash'],
       [request.token.tool_grant_hash !== request.context.tool_grant_hash, 'wrong_tool_grant'],
       [request.token.resource_grant_hash !== request.context.resource_grant_hash, 'wrong_resource_grant'],
-      [request.token.budget_ceiling_hash !== request.context.budget_ceiling_hash, 'wrong_budget_ceiling'],
+      [true, 'wrong_budget_ceiling'],
       [
         request.token.tool_effect_contract_hash !== request.context.tool_effect_contract_hash,
killedBy: AH-POLICY-ENGINE-001: PEP is mandatory at every action executes exactly once only after policy, capability and consumption checks pass
statusReason: promise rejected "PepDeniedError: Policy enforcement denied… { reason_code: '…' }" instead of resolving

[Killed] ConditionalExpression
security/pep.ts:194:9
       [request.token.resource_grant_hash !== request.context.resource_grant_hash, 'wrong_resource_grant'],
       [request.token.budget_ceiling_hash !== request.context.budget_ceiling_hash, 'wrong_budget_ceiling'],
       [
-        request.token.tool_effect_contract_hash !== request.context.tool_effect_contract_hash,
+        true,
         'wrong_tool_effect_contract',
       ],
killedBy: AH-POLICY-ENGINE-001: PEP is mandatory at every action executes exactly once only after policy, capability and consumption checks pass
statusReason: promise rejected "PepDeniedError: Policy enforcement denied… { reason_code: '…' }" instead of resolving

[Killed] EqualityOperator
security/pep.ts:194:9
       [request.token.resource_grant_hash !== request.context.resource_grant_hash, 'wrong_resource_grant'],
       [request.token.budget_ceiling_hash !== request.context.budget_ceiling_hash, 'wrong_budget_ceiling'],
       [
-        request.token.tool_effect_contract_hash !== request.context.tool_effect_contract_hash,
+        request.token.tool_effect_contract_hash === request.context.tool_effect_contract_hash,
         'wrong_tool_effect_contract',
       ],
killedBy: AH-POLICY-ENGINE-001: PEP is mandatory at every action executes exactly once only after policy, capability and consumption checks pass
statusReason: promise rejected "PepDeniedError: Policy enforcement denied… { reason_code: '…' }" instead of resolving

[Killed] ConditionalExpression
security/pep.ts:198:9
         'wrong_tool_effect_contract',
       ],
       [
-        request.token.confirmation_key_thumbprint !== request.context.confirmation_key_thumbprint,
+        false,
         'wrong_confirmation_key',
       ],
killedBy: AH-POLICY-ENGINE-001: PEP binds every authorization dimension rejects a mismatched confirmation key
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
security/pep.ts:198:9
         'wrong_tool_effect_contract',
       ],
       [
-        request.token.confirmation_key_thumbprint !== request.context.confirmation_key_thumbprint,
+        true,
         'wrong_confirmation_key',
       ],
killedBy: AH-POLICY-ENGINE-001: PEP is mandatory at every action executes exactly once only after policy, capability and consumption checks pass
statusReason: promise rejected "PepDeniedError: Policy enforcement denied… { reason_code: '…' }" instead of resolving

[Killed] EqualityOperator
security/pep.ts:201:8
         request.token.confirmation_key_thumbprint !== request.context.confirmation_key_thumbprint,
         'wrong_confirmation_key',
       ],
-      [request.token.policy_decision_hash !== decision.decision_hash, 'wrong_policy_decision'],
+      [request.token.policy_decision_hash === decision.decision_hash, 'wrong_policy_decision'],
     ];
     const mismatch = mismatches.find(([failed]) => failed);
killedBy: AH-POLICY-ENGINE-001: PEP is mandatory at every action executes exactly once only after policy, capability and consumption checks pass
statusReason: promise rejected "PepDeniedError: Policy enforcement denied… { reason_code: '…' }" instead of resolving

[Killed] ConditionalExpression
security/pep.ts:201:8
         request.token.confirmation_key_thumbprint !== request.context.confirmation_key_thumbprint,
         'wrong_confirmation_key',
       ],
-      [request.token.policy_decision_hash !== decision.decision_hash, 'wrong_policy_decision'],
+      [true, 'wrong_policy_decision'],
     ];
     const mismatch = mismatches.find(([failed]) => failed);
killedBy: AH-POLICY-ENGINE-001: PEP is mandatory at every action executes exactly once only after policy, capability and consumption checks pass
statusReason: promise rejected "PepDeniedError: Policy enforcement denied… { reason_code: '…' }" instead of resolving

[Killed] ArrowFunction
security/pep.ts:203:38
       ],
       [request.token.policy_decision_hash !== decision.decision_hash, 'wrong_policy_decision'],
     ];
-    const mismatch = mismatches.find(([failed]) => failed);
+    const mismatch = mismatches.find(() => undefined);
     if (mismatch) return this.#deny(request, mismatch[1], tier);
 
killedBy: AH-POLICY-ENGINE-001: PEP binds every authorization dimension rejects a mismatched tenant
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
security/pep.ts:204:9
       [request.token.policy_decision_hash !== decision.decision_hash, 'wrong_policy_decision'],
     ];
     const mismatch = mismatches.find(([failed]) => failed);
-    if (mismatch) return this.#deny(request, mismatch[1], tier);
+    if (true) return this.#deny(request, mismatch[1], tier);
 
     let authorizedEgress:
killedBy: AH-POLICY-ENGINE-001: PEP is mandatory at every action executes exactly once only after policy, capability and consumption checks pass
statusReason: promise rejected "TypeError: Cannot read properties of unde…" instead of resolving

[Killed] ConditionalExpression
security/pep.ts:204:9
       [request.token.policy_decision_hash !== decision.decision_hash, 'wrong_policy_decision'],
     ];
     const mismatch = mismatches.find(([failed]) => failed);
-    if (mismatch) return this.#deny(request, mismatch[1], tier);
+    if (false) return this.#deny(request, mismatch[1], tier);
 
     let authorizedEgress:
killedBy: AH-POLICY-ENGINE-001: PEP binds every authorization dimension rejects a mismatched tenant
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
security/pep.ts:209:9
     let authorizedEgress:
       | { destination: string; canonical_host: string; resolved_addresses: readonly string[] }
       | undefined;
-    if (request.risk.network_access) {
+    if (false) {
       if (request.egress === undefined || decision.egress_policy === undefined) {
         return this.#deny(request, 'egress_target_required', tier);
killedBy: AH-POLICY-ENGINE-001: PEP is mandatory at every action rejects a network destination through the effective egress policy before token consumption
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
security/pep.ts:209:9
     let authorizedEgress:
       | { destination: string; canonical_host: string; resolved_addresses: readonly string[] }
       | undefined;
-    if (request.risk.network_access) {
+    if (true) {
       if (request.egress === undefined || decision.egress_policy === undefined) {
         return this.#deny(request, 'egress_target_required', tier);
killedBy: AH-POLICY-ENGINE-001: PEP is mandatory at every action executes exactly once only after policy, capability and consumption checks pass
statusReason: promise rejected "PepDeniedError: Policy enforcement denied… { reason_code: '…' }" instead of resolving
