[Killed] UpdateOperator
runtime/retry.ts:136:49
     // but we allow the caller to opt in; if no key, we still retry but the caller bears responsibility
   }
   let lastError: unknown;
-  for (let attempt = 1; attempt <= maxAttempts; attempt++) {
+  for (let attempt = 1; attempt <= maxAttempts; attempt--) {
     try {
       const result = await fn(attempt);
killedBy: AH-CAPMAP-013 retry + circuit breaker retry backoff: attempt N waits baseDelay * 2^(N-1) + random(0, jitterMs)
statusReason: expected 5 to be greater than or equal to 20

[Killed] EqualityOperator
runtime/retry.ts:136:25
     // but we allow the caller to opt in; if no key, we still retry but the caller bears responsibility
   }
   let lastError: unknown;
-  for (let attempt = 1; attempt <= maxAttempts; attempt++) {
+  for (let attempt = 1; attempt > maxAttempts; attempt++) {
     try {
       const result = await fn(attempt);
killedBy: AH-CAPMAP-013 retry + circuit breaker retry calls fn at most maxAttempts times
statusReason: promise rejected "RetryExhausted: retry exhausted after 3 a… { …(2) }" instead of resolving

[Killed] BlockStatement
runtime/retry.ts:137:9
   }
   let lastError: unknown;
   for (let attempt = 1; attempt <= maxAttempts; attempt++) {
-    try {
-      const result = await fn(attempt);
-      return result;
-    } catch (err) {
+    try {} catch (err) {
       lastError = err;
       const classified = classifyError(err);
killedBy: AH-CAPMAP-013 retry + circuit breaker retry calls fn at most maxAttempts times
statusReason: promise rejected "RetryExhausted: retry exhausted after 3 a… { …(2) }" instead of resolving

[Killed] BlockStatement
runtime/retry.ts:140:19
     try {
       const result = await fn(attempt);
       return result;
-    } catch (err) {
-      lastError = err;
-      const classified = classifyError(err);
-      const isLast = attempt >= maxAttempts;
-      const delayMs = isLast || !classified.retryable ? 0 : Math.min(baseDelay * Math.pow(2, attempt - 1) + randomInt(0, jitterMs), maxDelay);
-      log?.({ attempt, delayMs, error: classified.message, timestamp: new Date().toISOString() });
-      if (!classified.retryable) throw err;
-      if (isLast) throw new RetryExhausted(err, attempt);
-      await delay(delayMs);
-    }
+    } catch (err) {}
   }
   throw new RetryExhausted(lastError, maxAttempts);
killedBy: AH-CAPMAP-013 retry + circuit breaker retry non-retryable error (400) does NOT trigger retry
statusReason: expected 3 to be 1 // Object.is equality

[Killed] EqualityOperator
runtime/retry.ts:143:22
     } catch (err) {
       lastError = err;
       const classified = classifyError(err);
-      const isLast = attempt >= maxAttempts;
+      const isLast = attempt < maxAttempts;
       const delayMs = isLast || !classified.retryable ? 0 : Math.min(baseDelay * Math.pow(2, attempt - 1) + randomInt(0, jitterMs), maxDelay);
       log?.({ attempt, delayMs, error: classified.message, timestamp: new Date().toISOString() });
killedBy: AH-CAPMAP-013 retry + circuit breaker retry calls fn at most maxAttempts times
statusReason: promise rejected "RetryExhausted: retry exhausted after 1 a… { …(2) }" instead of resolving

[Killed] ConditionalExpression
runtime/retry.ts:143:22
     } catch (err) {
       lastError = err;
       const classified = classifyError(err);
-      const isLast = attempt >= maxAttempts;
+      const isLast = true;
       const delayMs = isLast || !classified.retryable ? 0 : Math.min(baseDelay * Math.pow(2, attempt - 1) + randomInt(0, jitterMs), maxDelay);
       log?.({ attempt, delayMs, error: classified.message, timestamp: new Date().toISOString() });
killedBy: AH-CAPMAP-013 retry + circuit breaker retry calls fn at most maxAttempts times
statusReason: promise rejected "RetryExhausted: retry exhausted after 1 a… { …(2) }" instead of resolving

[Killed] ArithmeticOperator
runtime/retry.ts:144:94
       lastError = err;
       const classified = classifyError(err);
       const isLast = attempt >= maxAttempts;
-      const delayMs = isLast || !classified.retryable ? 0 : Math.min(baseDelay * Math.pow(2, attempt - 1) + randomInt(0, jitterMs), maxDelay);
+      const delayMs = isLast || !classified.retryable ? 0 : Math.min(baseDelay * Math.pow(2, attempt + 1) + randomInt(0, jitterMs), maxDelay);
       log?.({ attempt, delayMs, error: classified.message, timestamp: new Date().toISOString() });
       if (!classified.retryable) throw err;
killedBy: AH-CAPMAP-013 retry + circuit breaker retry backoff: attempt N waits baseDelay * 2^(N-1) + random(0, jitterMs)
statusReason: expected 43 to be less than or equal to 15

[Killed] ConditionalExpression
runtime/retry.ts:144:23
       lastError = err;
       const classified = classifyError(err);
       const isLast = attempt >= maxAttempts;
-      const delayMs = isLast || !classified.retryable ? 0 : Math.min(baseDelay * Math.pow(2, attempt - 1) + randomInt(0, jitterMs), maxDelay);
+      const delayMs = true ? 0 : Math.min(baseDelay * Math.pow(2, attempt - 1) + randomInt(0, jitterMs), maxDelay);
       log?.({ attempt, delayMs, error: classified.message, timestamp: new Date().toISOString() });
       if (!classified.retryable) throw err;
killedBy: AH-CAPMAP-013 retry + circuit breaker retry backoff: attempt N waits baseDelay * 2^(N-1) + random(0, jitterMs)
statusReason: expected 0 to be greater than or equal to 10

[Killed] OptionalChaining
runtime/retry.ts:145:7
       const classified = classifyError(err);
       const isLast = attempt >= maxAttempts;
       const delayMs = isLast || !classified.retryable ? 0 : Math.min(baseDelay * Math.pow(2, attempt - 1) + randomInt(0, jitterMs), maxDelay);
-      log?.({ attempt, delayMs, error: classified.message, timestamp: new Date().toISOString() });
+      log({
+  attempt,
+  delayMs,
+  error: classified.message,
+  timestamp: new Date().toISOString()
+});
       if (!classified.retryable) throw err;
       if (isLast) throw new RetryExhausted(err, attempt);
killedBy: AH-CAPMAP-013 retry + circuit breaker retry calls fn at most maxAttempts times
statusReason: promise rejected "TypeError: log is not a function" instead of resolving

[Killed] ConditionalExpression
runtime/retry.ts:146:11
       const isLast = attempt >= maxAttempts;
       const delayMs = isLast || !classified.retryable ? 0 : Math.min(baseDelay * Math.pow(2, attempt - 1) + randomInt(0, jitterMs), maxDelay);
       log?.({ attempt, delayMs, error: classified.message, timestamp: new Date().toISOString() });
-      if (!classified.retryable) throw err;
+      if (true) throw err;
       if (isLast) throw new RetryExhausted(err, attempt);
       await delay(delayMs);
killedBy: AH-CAPMAP-013 retry + circuit breaker retry calls fn at most maxAttempts times
statusReason: promise rejected "Error: srv { status: 500 }" instead of resolving

[Killed] BooleanLiteral
runtime/retry.ts:146:11
       const isLast = attempt >= maxAttempts;
       const delayMs = isLast || !classified.retryable ? 0 : Math.min(baseDelay * Math.pow(2, attempt - 1) + randomInt(0, jitterMs), maxDelay);
       log?.({ attempt, delayMs, error: classified.message, timestamp: new Date().toISOString() });
-      if (!classified.retryable) throw err;
+      if (classified.retryable) throw err;
       if (isLast) throw new RetryExhausted(err, attempt);
       await delay(delayMs);
killedBy: AH-CAPMAP-013 retry + circuit breaker retry calls fn at most maxAttempts times
statusReason: promise rejected "Error: srv { status: 500 }" instead of resolving

[Killed] ConditionalExpression
runtime/retry.ts:147:11
       const delayMs = isLast || !classified.retryable ? 0 : Math.min(baseDelay * Math.pow(2, attempt - 1) + randomInt(0, jitterMs), maxDelay);
       log?.({ attempt, delayMs, error: classified.message, timestamp: new Date().toISOString() });
       if (!classified.retryable) throw err;
-      if (isLast) throw new RetryExhausted(err, attempt);
+      if (true) throw new RetryExhausted(err, attempt);
       await delay(delayMs);
     }
killedBy: AH-CAPMAP-013 retry + circuit breaker retry calls fn at most maxAttempts times
statusReason: promise rejected "RetryExhausted: retry exhausted after 1 a… { …(2) }" instead of resolving

[Survived] ConditionalExpression
runtime/retry.ts:147:11
       const delayMs = isLast || !classified.retryable ? 0 : Math.min(baseDelay * Math.pow(2, attempt - 1) + randomInt(0, jitterMs), maxDelay);
       log?.({ attempt, delayMs, error: classified.message, timestamp: new Date().toISOString() });
       if (!classified.retryable) throw err;
-      if (isLast) throw new RetryExhausted(err, attempt);
+      if (false) throw new RetryExhausted(err, attempt);
       await delay(delayMs);
     }
