[Killed] BlockStatement
vfs/virtual-filesystem.ts:33:32
 }
 
 export class VfsError extends Error {
-  constructor(message: string) { super(message); this.name = 'VfsError'; Object.setPrototypeOf(this, VfsError.prototype); }
+  constructor(message: string) {}
 }
 
killedBy: AH-VFS-001 Virtual Filesystem assertSafeVfsPath rejects relative paths
statusReason: expected error to be instance of VfsError

[Killed] BlockStatement
vfs/virtual-filesystem.ts:49:55
 }
 
 /** Reject traversal/escape anywhere a user-supplied path is accepted. */
-export function assertSafeVfsPath(path: string): void {
-  if (typeof path !== 'string' || path.length === 0) throw new VfsError('path required');
-  if (!path.startsWith('/')) throw new VfsError(`path must be absolute within VFS: ${path}`);
-  if (path.includes('\0')) throw new VfsError('null byte in path');
-  if (/(^|\/)\.\.(\/|$)/.test(path)) throw new VfsError(`traversal rejected: ${path}`);
-}
+export function assertSafeVfsPath(path: string): void {}
 
 function realpathSafe(p: string): string { try { return realpathSync(p); } catch { return p; } }
killedBy: AH-VFS-001 Virtual Filesystem assertSafeVfsPath rejects relative paths
statusReason: expected function to throw an error, but it didn't

[Killed] EqualityOperator
vfs/virtual-filesystem.ts:50:35
 
 /** Reject traversal/escape anywhere a user-supplied path is accepted. */
 export function assertSafeVfsPath(path: string): void {
-  if (typeof path !== 'string' || path.length === 0) throw new VfsError('path required');
+  if (typeof path !== 'string' || path.length !== 0) throw new VfsError('path required');
   if (!path.startsWith('/')) throw new VfsError(`path must be absolute within VFS: ${path}`);
   if (path.includes('\0')) throw new VfsError('null byte in path');
killedBy: AH-VFS-001 Virtual Filesystem assertSafeVfsPath accepts clean absolute paths
statusReason: expected [Function] to not throw an error but 'VfsError: path required' was thrown

[Killed] EqualityOperator
vfs/virtual-filesystem.ts:50:7
 
 /** Reject traversal/escape anywhere a user-supplied path is accepted. */
 export function assertSafeVfsPath(path: string): void {
-  if (typeof path !== 'string' || path.length === 0) throw new VfsError('path required');
+  if (typeof path === 'string' || path.length === 0) throw new VfsError('path required');
   if (!path.startsWith('/')) throw new VfsError(`path must be absolute within VFS: ${path}`);
   if (path.includes('\0')) throw new VfsError('null byte in path');
killedBy: AH-VFS-001 Virtual Filesystem assertSafeVfsPath accepts clean absolute paths
statusReason: expected [Function] to not throw an error but 'VfsError: path required' was thrown

[Killed] BooleanLiteral
vfs/virtual-filesystem.ts:51:7
 /** Reject traversal/escape anywhere a user-supplied path is accepted. */
 export function assertSafeVfsPath(path: string): void {
   if (typeof path !== 'string' || path.length === 0) throw new VfsError('path required');
-  if (!path.startsWith('/')) throw new VfsError(`path must be absolute within VFS: ${path}`);
+  if (path.startsWith('/')) throw new VfsError(`path must be absolute within VFS: ${path}`);
   if (path.includes('\0')) throw new VfsError('null byte in path');
   if (/(^|\/)\.\.(\/|$)/.test(path)) throw new VfsError(`traversal rejected: ${path}`);
killedBy: AH-VFS-001 Virtual Filesystem assertSafeVfsPath rejects relative paths
statusReason: expected function to throw an error, but it didn't

[Killed] ConditionalExpression
vfs/virtual-filesystem.ts:51:7
 /** Reject traversal/escape anywhere a user-supplied path is accepted. */
 export function assertSafeVfsPath(path: string): void {
   if (typeof path !== 'string' || path.length === 0) throw new VfsError('path required');
-  if (!path.startsWith('/')) throw new VfsError(`path must be absolute within VFS: ${path}`);
+  if (false) throw new VfsError(`path must be absolute within VFS: ${path}`);
   if (path.includes('\0')) throw new VfsError('null byte in path');
   if (/(^|\/)\.\.(\/|$)/.test(path)) throw new VfsError(`traversal rejected: ${path}`);
killedBy: AH-VFS-001 Virtual Filesystem assertSafeVfsPath rejects relative paths
statusReason: expected function to throw an error, but it didn't

[Killed] ConditionalExpression
vfs/virtual-filesystem.ts:52:7
 export function assertSafeVfsPath(path: string): void {
   if (typeof path !== 'string' || path.length === 0) throw new VfsError('path required');
   if (!path.startsWith('/')) throw new VfsError(`path must be absolute within VFS: ${path}`);
-  if (path.includes('\0')) throw new VfsError('null byte in path');
+  if (false) throw new VfsError('null byte in path');
   if (/(^|\/)\.\.(\/|$)/.test(path)) throw new VfsError(`traversal rejected: ${path}`);
 }
killedBy: AH-VFS-001 Virtual Filesystem assertSafeVfsPath rejects null bytes
statusReason: expected function to throw an error, but it didn't

[Killed] ConditionalExpression
vfs/virtual-filesystem.ts:52:7
 export function assertSafeVfsPath(path: string): void {
   if (typeof path !== 'string' || path.length === 0) throw new VfsError('path required');
   if (!path.startsWith('/')) throw new VfsError(`path must be absolute within VFS: ${path}`);
-  if (path.includes('\0')) throw new VfsError('null byte in path');
+  if (true) throw new VfsError('null byte in path');
   if (/(^|\/)\.\.(\/|$)/.test(path)) throw new VfsError(`traversal rejected: ${path}`);
 }
killedBy: AH-VFS-001 Virtual Filesystem assertSafeVfsPath accepts clean absolute paths
statusReason: expected [Function] to not throw an error but 'VfsError: null byte in path' was thrown

[Killed] ConditionalExpression
vfs/virtual-filesystem.ts:53:7
   if (typeof path !== 'string' || path.length === 0) throw new VfsError('path required');
   if (!path.startsWith('/')) throw new VfsError(`path must be absolute within VFS: ${path}`);
   if (path.includes('\0')) throw new VfsError('null byte in path');
-  if (/(^|\/)\.\.(\/|$)/.test(path)) throw new VfsError(`traversal rejected: ${path}`);
+  if (false) throw new VfsError(`traversal rejected: ${path}`);
 }
 
killedBy: AH-VFS-001 Virtual Filesystem assertSafeVfsPath rejects traversal
statusReason: expected function to throw an error, but it didn't

[Killed] ConditionalExpression
vfs/virtual-filesystem.ts:53:7
   if (typeof path !== 'string' || path.length === 0) throw new VfsError('path required');
   if (!path.startsWith('/')) throw new VfsError(`path must be absolute within VFS: ${path}`);
   if (path.includes('\0')) throw new VfsError('null byte in path');
-  if (/(^|\/)\.\.(\/|$)/.test(path)) throw new VfsError(`traversal rejected: ${path}`);
+  if (true) throw new VfsError(`traversal rejected: ${path}`);
 }
 
killedBy: AH-VFS-001 Virtual Filesystem assertSafeVfsPath accepts clean absolute paths
statusReason: expected [Function] to not throw an error but 'VfsError: traversal rejected: /worksp…' was thrown

[Killed] BlockStatement
vfs/virtual-filesystem.ts:56:42
   if (/(^|\/)\.\.(\/|$)/.test(path)) throw new VfsError(`traversal rejected: ${path}`);
 }
 
-function realpathSafe(p: string): string { try { return realpathSync(p); } catch { return p; } }
+function realpathSafe(p: string): string {}
 function clone(b: Buffer | undefined): Buffer { if (!b) throw new VfsError('not found'); return Buffer.from(b); }
 function sha(b: Buffer): string { return createHash('sha256').update(b).digest('hex'); }
killedBy: AH-VFS-001 Virtual Filesystem backend routing routes /workspace to LocalBackend
statusReason: The "from" argument must be of type string. Received undefined

[Killed] BlockStatement
vfs/virtual-filesystem.ts:56:48
   if (/(^|\/)\.\.(\/|$)/.test(path)) throw new VfsError(`traversal rejected: ${path}`);
 }
 
-function realpathSafe(p: string): string { try { return realpathSync(p); } catch { return p; } }
+function realpathSafe(p: string): string { try {} catch { return p; } }
 function clone(b: Buffer | undefined): Buffer { if (!b) throw new VfsError('not found'); return Buffer.from(b); }
 function sha(b: Buffer): string { return createHash('sha256').update(b).digest('hex'); }
killedBy: AH-VFS-001 Virtual Filesystem backend routing routes /workspace to LocalBackend
statusReason: The "from" argument must be of type string. Received undefined

[Killed] ConditionalExpression
vfs/virtual-filesystem.ts:57:53
 }
 
 function realpathSafe(p: string): string { try { return realpathSync(p); } catch { return p; } }
-function clone(b: Buffer | undefined): Buffer { if (!b) throw new VfsError('not found'); return Buffer.from(b); }
+function clone(b: Buffer | undefined): Buffer { if (true) throw new VfsError('not found'); return Buffer.from(b); }
 function sha(b: Buffer): string { return createHash('sha256').update(b).digest('hex'); }
 function now(): string { return new Date().toISOString(); }
killedBy: AH-VFS-001 Virtual Filesystem backend routing routes /memories to StoreBackend
statusReason: not found

[Killed] BlockStatement
vfs/virtual-filesystem.ts:57:47
 }
 
 function realpathSafe(p: string): string { try { return realpathSync(p); } catch { return p; } }
-function clone(b: Buffer | undefined): Buffer { if (!b) throw new VfsError('not found'); return Buffer.from(b); }
+function clone(b: Buffer | undefined): Buffer {}
 function sha(b: Buffer): string { return createHash('sha256').update(b).digest('hex'); }
 function now(): string { return new Date().toISOString(); }
killedBy: AH-VFS-001 Virtual Filesystem backend routing routes /memories to StoreBackend
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
vfs/virtual-filesystem.ts:58:33
 
 function realpathSafe(p: string): string { try { return realpathSync(p); } catch { return p; } }
 function clone(b: Buffer | undefined): Buffer { if (!b) throw new VfsError('not found'); return Buffer.from(b); }
-function sha(b: Buffer): string { return createHash('sha256').update(b).digest('hex'); }
+function sha(b: Buffer): string {}
 function now(): string { return new Date().toISOString(); }
 
killedBy: AH-VFS-001 Virtual Filesystem list / search / receipts every operation produces a receipt with sha256 for reads/writes
statusReason: .toMatch() expects to receive a string, but got undefined

[Survived] BlockStatement
vfs/virtual-filesystem.ts:59:24
 function realpathSafe(p: string): string { try { return realpathSync(p); } catch { return p; } }
 function clone(b: Buffer | undefined): Buffer { if (!b) throw new VfsError('not found'); return Buffer.from(b); }
 function sha(b: Buffer): string { return createHash('sha256').update(b).digest('hex'); }
-function now(): string { return new Date().toISOString(); }
+function now(): string {}
 
 /** Real-filesystem backend rooted at an OS directory, exposed under a VFS prefix. */

[Killed] BlockStatement
vfs/virtual-filesystem.ts:65:43
 export class LocalBackend implements Backend {
   readonly kind = 'local' as const;
   constructor(readonly prefix: string, private readonly root: string) {}
-  private osPath(vfsPath: string): string {
-    const rel = relative(this.prefix, vfsPath);
-    if (rel.startsWith('..')) throw new VfsError(`escape from ${this.prefix}: ${vfsPath}`);
-    return resolve(this.root, rel);
-  }
+  private osPath(vfsPath: string): string {}
   private safe(osPath: string): string {
     const real = realpathSafe(osPath);
killedBy: AH-VFS-001 Virtual Filesystem backend routing routes /workspace to LocalBackend
statusReason: The "to" argument must be of type string. Received undefined

[Killed] ConditionalExpression
vfs/virtual-filesystem.ts:67:9
   constructor(readonly prefix: string, private readonly root: string) {}
   private osPath(vfsPath: string): string {
     const rel = relative(this.prefix, vfsPath);
-    if (rel.startsWith('..')) throw new VfsError(`escape from ${this.prefix}: ${vfsPath}`);
+    if (true) throw new VfsError(`escape from ${this.prefix}: ${vfsPath}`);
     return resolve(this.root, rel);
   }
killedBy: AH-VFS-001 Virtual Filesystem backend routing routes /workspace to LocalBackend
statusReason: escape from /workspace: /workspace/a.txt

[Survived] ConditionalExpression
vfs/virtual-filesystem.ts:67:9
   constructor(readonly prefix: string, private readonly root: string) {}
   private osPath(vfsPath: string): string {
     const rel = relative(this.prefix, vfsPath);
-    if (rel.startsWith('..')) throw new VfsError(`escape from ${this.prefix}: ${vfsPath}`);
+    if (false) throw new VfsError(`escape from ${this.prefix}: ${vfsPath}`);
     return resolve(this.root, rel);
   }

[Killed] BlockStatement
vfs/virtual-filesystem.ts:70:40
     if (rel.startsWith('..')) throw new VfsError(`escape from ${this.prefix}: ${vfsPath}`);
     return resolve(this.root, rel);
   }
-  private safe(osPath: string): string {
-    const real = realpathSafe(osPath);
-    const rootReal = realpathSafe(this.root);
-    const rel = relative(rootReal, real);
-    if (rel.startsWith('..') || isAbsolute(rel)) throw new VfsError(`symlink escape from ${this.root}: ${osPath}`);
-    return real;
-  }
+  private safe(osPath: string): string {}
   read(path: string): Buffer { return readFileSync(this.safe(this.osPath(path))); }
   list(path: string): VfsEntry[] {
killedBy: AH-VFS-001 Virtual Filesystem backend routing routes /workspace to LocalBackend
statusReason: The "path" argument must be of type string or an instance of Buffer or URL. Received undefined

[Killed] ConditionalExpression
vfs/virtual-filesystem.ts:74:9
     const real = realpathSafe(osPath);
     const rootReal = realpathSafe(this.root);
     const rel = relative(rootReal, real);
-    if (rel.startsWith('..') || isAbsolute(rel)) throw new VfsError(`symlink escape from ${this.root}: ${osPath}`);
+    if (true) throw new VfsError(`symlink escape from ${this.root}: ${osPath}`);
     return real;
   }
killedBy: AH-VFS-001 Virtual Filesystem backend routing routes /workspace to LocalBackend
statusReason: symlink escape from /var/folders/c8/1b9c_tms7c5bvfwfxsm_qsm80000gn/T/vfs-LJNvAS: /var/folders/c8/1b9c_tms7c5bvfwfxsm_qsm80000gn/T/vfs-LJNvAS/a.txt

[Killed] ConditionalExpression
vfs/virtual-filesystem.ts:74:9
     const real = realpathSafe(osPath);
     const rootReal = realpathSafe(this.root);
     const rel = relative(rootReal, real);
-    if (rel.startsWith('..') || isAbsolute(rel)) throw new VfsError(`symlink escape from ${this.root}: ${osPath}`);
+    if (false) throw new VfsError(`symlink escape from ${this.root}: ${osPath}`);
     return real;
   }
killedBy: AH-VFS-001 Virtual Filesystem path traversal & symlink escape blocks symlink escape outside root
statusReason: expected error to be instance of VfsError

[Killed] BlockStatement
vfs/virtual-filesystem.ts:77:30
     if (rel.startsWith('..') || isAbsolute(rel)) throw new VfsError(`symlink escape from ${this.root}: ${osPath}`);
     return real;
   }
-  read(path: string): Buffer { return readFileSync(this.safe(this.osPath(path))); }
+  read(path: string): Buffer {}
   list(path: string): VfsEntry[] {
     const dir = this.safe(this.osPath(path));
killedBy: AH-VFS-001 Virtual Filesystem backend routing routes /workspace to LocalBackend
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
vfs/virtual-filesystem.ts:78:34
     return real;
   }
   read(path: string): Buffer { return readFileSync(this.safe(this.osPath(path))); }
-  list(path: string): VfsEntry[] {
-    const dir = this.safe(this.osPath(path));
-    return readdirSync(dir, { withFileTypes: true }).map(e => ({
-      path: join(path, e.name).replace(/\\/g, '/'),
-      kind: e.isDirectory() ? 'dir' : 'file',
-      size: e.isDirectory() ? 0 : statSync(join(dir, e.name)).size,
-    }));
-  }
+  list(path: string): VfsEntry[] {}
   write(path: string, data: Buffer): void {
     const os = this.osPath(path);
killedBy: AH-VFS-001 Virtual Filesystem list / search / receipts list returns entries under a prefix
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] BooleanLiteral
vfs/virtual-filesystem.ts:80:46
   read(path: string): Buffer { return readFileSync(this.safe(this.osPath(path))); }
   list(path: string): VfsEntry[] {
     const dir = this.safe(this.osPath(path));
-    return readdirSync(dir, { withFileTypes: true }).map(e => ({
+    return readdirSync(dir, { withFileTypes: false }).map(e => ({
       path: join(path, e.name).replace(/\\/g, '/'),
       kind: e.isDirectory() ? 'dir' : 'file',
killedBy: AH-VFS-001 Virtual Filesystem list / search / receipts list returns entries under a prefix
statusReason: The "path" argument must be of type string. Received undefined

[Killed] ArrowFunction
vfs/virtual-filesystem.ts:80:58
   read(path: string): Buffer { return readFileSync(this.safe(this.osPath(path))); }
   list(path: string): VfsEntry[] {
     const dir = this.safe(this.osPath(path));
-    return readdirSync(dir, { withFileTypes: true }).map(e => ({
-      path: join(path, e.name).replace(/\\/g, '/'),
-      kind: e.isDirectory() ? 'dir' : 'file',
-      size: e.isDirectory() ? 0 : statSync(join(dir, e.name)).size,
-    }));
+    return readdirSync(dir, { withFileTypes: true }).map(() => undefined);
   }
   write(path: string, data: Buffer): void {
killedBy: AH-VFS-001 Virtual Filesystem list / search / receipts list returns entries under a prefix
statusReason: Cannot read properties of undefined (reading 'path')

[NoCoverage] BlockStatement
vfs/virtual-filesystem.ts:86:43
       size: e.isDirectory() ? 0 : statSync(join(dir, e.name)).size,
     }));
   }
-  write(path: string, data: Buffer): void {
-    const os = this.osPath(path);
-    mkdirSync(dirname(os), { recursive: true });
-    writeFileSync(os, data);
-    this.safe(os);
-  }
+  write(path: string, data: Buffer): void {}
   delete(path: string): void { rmSync(this.osPath(path), { recursive: true, force: true }); }
   exists(path: string): boolean { try { this.safe(this.osPath(path)); return existsSync(this.osPath(path)); } catch { return false; } }

[NoCoverage] BooleanLiteral
vfs/virtual-filesystem.ts:88:41
   }
   write(path: string, data: Buffer): void {
     const os = this.osPath(path);
-    mkdirSync(dirname(os), { recursive: true });
+    mkdirSync(dirname(os), { recursive: false });
     writeFileSync(os, data);
     this.safe(os);

[Killed] BlockStatement
vfs/virtual-filesystem.ts:92:30
     writeFileSync(os, data);
     this.safe(os);
   }
-  delete(path: string): void { rmSync(this.osPath(path), { recursive: true, force: true }); }
+  delete(path: string): void {}
   exists(path: string): boolean { try { this.safe(this.osPath(path)); return existsSync(this.osPath(path)); } catch { return false; } }
 }
killedBy: VFS backend direct coverage VFS delete removes a file
statusReason: expected true to be false // Object.is equality

[Survived] BooleanLiteral
vfs/virtual-filesystem.ts:92:84
     writeFileSync(os, data);
     this.safe(os);
   }
-  delete(path: string): void { rmSync(this.osPath(path), { recursive: true, force: true }); }
+  delete(path: string): void { rmSync(this.osPath(path), { recursive: true, force: false }); }
   exists(path: string): boolean { try { this.safe(this.osPath(path)); return existsSync(this.osPath(path)); } catch { return false; } }
 }

[Killed] BlockStatement
vfs/virtual-filesystem.ts:93:117
     this.safe(os);
   }
   delete(path: string): void { rmSync(this.osPath(path), { recursive: true, force: true }); }
-  exists(path: string): boolean { try { this.safe(this.osPath(path)); return existsSync(this.osPath(path)); } catch { return false; } }
+  exists(path: string): boolean { try { this.safe(this.osPath(path)); return existsSync(this.osPath(path)); } catch {} }
 }
 
killedBy: VFS backend direct coverage VFS delete removes a file
statusReason: expected undefined to be false // Object.is equality

[Killed] BooleanLiteral
vfs/virtual-filesystem.ts:93:126
     this.safe(os);
   }
   delete(path: string): void { rmSync(this.osPath(path), { recursive: true, force: true }); }
-  exists(path: string): boolean { try { this.safe(this.osPath(path)); return existsSync(this.osPath(path)); } catch { return false; } }
+  exists(path: string): boolean { try { this.safe(this.osPath(path)); return existsSync(this.osPath(path)); } catch { return true; } }
 }
 
killedBy: VFS backend direct coverage VFS delete removes a file
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
vfs/virtual-filesystem.ts:101:30
   readonly kind = 'store' as const;
   private readonly files = new Map<string, Buffer>();
   constructor(readonly prefix: string) {}
-  read(path: string): Buffer { return clone(this.files.get(path)); }
+  read(path: string): Buffer {}
   list(path: string): VfsEntry[] {
     const out: VfsEntry[] = [];
killedBy: AH-VFS-001 Virtual Filesystem backend routing routes /memories to StoreBackend
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
vfs/virtual-filesystem.ts:102:34
   private readonly files = new Map<string, Buffer>();
   constructor(readonly prefix: string) {}
   read(path: string): Buffer { return clone(this.files.get(path)); }
-  list(path: string): VfsEntry[] {
-    const out: VfsEntry[] = [];
-    for (const k of this.files.keys()) if (k.startsWith(path === '/' ? '/' : path + '/')) out.push({ path: k, kind: 'file', size: this.files.get(k)!.length });
-    return out;
-  }
+  list(path: string): VfsEntry[] {}
   write(path: string, data: Buffer): void { this.files.set(path, clone(data)); }
   delete(path: string): void { this.files.delete(path); }
killedBy: VFS backend direct coverage StoreBackend list/read/delete/exists
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
vfs/virtual-filesystem.ts:104:44
   read(path: string): Buffer { return clone(this.files.get(path)); }
   list(path: string): VfsEntry[] {
     const out: VfsEntry[] = [];
-    for (const k of this.files.keys()) if (k.startsWith(path === '/' ? '/' : path + '/')) out.push({ path: k, kind: 'file', size: this.files.get(k)!.length });
+    for (const k of this.files.keys()) if (false) out.push({ path: k, kind: 'file', size: this.files.get(k)!.length });
     return out;
   }
killedBy: VFS backend direct coverage StoreBackend list/read/delete/exists
statusReason: expected +0 to be 2 // Object.is equality

[Killed] EqualityOperator
vfs/virtual-filesystem.ts:104:57
   read(path: string): Buffer { return clone(this.files.get(path)); }
   list(path: string): VfsEntry[] {
     const out: VfsEntry[] = [];
-    for (const k of this.files.keys()) if (k.startsWith(path === '/' ? '/' : path + '/')) out.push({ path: k, kind: 'file', size: this.files.get(k)!.length });
+    for (const k of this.files.keys()) if (k.startsWith(path !== '/' ? '/' : path + '/')) out.push({ path: k, kind: 'file', size: this.files.get(k)!.length });
     return out;
   }
killedBy: VFS backend direct coverage StoreBackend list/read/delete/exists
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
vfs/virtual-filesystem.ts:107:43
     for (const k of this.files.keys()) if (k.startsWith(path === '/' ? '/' : path + '/')) out.push({ path: k, kind: 'file', size: this.files.get(k)!.length });
     return out;
   }
-  write(path: string, data: Buffer): void { this.files.set(path, clone(data)); }
+  write(path: string, data: Buffer): void {}
   delete(path: string): void { this.files.delete(path); }
   exists(path: string): boolean { return this.files.has(path); }
killedBy: AH-VFS-001 Virtual Filesystem backend routing routes /memories to StoreBackend
statusReason: not found

[Killed] BlockStatement
vfs/virtual-filesystem.ts:108:30
     return out;
   }
   write(path: string, data: Buffer): void { this.files.set(path, clone(data)); }
-  delete(path: string): void { this.files.delete(path); }
+  delete(path: string): void {}
   exists(path: string): boolean { return this.files.has(path); }
 }
killedBy: VFS backend direct coverage StoreBackend list/read/delete/exists
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
vfs/virtual-filesystem.ts:109:33
   }
   write(path: string, data: Buffer): void { this.files.set(path, clone(data)); }
   delete(path: string): void { this.files.delete(path); }
-  exists(path: string): boolean { return this.files.has(path); }
+  exists(path: string): boolean {}
 }
 
killedBy: AH-VFS-001 Virtual Filesystem OverlayBackend transactional commit/discard discards partial edits so nothing reaches the target
statusReason: expected undefined to be false // Object.is equality

[Killed] MethodExpression
vfs/virtual-filesystem.ts:120:44
   read(path: string): Buffer { return clone(this.files.get(path)); }
   list(path: string): VfsEntry[] {
     const out: VfsEntry[] = [];
-    for (const k of this.files.keys()) if (k.startsWith(path === '/' ? '/' : path + '/')) out.push({ path: k, kind: 'file', size: this.files.get(k)!.length });
+    for (const k of this.files.keys()) if (k.endsWith(path === '/' ? '/' : path + '/')) out.push({ path: k, kind: 'file', size: this.files.get(k)!.length });
     return out;
   }
killedBy: VFS backend direct coverage EvidenceBackend list/read/exists + WORM delete throws
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
vfs/virtual-filesystem.ts:123:43
     for (const k of this.files.keys()) if (k.startsWith(path === '/' ? '/' : path + '/')) out.push({ path: k, kind: 'file', size: this.files.get(k)!.length });
     return out;
   }
-  write(path: string, data: Buffer): void {
-    if (this.files.has(path)) throw new VfsError(`evidence is WORM: ${path} already exists`);
-    this.files.set(path, clone(data));
-  }
+  write(path: string, data: Buffer): void {}
   delete(_path: string): void { throw new VfsError('evidence backend is immutable'); }
   exists(path: string): boolean { return this.files.has(path); }
killedBy: AH-VFS-001 Virtual Filesystem EvidenceBackend WORM write-once: second write throws
statusReason: expected function to throw an error, but it didn't

[Killed] ConditionalExpression
vfs/virtual-filesystem.ts:124:9
     return out;
   }
   write(path: string, data: Buffer): void {
-    if (this.files.has(path)) throw new VfsError(`evidence is WORM: ${path} already exists`);
+    if (true) throw new VfsError(`evidence is WORM: ${path} already exists`);
     this.files.set(path, clone(data));
   }
killedBy: AH-VFS-001 Virtual Filesystem EvidenceBackend WORM write-once: second write throws
statusReason: evidence is WORM: /evidence/1 already exists

[Killed] ConditionalExpression
vfs/virtual-filesystem.ts:124:9
     return out;
   }
   write(path: string, data: Buffer): void {
-    if (this.files.has(path)) throw new VfsError(`evidence is WORM: ${path} already exists`);
+    if (false) throw new VfsError(`evidence is WORM: ${path} already exists`);
     this.files.set(path, clone(data));
   }
killedBy: AH-VFS-001 Virtual Filesystem EvidenceBackend WORM write-once: second write throws
statusReason: expected function to throw an error, but it didn't

[Killed] BlockStatement
vfs/virtual-filesystem.ts:127:31
     if (this.files.has(path)) throw new VfsError(`evidence is WORM: ${path} already exists`);
     this.files.set(path, clone(data));
   }
-  delete(_path: string): void { throw new VfsError('evidence backend is immutable'); }
+  delete(_path: string): void {}
   exists(path: string): boolean { return this.files.has(path); }
 }
killedBy: AH-VFS-001 Virtual Filesystem EvidenceBackend WORM delete is forbidden
statusReason: expected function to throw an error, but it didn't

[Killed] BlockStatement
vfs/virtual-filesystem.ts:128:33
     this.files.set(path, clone(data));
   }
   delete(_path: string): void { throw new VfsError('evidence backend is immutable'); }
-  exists(path: string): boolean { return this.files.has(path); }
+  exists(path: string): boolean {}
 }
 
killedBy: VFS backend direct coverage EvidenceBackend list/read/exists + WORM delete throws
statusReason: expected undefined to be true // Object.is equality

[Killed] BooleanLiteral
vfs/virtual-filesystem.ts:136:23
   readonly kind = 'overlay' as const;
   private readonly staged = new Map<string, Buffer>();
   private readonly tombstones = new Set<string>();
-  private committed = false;
+  private committed = true;
   private discarded = false;
   constructor(readonly prefix: string) {}
killedBy: AH-VFS-001 Virtual Filesystem OverlayBackend transactional commit/discard stages writes then commits atomically to LocalBackend
statusReason: overlay already committed

[Killed] BooleanLiteral
vfs/virtual-filesystem.ts:137:23
   private readonly staged = new Map<string, Buffer>();
   private readonly tombstones = new Set<string>();
   private committed = false;
-  private discarded = false;
+  private discarded = true;
   constructor(readonly prefix: string) {}
   private checkTx(): void {
killedBy: AH-VFS-001 Virtual Filesystem OverlayBackend transactional commit/discard stages writes then commits atomically to LocalBackend
statusReason: overlay already discarded

[Killed] BlockStatement
vfs/virtual-filesystem.ts:139:27
   private committed = false;
   private discarded = false;
   constructor(readonly prefix: string) {}
-  private checkTx(): void {
-    if (this.committed) throw new VfsError('overlay already committed');
-    if (this.discarded) throw new VfsError('overlay already discarded');
-  }
+  private checkTx(): void {}
   read(path: string): Buffer { if (this.tombstones.has(path)) throw new VfsError(`not found: ${path}`); return clone(this.staged.get(path)); }
   list(path: string): VfsEntry[] {
killedBy: AH-VFS-001 Virtual Filesystem OverlayBackend transactional commit/discard discards partial edits so nothing reaches the target
statusReason: expected function to throw an error, but it didn't
