[Killed] ConditionalExpression
vfs/virtual-filesystem.ts:140:9
   private discarded = false;
   constructor(readonly prefix: string) {}
   private checkTx(): void {
-    if (this.committed) throw new VfsError('overlay already committed');
+    if (false) throw new VfsError('overlay already committed');
     if (this.discarded) throw new VfsError('overlay already discarded');
   }
killedBy: VFS backend direct coverage OverlayBackend markCommitted blocks further writes
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
vfs/virtual-filesystem.ts:140:9
   private discarded = false;
   constructor(readonly prefix: string) {}
   private checkTx(): void {
-    if (this.committed) throw new VfsError('overlay already committed');
+    if (true) throw new VfsError('overlay already committed');
     if (this.discarded) throw new VfsError('overlay already discarded');
   }
killedBy: AH-VFS-001 Virtual Filesystem OverlayBackend transactional commit/discard stages writes then commits atomically to LocalBackend
statusReason: overlay already committed

[Killed] ConditionalExpression
vfs/virtual-filesystem.ts:141:9
   constructor(readonly prefix: string) {}
   private checkTx(): void {
     if (this.committed) throw new VfsError('overlay already committed');
-    if (this.discarded) throw new VfsError('overlay already discarded');
+    if (true) throw new VfsError('overlay already discarded');
   }
   read(path: string): Buffer { if (this.tombstones.has(path)) throw new VfsError(`not found: ${path}`); return clone(this.staged.get(path)); }
killedBy: AH-VFS-001 Virtual Filesystem OverlayBackend transactional commit/discard stages writes then commits atomically to LocalBackend
statusReason: overlay already discarded

[Killed] ConditionalExpression
vfs/virtual-filesystem.ts:141:9
   constructor(readonly prefix: string) {}
   private checkTx(): void {
     if (this.committed) throw new VfsError('overlay already committed');
-    if (this.discarded) throw new VfsError('overlay already discarded');
+    if (false) throw new VfsError('overlay already discarded');
   }
   read(path: string): Buffer { if (this.tombstones.has(path)) throw new VfsError(`not found: ${path}`); return clone(this.staged.get(path)); }
killedBy: AH-VFS-001 Virtual Filesystem OverlayBackend transactional commit/discard discards partial edits so nothing reaches the target
statusReason: expected function to throw an error, but it didn't

[Killed] ConditionalExpression
vfs/virtual-filesystem.ts:143:36
     if (this.committed) throw new VfsError('overlay already committed');
     if (this.discarded) throw new VfsError('overlay already discarded');
   }
-  read(path: string): Buffer { if (this.tombstones.has(path)) throw new VfsError(`not found: ${path}`); return clone(this.staged.get(path)); }
+  read(path: string): Buffer { if (true) throw new VfsError(`not found: ${path}`); return clone(this.staged.get(path)); }
   list(path: string): VfsEntry[] {
     const out: VfsEntry[] = [];
killedBy: AH-VFS-001 Virtual Filesystem OverlayBackend transactional commit/discard stages writes then commits atomically to LocalBackend
statusReason: not found: /scratch/f1

[Killed] BlockStatement
vfs/virtual-filesystem.ts:143:30
     if (this.committed) throw new VfsError('overlay already committed');
     if (this.discarded) throw new VfsError('overlay already discarded');
   }
-  read(path: string): Buffer { if (this.tombstones.has(path)) throw new VfsError(`not found: ${path}`); return clone(this.staged.get(path)); }
+  read(path: string): Buffer {}
   list(path: string): VfsEntry[] {
     const out: VfsEntry[] = [];
killedBy: AH-VFS-001 Virtual Filesystem OverlayBackend transactional commit/discard stages writes then commits atomically to LocalBackend
statusReason: Cannot read properties of undefined (reading 'toString')

[Killed] BlockStatement
vfs/virtual-filesystem.ts:144:34
     if (this.discarded) throw new VfsError('overlay already discarded');
   }
   read(path: string): Buffer { if (this.tombstones.has(path)) throw new VfsError(`not found: ${path}`); return clone(this.staged.get(path)); }
-  list(path: string): VfsEntry[] {
-    const out: VfsEntry[] = [];
-    for (const k of this.staged.keys()) if (!this.tombstones.has(k) && k.startsWith(path === '/' ? '/' : path + '/')) out.push({ path: k, kind: 'file', size: this.staged.get(k)!.length });
-    return out;
-  }
+  list(path: string): VfsEntry[] {}
   write(path: string, data: Buffer): void { this.checkTx(); this.staged.set(path, clone(data)); this.tombstones.delete(path); }
   delete(path: string): void { this.checkTx(); this.tombstones.add(path); this.staged.delete(path); }
killedBy: VFS backend direct coverage OverlayBackend list/read/delete/exists/tombstones
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] MethodExpression
vfs/virtual-filesystem.ts:146:72
   read(path: string): Buffer { if (this.tombstones.has(path)) throw new VfsError(`not found: ${path}`); return clone(this.staged.get(path)); }
   list(path: string): VfsEntry[] {
     const out: VfsEntry[] = [];
-    for (const k of this.staged.keys()) if (!this.tombstones.has(k) && k.startsWith(path === '/' ? '/' : path + '/')) out.push({ path: k, kind: 'file', size: this.staged.get(k)!.length });
+    for (const k of this.staged.keys()) if (!this.tombstones.has(k) && k.endsWith(path === '/' ? '/' : path + '/')) out.push({ path: k, kind: 'file', size: this.staged.get(k)!.length });
     return out;
   }
killedBy: VFS backend direct coverage OverlayBackend list/read/delete/exists/tombstones
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ConditionalExpression
vfs/virtual-filesystem.ts:146:45
   read(path: string): Buffer { if (this.tombstones.has(path)) throw new VfsError(`not found: ${path}`); return clone(this.staged.get(path)); }
   list(path: string): VfsEntry[] {
     const out: VfsEntry[] = [];
-    for (const k of this.staged.keys()) if (!this.tombstones.has(k) && k.startsWith(path === '/' ? '/' : path + '/')) out.push({ path: k, kind: 'file', size: this.staged.get(k)!.length });
+    for (const k of this.staged.keys()) if (false) out.push({ path: k, kind: 'file', size: this.staged.get(k)!.length });
     return out;
   }
killedBy: VFS backend direct coverage OverlayBackend list/read/delete/exists/tombstones
statusReason: expected +0 to be 2 // Object.is equality

[Killed] BlockStatement
vfs/virtual-filesystem.ts:149:43
     for (const k of this.staged.keys()) if (!this.tombstones.has(k) && k.startsWith(path === '/' ? '/' : path + '/')) out.push({ path: k, kind: 'file', size: this.staged.get(k)!.length });
     return out;
   }
-  write(path: string, data: Buffer): void { this.checkTx(); this.staged.set(path, clone(data)); this.tombstones.delete(path); }
+  write(path: string, data: Buffer): void {}
   delete(path: string): void { this.checkTx(); this.tombstones.add(path); this.staged.delete(path); }
   exists(path: string): boolean { return !this.tombstones.has(path) && this.staged.has(path); }
killedBy: AH-VFS-001 Virtual Filesystem OverlayBackend transactional commit/discard stages writes then commits atomically to LocalBackend
statusReason: not found

[Killed] BlockStatement
vfs/virtual-filesystem.ts:150:30
     return out;
   }
   write(path: string, data: Buffer): void { this.checkTx(); this.staged.set(path, clone(data)); this.tombstones.delete(path); }
-  delete(path: string): void { this.checkTx(); this.tombstones.add(path); this.staged.delete(path); }
+  delete(path: string): void {}
   exists(path: string): boolean { return !this.tombstones.has(path) && this.staged.has(path); }
   stagedEntries(): ReadonlyArray<readonly [string, Buffer]> { return [...this.staged.entries()].map(([p, b]) => [p, clone(b)] as const); }
killedBy: VFS backend direct coverage OverlayBackend list/read/delete/exists/tombstones
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
vfs/virtual-filesystem.ts:151:33
   }
   write(path: string, data: Buffer): void { this.checkTx(); this.staged.set(path, clone(data)); this.tombstones.delete(path); }
   delete(path: string): void { this.checkTx(); this.tombstones.add(path); this.staged.delete(path); }
-  exists(path: string): boolean { return !this.tombstones.has(path) && this.staged.has(path); }
+  exists(path: string): boolean {}
   stagedEntries(): ReadonlyArray<readonly [string, Buffer]> { return [...this.staged.entries()].map(([p, b]) => [p, clone(b)] as const); }
   stagedTombstones(): readonly string[] { return [...this.tombstones]; }
killedBy: VFS backend direct coverage OverlayBackend list/read/delete/exists/tombstones
statusReason: expected undefined to be false // Object.is equality

[Killed] ConditionalExpression
vfs/virtual-filesystem.ts:151:42
   }
   write(path: string, data: Buffer): void { this.checkTx(); this.staged.set(path, clone(data)); this.tombstones.delete(path); }
   delete(path: string): void { this.checkTx(); this.tombstones.add(path); this.staged.delete(path); }
-  exists(path: string): boolean { return !this.tombstones.has(path) && this.staged.has(path); }
+  exists(path: string): boolean { return true; }
   stagedEntries(): ReadonlyArray<readonly [string, Buffer]> { return [...this.staged.entries()].map(([p, b]) => [p, clone(b)] as const); }
   stagedTombstones(): readonly string[] { return [...this.tombstones]; }
killedBy: VFS backend direct coverage OverlayBackend list/read/delete/exists/tombstones
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
vfs/virtual-filesystem.ts:152:61
   write(path: string, data: Buffer): void { this.checkTx(); this.staged.set(path, clone(data)); this.tombstones.delete(path); }
   delete(path: string): void { this.checkTx(); this.tombstones.add(path); this.staged.delete(path); }
   exists(path: string): boolean { return !this.tombstones.has(path) && this.staged.has(path); }
-  stagedEntries(): ReadonlyArray<readonly [string, Buffer]> { return [...this.staged.entries()].map(([p, b]) => [p, clone(b)] as const); }
+  stagedEntries(): ReadonlyArray<readonly [string, Buffer]> {}
   stagedTombstones(): readonly string[] { return [...this.tombstones]; }
   markCommitted(): void { this.committed = true; }
killedBy: AH-VFS-001 Virtual Filesystem OverlayBackend transactional commit/discard stages writes then commits atomically to LocalBackend
statusReason: overlay.stagedEntries is not a function or its return value is not iterable

[Killed] ArrowFunction
vfs/virtual-filesystem.ts:152:101
   write(path: string, data: Buffer): void { this.checkTx(); this.staged.set(path, clone(data)); this.tombstones.delete(path); }
   delete(path: string): void { this.checkTx(); this.tombstones.add(path); this.staged.delete(path); }
   exists(path: string): boolean { return !this.tombstones.has(path) && this.staged.has(path); }
-  stagedEntries(): ReadonlyArray<readonly [string, Buffer]> { return [...this.staged.entries()].map(([p, b]) => [p, clone(b)] as const); }
+  stagedEntries(): ReadonlyArray<readonly [string, Buffer]> { return [...this.staged.entries()].map(() => undefined); }
   stagedTombstones(): readonly string[] { return [...this.tombstones]; }
   markCommitted(): void { this.committed = true; }
killedBy: AH-VFS-001 Virtual Filesystem OverlayBackend transactional commit/discard stages writes then commits atomically to LocalBackend
statusReason: .for is not iterable

[Killed] BlockStatement
vfs/virtual-filesystem.ts:153:41
   delete(path: string): void { this.checkTx(); this.tombstones.add(path); this.staged.delete(path); }
   exists(path: string): boolean { return !this.tombstones.has(path) && this.staged.has(path); }
   stagedEntries(): ReadonlyArray<readonly [string, Buffer]> { return [...this.staged.entries()].map(([p, b]) => [p, clone(b)] as const); }
-  stagedTombstones(): readonly string[] { return [...this.tombstones]; }
+  stagedTombstones(): readonly string[] {}
   markCommitted(): void { this.committed = true; }
   markDiscarded(): void { this.discarded = true; }
killedBy: AH-VFS-001 Virtual Filesystem OverlayBackend transactional commit/discard stages writes then commits atomically to LocalBackend
statusReason: overlay.stagedTombstones is not a function or its return value is not iterable

[Killed] BlockStatement
vfs/virtual-filesystem.ts:154:25
   exists(path: string): boolean { return !this.tombstones.has(path) && this.staged.has(path); }
   stagedEntries(): ReadonlyArray<readonly [string, Buffer]> { return [...this.staged.entries()].map(([p, b]) => [p, clone(b)] as const); }
   stagedTombstones(): readonly string[] { return [...this.tombstones]; }
-  markCommitted(): void { this.committed = true; }
+  markCommitted(): void {}
   markDiscarded(): void { this.discarded = true; }
   isCommitted(): boolean { return this.committed; }
killedBy: AH-VFS-001 Virtual Filesystem OverlayBackend transactional commit/discard stages writes then commits atomically to LocalBackend
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
vfs/virtual-filesystem.ts:154:44
   exists(path: string): boolean { return !this.tombstones.has(path) && this.staged.has(path); }
   stagedEntries(): ReadonlyArray<readonly [string, Buffer]> { return [...this.staged.entries()].map(([p, b]) => [p, clone(b)] as const); }
   stagedTombstones(): readonly string[] { return [...this.tombstones]; }
-  markCommitted(): void { this.committed = true; }
+  markCommitted(): void { this.committed = false; }
   markDiscarded(): void { this.discarded = true; }
   isCommitted(): boolean { return this.committed; }
killedBy: AH-VFS-001 Virtual Filesystem OverlayBackend transactional commit/discard stages writes then commits atomically to LocalBackend
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
vfs/virtual-filesystem.ts:155:25
   stagedEntries(): ReadonlyArray<readonly [string, Buffer]> { return [...this.staged.entries()].map(([p, b]) => [p, clone(b)] as const); }
   stagedTombstones(): readonly string[] { return [...this.tombstones]; }
   markCommitted(): void { this.committed = true; }
-  markDiscarded(): void { this.discarded = true; }
+  markDiscarded(): void {}
   isCommitted(): boolean { return this.committed; }
   isDiscarded(): boolean { return this.discarded; }
killedBy: AH-VFS-001 Virtual Filesystem OverlayBackend transactional commit/discard discards partial edits so nothing reaches the target
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
vfs/virtual-filesystem.ts:155:44
   stagedEntries(): ReadonlyArray<readonly [string, Buffer]> { return [...this.staged.entries()].map(([p, b]) => [p, clone(b)] as const); }
   stagedTombstones(): readonly string[] { return [...this.tombstones]; }
   markCommitted(): void { this.committed = true; }
-  markDiscarded(): void { this.discarded = true; }
+  markDiscarded(): void { this.discarded = false; }
   isCommitted(): boolean { return this.committed; }
   isDiscarded(): boolean { return this.discarded; }
killedBy: AH-VFS-001 Virtual Filesystem OverlayBackend transactional commit/discard discards partial edits so nothing reaches the target
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
vfs/virtual-filesystem.ts:156:26
   stagedTombstones(): readonly string[] { return [...this.tombstones]; }
   markCommitted(): void { this.committed = true; }
   markDiscarded(): void { this.discarded = true; }
-  isCommitted(): boolean { return this.committed; }
+  isCommitted(): boolean {}
   isDiscarded(): boolean { return this.discarded; }
 }
killedBy: AH-VFS-001 Virtual Filesystem OverlayBackend transactional commit/discard stages writes then commits atomically to LocalBackend
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
vfs/virtual-filesystem.ts:157:26
   markCommitted(): void { this.committed = true; }
   markDiscarded(): void { this.discarded = true; }
   isCommitted(): boolean { return this.committed; }
-  isDiscarded(): boolean { return this.discarded; }
+  isDiscarded(): boolean {}
 }
 
killedBy: AH-VFS-001 Virtual Filesystem OverlayBackend transactional commit/discard discards partial edits so nothing reaches the target
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
vfs/virtual-filesystem.ts:165:44
   private readonly backends: Backend[] = [];
   private readonly permissions: VfsPermissionRule[] = [];
   private readonly log: VfsReceipt[] = [];
-  constructor(rules?: VfsPermissionRule[]) { if (rules) this.permissions.push(...rules); }
+  constructor(rules?: VfsPermissionRule[]) {}
   mount(backend: Backend): void {
     if (this.backends.some(b => b.prefix === backend.prefix)) throw new VfsError(`duplicate mount: ${backend.prefix}`);
killedBy: AH-VFS-001 Virtual Filesystem backend routing routes /workspace to LocalBackend
statusReason: permission denied: /workspace/a.txt

[Killed] ConditionalExpression
vfs/virtual-filesystem.ts:165:50
   private readonly backends: Backend[] = [];
   private readonly permissions: VfsPermissionRule[] = [];
   private readonly log: VfsReceipt[] = [];
-  constructor(rules?: VfsPermissionRule[]) { if (rules) this.permissions.push(...rules); }
+  constructor(rules?: VfsPermissionRule[]) { if (false) this.permissions.push(...rules); }
   mount(backend: Backend): void {
     if (this.backends.some(b => b.prefix === backend.prefix)) throw new VfsError(`duplicate mount: ${backend.prefix}`);
killedBy: AH-VFS-001 Virtual Filesystem backend routing routes /workspace to LocalBackend
statusReason: permission denied: /workspace/a.txt

[Killed] BlockStatement
vfs/virtual-filesystem.ts:166:33
   private readonly permissions: VfsPermissionRule[] = [];
   private readonly log: VfsReceipt[] = [];
   constructor(rules?: VfsPermissionRule[]) { if (rules) this.permissions.push(...rules); }
-  mount(backend: Backend): void {
-    if (this.backends.some(b => b.prefix === backend.prefix)) throw new VfsError(`duplicate mount: ${backend.prefix}`);
-    this.backends.push(backend);
-    this.backends.sort((a, b) => b.prefix.length - a.prefix.length);
-  }
+  mount(backend: Backend): void {}
   addPermissionRule(rule: VfsPermissionRule): void { this.permissions.push(rule); }
   private route(path: string): Backend {
killedBy: AH-VFS-001 Virtual Filesystem backend routing routes /workspace to LocalBackend
statusReason: no backend for path: /workspace/a.txt

[Killed] ConditionalExpression
vfs/virtual-filesystem.ts:167:33
   private readonly log: VfsReceipt[] = [];
   constructor(rules?: VfsPermissionRule[]) { if (rules) this.permissions.push(...rules); }
   mount(backend: Backend): void {
-    if (this.backends.some(b => b.prefix === backend.prefix)) throw new VfsError(`duplicate mount: ${backend.prefix}`);
+    if (this.backends.some(b => true)) throw new VfsError(`duplicate mount: ${backend.prefix}`);
     this.backends.push(backend);
     this.backends.sort((a, b) => b.prefix.length - a.prefix.length);
killedBy: AH-VFS-001 Virtual Filesystem backend routing routes /workspace to LocalBackend
statusReason: duplicate mount: /scratch

[Killed] MethodExpression
vfs/virtual-filesystem.ts:167:9
   private readonly log: VfsReceipt[] = [];
   constructor(rules?: VfsPermissionRule[]) { if (rules) this.permissions.push(...rules); }
   mount(backend: Backend): void {
-    if (this.backends.some(b => b.prefix === backend.prefix)) throw new VfsError(`duplicate mount: ${backend.prefix}`);
+    if (this.backends.every(b => b.prefix === backend.prefix)) throw new VfsError(`duplicate mount: ${backend.prefix}`);
     this.backends.push(backend);
     this.backends.sort((a, b) => b.prefix.length - a.prefix.length);
killedBy: AH-VFS-001 Virtual Filesystem backend routing routes /workspace to LocalBackend
statusReason: duplicate mount: /workspace

[Survived] ArrowFunction
vfs/virtual-filesystem.ts:169:24
   mount(backend: Backend): void {
     if (this.backends.some(b => b.prefix === backend.prefix)) throw new VfsError(`duplicate mount: ${backend.prefix}`);
     this.backends.push(backend);
-    this.backends.sort((a, b) => b.prefix.length - a.prefix.length);
+    this.backends.sort(() => undefined);
   }
   addPermissionRule(rule: VfsPermissionRule): void { this.permissions.push(rule); }

[Survived] MethodExpression
vfs/virtual-filesystem.ts:169:5
   mount(backend: Backend): void {
     if (this.backends.some(b => b.prefix === backend.prefix)) throw new VfsError(`duplicate mount: ${backend.prefix}`);
     this.backends.push(backend);
-    this.backends.sort((a, b) => b.prefix.length - a.prefix.length);
+    this.backends;
   }
   addPermissionRule(rule: VfsPermissionRule): void { this.permissions.push(rule); }

[NoCoverage] BlockStatement
vfs/virtual-filesystem.ts:171:52
     this.backends.push(backend);
     this.backends.sort((a, b) => b.prefix.length - a.prefix.length);
   }
-  addPermissionRule(rule: VfsPermissionRule): void { this.permissions.push(rule); }
+  addPermissionRule(rule: VfsPermissionRule): void {}
   private route(path: string): Backend {
     assertSafeVfsPath(path);

[Killed] BlockStatement
vfs/virtual-filesystem.ts:172:40
     this.backends.sort((a, b) => b.prefix.length - a.prefix.length);
   }
   addPermissionRule(rule: VfsPermissionRule): void { this.permissions.push(rule); }
-  private route(path: string): Backend {
-    assertSafeVfsPath(path);
-    for (const b of this.backends) if (path === b.prefix || path.startsWith(b.prefix === '/' ? '/' : b.prefix + '/')) return b;
-    throw new VfsError(`no backend for path: ${path}`);
-  }
+  private route(path: string): Backend {}
   private checkPermission(path: string, write: boolean): void {
     // deny-by-default: a path is accessible only if a rule explicitly permits it.
killedBy: AH-VFS-001 Virtual Filesystem backend routing routes /workspace to LocalBackend
statusReason: Cannot read properties of undefined (reading 'read')

[Killed] EqualityOperator
vfs/virtual-filesystem.ts:174:40
   addPermissionRule(rule: VfsPermissionRule): void { this.permissions.push(rule); }
   private route(path: string): Backend {
     assertSafeVfsPath(path);
-    for (const b of this.backends) if (path === b.prefix || path.startsWith(b.prefix === '/' ? '/' : b.prefix + '/')) return b;
+    for (const b of this.backends) if (path !== b.prefix || path.startsWith(b.prefix === '/' ? '/' : b.prefix + '/')) return b;
     throw new VfsError(`no backend for path: ${path}`);
   }
killedBy: AH-VFS-001 Virtual Filesystem backend routing routes /memories to StoreBackend
statusReason: escape from /workspace: /memories/note

[Killed] ConditionalExpression
vfs/virtual-filesystem.ts:174:77
   addPermissionRule(rule: VfsPermissionRule): void { this.permissions.push(rule); }
   private route(path: string): Backend {
     assertSafeVfsPath(path);
-    for (const b of this.backends) if (path === b.prefix || path.startsWith(b.prefix === '/' ? '/' : b.prefix + '/')) return b;
+    for (const b of this.backends) if (path === b.prefix || path.startsWith(true ? '/' : b.prefix + '/')) return b;
     throw new VfsError(`no backend for path: ${path}`);
   }
killedBy: AH-VFS-001 Virtual Filesystem backend routing routes /memories to StoreBackend
statusReason: escape from /workspace: /memories/note

[NoCoverage] StringLiteral
vfs/virtual-filesystem.ts:175:24
   private route(path: string): Backend {
     assertSafeVfsPath(path);
     for (const b of this.backends) if (path === b.prefix || path.startsWith(b.prefix === '/' ? '/' : b.prefix + '/')) return b;
-    throw new VfsError(`no backend for path: ${path}`);
+    throw new VfsError(``);
   }
   private checkPermission(path: string, write: boolean): void {

[Killed] BlockStatement
vfs/virtual-filesystem.ts:177:63
     for (const b of this.backends) if (path === b.prefix || path.startsWith(b.prefix === '/' ? '/' : b.prefix + '/')) return b;
     throw new VfsError(`no backend for path: ${path}`);
   }
-  private checkPermission(path: string, write: boolean): void {
-    // deny-by-default: a path is accessible only if a rule explicitly permits it.
-    let allowed = false;
-    for (const r of this.permissions) if (path === r.prefix || path.startsWith(r.prefix === '/' ? '/' : r.prefix + '/')) allowed = write ? r.write : r.read;
-    if (!allowed) throw new VfsError(`permission denied: ${path}`);
-  }
+  private checkPermission(path: string, write: boolean): void {}
   private record(r: VfsReceipt): void { this.log.push(r); }
   receipts(): readonly VfsReceipt[] { return this.log; }
killedBy: AH-VFS-001 Virtual Filesystem deny-by-default permissions denies a path with no rule (deny-by-default)
statusReason: expected [Function] to throw error matching /permission denied/ but got 'no backend for path: /memories/x'

[Killed] BooleanLiteral
vfs/virtual-filesystem.ts:179:19
   }
   private checkPermission(path: string, write: boolean): void {
     // deny-by-default: a path is accessible only if a rule explicitly permits it.
-    let allowed = false;
+    let allowed = true;
     for (const r of this.permissions) if (path === r.prefix || path.startsWith(r.prefix === '/' ? '/' : r.prefix + '/')) allowed = write ? r.write : r.read;
     if (!allowed) throw new VfsError(`permission denied: ${path}`);
killedBy: AH-VFS-001 Virtual Filesystem deny-by-default permissions denies a path with no rule (deny-by-default)
statusReason: expected [Function] to throw error matching /permission denied/ but got 'no backend for path: /memories/x'

[Killed] ConditionalExpression
vfs/virtual-filesystem.ts:180:43
   private checkPermission(path: string, write: boolean): void {
     // deny-by-default: a path is accessible only if a rule explicitly permits it.
     let allowed = false;
-    for (const r of this.permissions) if (path === r.prefix || path.startsWith(r.prefix === '/' ? '/' : r.prefix + '/')) allowed = write ? r.write : r.read;
+    for (const r of this.permissions) if (true) allowed = write ? r.write : r.read;
     if (!allowed) throw new VfsError(`permission denied: ${path}`);
   }
killedBy: AH-VFS-001 Virtual Filesystem backend routing routes /memories to StoreBackend
statusReason: permission denied: /memories/note

[Killed] EqualityOperator
vfs/virtual-filesystem.ts:180:43
   private checkPermission(path: string, write: boolean): void {
     // deny-by-default: a path is accessible only if a rule explicitly permits it.
     let allowed = false;
-    for (const r of this.permissions) if (path === r.prefix || path.startsWith(r.prefix === '/' ? '/' : r.prefix + '/')) allowed = write ? r.write : r.read;
+    for (const r of this.permissions) if (path !== r.prefix || path.startsWith(r.prefix === '/' ? '/' : r.prefix + '/')) allowed = write ? r.write : r.read;
     if (!allowed) throw new VfsError(`permission denied: ${path}`);
   }
killedBy: AH-VFS-001 Virtual Filesystem backend routing routes /memories to StoreBackend
statusReason: permission denied: /memories/note

[Killed] ConditionalExpression
vfs/virtual-filesystem.ts:181:9
     // deny-by-default: a path is accessible only if a rule explicitly permits it.
     let allowed = false;
     for (const r of this.permissions) if (path === r.prefix || path.startsWith(r.prefix === '/' ? '/' : r.prefix + '/')) allowed = write ? r.write : r.read;
-    if (!allowed) throw new VfsError(`permission denied: ${path}`);
+    if (false) throw new VfsError(`permission denied: ${path}`);
   }
   private record(r: VfsReceipt): void { this.log.push(r); }
killedBy: AH-VFS-001 Virtual Filesystem deny-by-default permissions denies a path with no rule (deny-by-default)
statusReason: expected [Function] to throw error matching /permission denied/ but got 'no backend for path: /memories/x'

[Killed] BooleanLiteral
vfs/virtual-filesystem.ts:181:9
     // deny-by-default: a path is accessible only if a rule explicitly permits it.
     let allowed = false;
     for (const r of this.permissions) if (path === r.prefix || path.startsWith(r.prefix === '/' ? '/' : r.prefix + '/')) allowed = write ? r.write : r.read;
-    if (!allowed) throw new VfsError(`permission denied: ${path}`);
+    if (allowed) throw new VfsError(`permission denied: ${path}`);
   }
   private record(r: VfsReceipt): void { this.log.push(r); }
killedBy: AH-VFS-001 Virtual Filesystem backend routing routes /workspace to LocalBackend
statusReason: permission denied: /workspace/a.txt

[Killed] BlockStatement
vfs/virtual-filesystem.ts:183:39
     for (const r of this.permissions) if (path === r.prefix || path.startsWith(r.prefix === '/' ? '/' : r.prefix + '/')) allowed = write ? r.write : r.read;
     if (!allowed) throw new VfsError(`permission denied: ${path}`);
   }
-  private record(r: VfsReceipt): void { this.log.push(r); }
+  private record(r: VfsReceipt): void {}
   receipts(): readonly VfsReceipt[] { return this.log; }
 
killedBy: AH-VFS-001 Virtual Filesystem backend routing routes /workspace to LocalBackend
statusReason: Cannot read properties of undefined (reading 'backend')

[Killed] BlockStatement
vfs/virtual-filesystem.ts:184:37
     if (!allowed) throw new VfsError(`permission denied: ${path}`);
   }
   private record(r: VfsReceipt): void { this.log.push(r); }
-  receipts(): readonly VfsReceipt[] { return this.log; }
+  receipts(): readonly VfsReceipt[] {}
 
killedBy: AH-VFS-001 Virtual Filesystem backend routing routes /workspace to LocalBackend
statusReason: Cannot read properties of undefined (reading 'at')

[Killed] BlockStatement
vfs/virtual-filesystem.ts:187:34
   receipts(): readonly VfsReceipt[] { return this.log; }
 
-  readText(path: string): string { return this.read(path).toString('utf8'); }
+  readText(path: string): string {}
killedBy: AH-VFS-001 Virtual Filesystem backend routing routes /workspace to LocalBackend
statusReason: expected undefined to be 'hello' // Object.is equality
