[Killed] BlockStatement
vfs/virtual-filesystem.ts:190:47
   readText(path: string): string { return this.read(path).toString('utf8'); }
-  writeText(path: string, text: string): void { this.write(path, text); }
+  writeText(path: string, text: string): void {}
   edit(path: string, data: Buffer | string): void { this.write(path, data); const last = this.log[this.log.length - 1]; if (last) last.operation = 'edit'; }
   delete(path: string): void { this.checkPermission(path, true); const b = this.route(path); b.delete(path); this.record({ path, backend: b.kind, operation: 'delete', timestamp: now() }); }
killedBy: AH-VFS-001 Virtual Filesystem backend routing routes /memories to StoreBackend
statusReason: not found

[NoCoverage] ConditionalExpression
vfs/virtual-filesystem.ts:191:125
   writeText(path: string, text: string): void { this.write(path, text); }
-  edit(path: string, data: Buffer | string): void { this.write(path, data); const last = this.log[this.log.length - 1]; if (last) last.operation = 'edit'; }
+  edit(path: string, data: Buffer | string): void { this.write(path, data); const last = this.log[this.log.length - 1]; if (false) last.operation = 'edit'; }
   delete(path: string): void { this.checkPermission(path, true); const b = this.route(path); b.delete(path); this.record({ path, backend: b.kind, operation: 'delete', timestamp: now() }); }
   exists(path: string): boolean { try { this.checkPermission(path, false); return this.route(path).exists(path); } catch { return false; } }

[NoCoverage] BlockStatement
vfs/virtual-filesystem.ts:191:51
   writeText(path: string, text: string): void { this.write(path, text); }
-  edit(path: string, data: Buffer | string): void { this.write(path, data); const last = this.log[this.log.length - 1]; if (last) last.operation = 'edit'; }
+  edit(path: string, data: Buffer | string): void {}
   delete(path: string): void { this.checkPermission(path, true); const b = this.route(path); b.delete(path); this.record({ path, backend: b.kind, operation: 'delete', timestamp: now() }); }
   exists(path: string): boolean { try { this.checkPermission(path, false); return this.route(path).exists(path); } catch { return false; } }

[Killed] BlockStatement
vfs/virtual-filesystem.ts:192:30
   writeText(path: string, text: string): void { this.write(path, text); }
   edit(path: string, data: Buffer | string): void { this.write(path, data); const last = this.log[this.log.length - 1]; if (last) last.operation = 'edit'; }
-  delete(path: string): void { this.checkPermission(path, true); const b = this.route(path); b.delete(path); this.record({ path, backend: b.kind, operation: 'delete', timestamp: now() }); }
+  delete(path: string): void {}
   exists(path: string): boolean { try { this.checkPermission(path, false); return this.route(path).exists(path); } catch { return false; } }
   search(root: string, needle: string): VfsEntry[] {
killedBy: VFS backend direct coverage VFS delete removes a file
statusReason: expected true to be false // Object.is equality

[Survived] BooleanLiteral
vfs/virtual-filesystem.ts:192:59
   writeText(path: string, text: string): void { this.write(path, text); }
   edit(path: string, data: Buffer | string): void { this.write(path, data); const last = this.log[this.log.length - 1]; if (last) last.operation = 'edit'; }
-  delete(path: string): void { this.checkPermission(path, true); const b = this.route(path); b.delete(path); this.record({ path, backend: b.kind, operation: 'delete', timestamp: now() }); }
+  delete(path: string): void { this.checkPermission(path, false); const b = this.route(path); b.delete(path); this.record({ path, backend: b.kind, operation: 'delete', timestamp: now() }); }
   exists(path: string): boolean { try { this.checkPermission(path, false); return this.route(path).exists(path); } catch { return false; } }
   search(root: string, needle: string): VfsEntry[] {

[Killed] BooleanLiteral
vfs/virtual-filesystem.ts:193:131
   writeText(path: string, text: string): void { this.write(path, text); }
   edit(path: string, data: Buffer | string): void { this.write(path, data); const last = this.log[this.log.length - 1]; if (last) last.operation = 'edit'; }
   delete(path: string): void { this.checkPermission(path, true); const b = this.route(path); b.delete(path); this.record({ path, backend: b.kind, operation: 'delete', timestamp: now() }); }
-  exists(path: string): boolean { try { this.checkPermission(path, false); return this.route(path).exists(path); } catch { return false; } }
+  exists(path: string): boolean { try { this.checkPermission(path, false); return this.route(path).exists(path); } catch { return true; } }
   search(root: string, needle: string): VfsEntry[] {
     const lower = needle.toLowerCase();
killedBy: VFS backend direct coverage VFS exists returns false for denied path
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
vfs/virtual-filesystem.ts:193:39
   writeText(path: string, text: string): void { this.write(path, text); }
   edit(path: string, data: Buffer | string): void { this.write(path, data); const last = this.log[this.log.length - 1]; if (last) last.operation = 'edit'; }
   delete(path: string): void { this.checkPermission(path, true); const b = this.route(path); b.delete(path); this.record({ path, backend: b.kind, operation: 'delete', timestamp: now() }); }
-  exists(path: string): boolean { try { this.checkPermission(path, false); return this.route(path).exists(path); } catch { return false; } }
+  exists(path: string): boolean { try {} catch { return false; } }
   search(root: string, needle: string): VfsEntry[] {
     const lower = needle.toLowerCase();
killedBy: VFS backend direct coverage VFS exists returns false for denied path
statusReason: expected undefined to be false // Object.is equality

[Killed] BlockStatement
vfs/virtual-filesystem.ts:194:52
   edit(path: string, data: Buffer | string): void { this.write(path, data); const last = this.log[this.log.length - 1]; if (last) last.operation = 'edit'; }
   delete(path: string): void { this.checkPermission(path, true); const b = this.route(path); b.delete(path); this.record({ path, backend: b.kind, operation: 'delete', timestamp: now() }); }
   exists(path: string): boolean { try { this.checkPermission(path, false); return this.route(path).exists(path); } catch { return false; } }
-  search(root: string, needle: string): VfsEntry[] {
-    const lower = needle.toLowerCase();
-    const matches: VfsEntry[] = [];
-    const walk = (dir: string): void => {
-      let entries: VfsEntry[];
-      try { entries = this.list(dir); } catch { return; }
-      for (const e of entries) {
-        if (e.kind === 'dir') walk(e.path);
-        else { try { if (this.readText(e.path).toLowerCase().includes(lower)) matches.push(e); } catch { /* permission */ } }
-      }
-    };
-    walk(root);
-    this.record({ path: root, backend: this.route(root).kind, operation: 'search', timestamp: now() });
-    return matches;
-  }
+  search(root: string, needle: string): VfsEntry[] {}
 
   /** Atomically commit a RunPlan overlay into its commit target backend. */
killedBy: AH-VFS-001 Virtual Filesystem list / search / receipts search finds files containing the needle
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] MethodExpression
vfs/virtual-filesystem.ts:195:19
   delete(path: string): void { this.checkPermission(path, true); const b = this.route(path); b.delete(path); this.record({ path, backend: b.kind, operation: 'delete', timestamp: now() }); }
   exists(path: string): boolean { try { this.checkPermission(path, false); return this.route(path).exists(path); } catch { return false; } }
   search(root: string, needle: string): VfsEntry[] {
-    const lower = needle.toLowerCase();
+    const lower = needle.toUpperCase();
     const matches: VfsEntry[] = [];
     const walk = (dir: string): void => {
killedBy: AH-VFS-001 Virtual Filesystem list / search / receipts search finds files containing the needle
statusReason: expected [] to deeply equal [ '/workspace/s/a.txt' ]

[Killed] BlockStatement
vfs/virtual-filesystem.ts:197:41
   search(root: string, needle: string): VfsEntry[] {
     const lower = needle.toLowerCase();
     const matches: VfsEntry[] = [];
-    const walk = (dir: string): void => {
-      let entries: VfsEntry[];
-      try { entries = this.list(dir); } catch { return; }
-      for (const e of entries) {
-        if (e.kind === 'dir') walk(e.path);
-        else { try { if (this.readText(e.path).toLowerCase().includes(lower)) matches.push(e); } catch { /* permission */ } }
-      }
-    };
+    const walk = (dir: string): void => {};
     walk(root);
     this.record({ path: root, backend: this.route(root).kind, operation: 'search', timestamp: now() });
killedBy: AH-VFS-001 Virtual Filesystem list / search / receipts search finds files containing the needle
statusReason: expected [] to deeply equal [ '/workspace/s/a.txt' ]

[Killed] BlockStatement
vfs/virtual-filesystem.ts:199:11
     const matches: VfsEntry[] = [];
     const walk = (dir: string): void => {
       let entries: VfsEntry[];
-      try { entries = this.list(dir); } catch { return; }
+      try {} catch { return; }
       for (const e of entries) {
         if (e.kind === 'dir') walk(e.path);
killedBy: AH-VFS-001 Virtual Filesystem list / search / receipts search finds files containing the needle
statusReason: entries is not iterable

[NoCoverage] BlockStatement
vfs/virtual-filesystem.ts:199:47
     const matches: VfsEntry[] = [];
     const walk = (dir: string): void => {
       let entries: VfsEntry[];
-      try { entries = this.list(dir); } catch { return; }
+      try { entries = this.list(dir); } catch {}
       for (const e of entries) {
         if (e.kind === 'dir') walk(e.path);

[Killed] BlockStatement
vfs/virtual-filesystem.ts:200:32
     const walk = (dir: string): void => {
       let entries: VfsEntry[];
       try { entries = this.list(dir); } catch { return; }
-      for (const e of entries) {
-        if (e.kind === 'dir') walk(e.path);
-        else { try { if (this.readText(e.path).toLowerCase().includes(lower)) matches.push(e); } catch { /* permission */ } }
-      }
+      for (const e of entries) {}
     };
     walk(root);
killedBy: AH-VFS-001 Virtual Filesystem list / search / receipts search finds files containing the needle
statusReason: expected [] to deeply equal [ '/workspace/s/a.txt' ]

[Killed] EqualityOperator
vfs/virtual-filesystem.ts:201:13
       let entries: VfsEntry[];
       try { entries = this.list(dir); } catch { return; }
       for (const e of entries) {
-        if (e.kind === 'dir') walk(e.path);
+        if (e.kind !== 'dir') walk(e.path);
         else { try { if (this.readText(e.path).toLowerCase().includes(lower)) matches.push(e); } catch { /* permission */ } }
       }
killedBy: AH-VFS-001 Virtual Filesystem list / search / receipts search finds files containing the needle
statusReason: expected [] to deeply equal [ '/workspace/s/a.txt' ]

[Killed] ConditionalExpression
vfs/virtual-filesystem.ts:201:13
       let entries: VfsEntry[];
       try { entries = this.list(dir); } catch { return; }
       for (const e of entries) {
-        if (e.kind === 'dir') walk(e.path);
+        if (true) walk(e.path);
         else { try { if (this.readText(e.path).toLowerCase().includes(lower)) matches.push(e); } catch { /* permission */ } }
       }
killedBy: AH-VFS-001 Virtual Filesystem list / search / receipts search finds files containing the needle
statusReason: expected [] to deeply equal [ '/workspace/s/a.txt' ]

[Killed] BlockStatement
vfs/virtual-filesystem.ts:202:20
       try { entries = this.list(dir); } catch { return; }
       for (const e of entries) {
         if (e.kind === 'dir') walk(e.path);
-        else { try { if (this.readText(e.path).toLowerCase().includes(lower)) matches.push(e); } catch { /* permission */ } }
+        else { try {} catch { /* permission */ } }
       }
     };
killedBy: AH-VFS-001 Virtual Filesystem list / search / receipts search finds files containing the needle
statusReason: expected [] to deeply equal [ '/workspace/s/a.txt' ]

[Killed] ConditionalExpression
vfs/virtual-filesystem.ts:202:26
       try { entries = this.list(dir); } catch { return; }
       for (const e of entries) {
         if (e.kind === 'dir') walk(e.path);
-        else { try { if (this.readText(e.path).toLowerCase().includes(lower)) matches.push(e); } catch { /* permission */ } }
+        else { try { if (false) matches.push(e); } catch { /* permission */ } }
       }
     };
killedBy: AH-VFS-001 Virtual Filesystem list / search / receipts search finds files containing the needle
statusReason: expected [] to deeply equal [ '/workspace/s/a.txt' ]

[Killed] BlockStatement
vfs/virtual-filesystem.ts:211:65
   }
 
   /** Atomically commit a RunPlan overlay into its commit target backend. */
-  commitOverlay(overlay: OverlayBackend, target: Backend): void {
-    if (overlay.isCommitted() || overlay.isDiscarded()) throw new VfsError('overlay already finalized');
-    for (const [path, buf] of overlay.stagedEntries()) {
-      this.checkPermission(path, true);
-      target.write(path, buf);
-      this.record({ path, backend: target.kind, operation: 'commit', bytes: buf.length, sha256: sha(buf), timestamp: now() });
-    }
-    for (const path of overlay.stagedTombstones()) {
-      this.checkPermission(path, true);
-      try { target.delete(path); } catch { /* best effort */ }
-      this.record({ path, backend: target.kind, operation: 'commit', timestamp: now() });
-    }
-    overlay.markCommitted();
-  }
+  commitOverlay(overlay: OverlayBackend, target: Backend): void {}
   discardOverlay(overlay: OverlayBackend): void {
     overlay.markDiscarded();
killedBy: AH-VFS-001 Virtual Filesystem OverlayBackend transactional commit/discard stages writes then commits atomically to LocalBackend
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
vfs/virtual-filesystem.ts:212:9
 
   /** Atomically commit a RunPlan overlay into its commit target backend. */
   commitOverlay(overlay: OverlayBackend, target: Backend): void {
-    if (overlay.isCommitted() || overlay.isDiscarded()) throw new VfsError('overlay already finalized');
+    if (false) throw new VfsError('overlay already finalized');
     for (const [path, buf] of overlay.stagedEntries()) {
       this.checkPermission(path, true);
killedBy: AH-VFS-001 Virtual Filesystem OverlayBackend transactional commit/discard cannot commit a finalized overlay
statusReason: expected function to throw an error, but it didn't

[Killed] LogicalOperator
vfs/virtual-filesystem.ts:212:9
 
   /** Atomically commit a RunPlan overlay into its commit target backend. */
   commitOverlay(overlay: OverlayBackend, target: Backend): void {
-    if (overlay.isCommitted() || overlay.isDiscarded()) throw new VfsError('overlay already finalized');
+    if (overlay.isCommitted() && overlay.isDiscarded()) throw new VfsError('overlay already finalized');
     for (const [path, buf] of overlay.stagedEntries()) {
       this.checkPermission(path, true);
killedBy: AH-VFS-001 Virtual Filesystem OverlayBackend transactional commit/discard cannot commit a finalized overlay
statusReason: expected function to throw an error, but it didn't

[Killed] BlockStatement
vfs/virtual-filesystem.ts:213:56
   /** Atomically commit a RunPlan overlay into its commit target backend. */
   commitOverlay(overlay: OverlayBackend, target: Backend): void {
     if (overlay.isCommitted() || overlay.isDiscarded()) throw new VfsError('overlay already finalized');
-    for (const [path, buf] of overlay.stagedEntries()) {
-      this.checkPermission(path, true);
-      target.write(path, buf);
-      this.record({ path, backend: target.kind, operation: 'commit', bytes: buf.length, sha256: sha(buf), timestamp: now() });
-    }
+    for (const [path, buf] of overlay.stagedEntries()) {}
     for (const path of overlay.stagedTombstones()) {
       this.checkPermission(path, true);
killedBy: AH-VFS-001 Virtual Filesystem OverlayBackend transactional commit/discard stages writes then commits atomically to LocalBackend
statusReason: not found

[Survived] BooleanLiteral
vfs/virtual-filesystem.ts:214:34
   commitOverlay(overlay: OverlayBackend, target: Backend): void {
     if (overlay.isCommitted() || overlay.isDiscarded()) throw new VfsError('overlay already finalized');
     for (const [path, buf] of overlay.stagedEntries()) {
-      this.checkPermission(path, true);
+      this.checkPermission(path, false);
       target.write(path, buf);
       this.record({ path, backend: target.kind, operation: 'commit', bytes: buf.length, sha256: sha(buf), timestamp: now() });

[Survived] ObjectLiteral
vfs/virtual-filesystem.ts:216:19
     for (const [path, buf] of overlay.stagedEntries()) {
       this.checkPermission(path, true);
       target.write(path, buf);
-      this.record({ path, backend: target.kind, operation: 'commit', bytes: buf.length, sha256: sha(buf), timestamp: now() });
+      this.record({});
     }
     for (const path of overlay.stagedTombstones()) {

[Survived] StringLiteral
vfs/virtual-filesystem.ts:216:60
     for (const [path, buf] of overlay.stagedEntries()) {
       this.checkPermission(path, true);
       target.write(path, buf);
-      this.record({ path, backend: target.kind, operation: 'commit', bytes: buf.length, sha256: sha(buf), timestamp: now() });
+      this.record({ path, backend: target.kind, operation: "", bytes: buf.length, sha256: sha(buf), timestamp: now() });
     }
     for (const path of overlay.stagedTombstones()) {

[NoCoverage] BlockStatement
vfs/virtual-filesystem.ts:218:52
       target.write(path, buf);
       this.record({ path, backend: target.kind, operation: 'commit', bytes: buf.length, sha256: sha(buf), timestamp: now() });
     }
-    for (const path of overlay.stagedTombstones()) {
-      this.checkPermission(path, true);
-      try { target.delete(path); } catch { /* best effort */ }
-      this.record({ path, backend: target.kind, operation: 'commit', timestamp: now() });
-    }
+    for (const path of overlay.stagedTombstones()) {}
     overlay.markCommitted();
   }

[NoCoverage] BooleanLiteral
vfs/virtual-filesystem.ts:219:34
       this.record({ path, backend: target.kind, operation: 'commit', bytes: buf.length, sha256: sha(buf), timestamp: now() });
     }
     for (const path of overlay.stagedTombstones()) {
-      this.checkPermission(path, true);
+      this.checkPermission(path, false);
       try { target.delete(path); } catch { /* best effort */ }
       this.record({ path, backend: target.kind, operation: 'commit', timestamp: now() });

[NoCoverage] BlockStatement
vfs/virtual-filesystem.ts:220:11
     }
     for (const path of overlay.stagedTombstones()) {
       this.checkPermission(path, true);
-      try { target.delete(path); } catch { /* best effort */ }
+      try {} catch { /* best effort */ }
       this.record({ path, backend: target.kind, operation: 'commit', timestamp: now() });
     }

[Killed] BlockStatement
vfs/virtual-filesystem.ts:225:49
     }
     overlay.markCommitted();
   }
-  discardOverlay(overlay: OverlayBackend): void {
-    overlay.markDiscarded();
-    this.record({ path: overlay.prefix, backend: 'overlay', operation: 'discard', timestamp: now() });
-  }
+  discardOverlay(overlay: OverlayBackend): void {}
 }
 
killedBy: AH-VFS-001 Virtual Filesystem OverlayBackend transactional commit/discard discards partial edits so nothing reaches the target
statusReason: expected false to be true // Object.is equality

[Survived] StringLiteral
vfs/virtual-filesystem.ts:227:50
   }
   discardOverlay(overlay: OverlayBackend): void {
     overlay.markDiscarded();
-    this.record({ path: overlay.prefix, backend: 'overlay', operation: 'discard', timestamp: now() });
+    this.record({ path: overlay.prefix, backend: "", operation: 'discard', timestamp: now() });
   }
 }
