[NoCoverage] BlockStatement
gateway/model-gateway.ts:61:32
 }
 
 export class GatewayTimeoutError extends Error {
-  constructor(message: string) {
-    super(message);
-    this.name = 'GatewayTimeoutError';
-    Object.setPrototypeOf(this, GatewayTimeoutError.prototype);
-  }
+  constructor(message: string) {}
 }
 

[NoCoverage] BlockStatement
gateway/model-gateway.ts:70:72
 
 export class GatewayRetryExhaustedError extends Error {
   readonly lastError: ProviderError | null;
-  constructor(message: string, lastError: ProviderError | null = null) {
-    super(message);
-    this.name = 'GatewayRetryExhaustedError';
-    this.lastError = lastError;
-    Object.setPrototypeOf(this, GatewayRetryExhaustedError.prototype);
-  }
+  constructor(message: string, lastError: ProviderError | null = null) {}
 }
 

[NoCoverage] StringLiteral
gateway/model-gateway.ts:72:17
   readonly lastError: ProviderError | null;
   constructor(message: string, lastError: ProviderError | null = null) {
     super(message);
-    this.name = 'GatewayRetryExhaustedError';
+    this.name = "";
     this.lastError = lastError;
     Object.setPrototypeOf(this, GatewayRetryExhaustedError.prototype);

[Killed] ArrayDeclaration
gateway/model-gateway.ts:85:52
 export class ModelGateway {
   private readonly adapters = new Map<ProviderAdapter['provider_type'], ProviderAdapter>();
   private readonly profiles = new Map<string, ModelProfile>();
-  private readonly telemetry: GatewayTelemetry[] = [];
+  private readonly telemetry: GatewayTelemetry[] = ["Stryker was here"];
   private readonly totalUsage = new Map<string, Usage>();
 
killedBy: precision: ModelGateway exact values telemetry has exact fields, no content
statusReason: expected 2 to be 1 // Object.is equality

[Killed] BlockStatement
gateway/model-gateway.ts:88:48
   private readonly telemetry: GatewayTelemetry[] = [];
   private readonly totalUsage = new Map<string, Usage>();
 
-  constructor(initial: ProviderAdapter[] = []) {
-    for (const a of initial) this.register(a);
-  }
+  constructor(initial: ProviderAdapter[] = []) {}
 
   register(adapter: ProviderAdapter): void {
killedBy: precision: ModelGateway exact values exact usage values from provider
statusReason: No provider registered for type: scripted_test

[NoCoverage] ArrayDeclaration
gateway/model-gateway.ts:88:44
   private readonly telemetry: GatewayTelemetry[] = [];
   private readonly totalUsage = new Map<string, Usage>();
 
-  constructor(initial: ProviderAdapter[] = []) {
+  constructor(initial: ProviderAdapter[] = ["Stryker was here"]) {
     for (const a of initial) this.register(a);
   }

[Killed] BlockStatement
gateway/model-gateway.ts:92:44
     for (const a of initial) this.register(a);
   }
 
-  register(adapter: ProviderAdapter): void {
-    this.adapters.set(adapter.provider_type, adapter);
-  }
+  register(adapter: ProviderAdapter): void {}
 
   registerProfile(profile: ModelProfile): void {
killedBy: precision: ModelGateway exact values exact usage values from provider
statusReason: No provider registered for type: scripted_test

[Killed] BlockStatement
gateway/model-gateway.ts:96:48
     this.adapters.set(adapter.provider_type, adapter);
   }
 
-  registerProfile(profile: ModelProfile): void {
-    this.profiles.set(profile.model_id, profile);
-  }
+  registerProfile(profile: ModelProfile): void {}
 
   resolve(type: ProviderAdapter['provider_type']): ProviderAdapter {
killedBy: coverage: ModelGateway methods registerProfile and getProfile
statusReason: expected undefined to be defined

[Killed] BlockStatement
gateway/model-gateway.ts:100:68
     this.profiles.set(profile.model_id, profile);
   }
 
-  resolve(type: ProviderAdapter['provider_type']): ProviderAdapter {
-    const a = this.adapters.get(type);
-    if (!a) throw new Error(`No provider registered for type: ${type}`);
-    return a;
-  }
+  resolve(type: ProviderAdapter['provider_type']): ProviderAdapter {}
 
   getProfile(modelId: string): ModelProfile | undefined {
killedBy: precision: ModelGateway exact values exact usage values from provider
statusReason: Cannot read properties of undefined (reading 'mapError')

[Killed] ConditionalExpression
gateway/model-gateway.ts:102:9
 
   resolve(type: ProviderAdapter['provider_type']): ProviderAdapter {
     const a = this.adapters.get(type);
-    if (!a) throw new Error(`No provider registered for type: ${type}`);
+    if (false) throw new Error(`No provider registered for type: ${type}`);
     return a;
   }
killedBy: mutation-kill: ModelGateway all paths resolve throws for unregistered
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
gateway/model-gateway.ts:102:9
 
   resolve(type: ProviderAdapter['provider_type']): ProviderAdapter {
     const a = this.adapters.get(type);
-    if (!a) throw new Error(`No provider registered for type: ${type}`);
+    if (a) throw new Error(`No provider registered for type: ${type}`);
     return a;
   }
killedBy: precision: ModelGateway exact values exact usage values from provider
statusReason: No provider registered for type: scripted_test

[Killed] BlockStatement
gateway/model-gateway.ts:106:57
     return a;
   }
 
-  getProfile(modelId: string): ModelProfile | undefined {
-    return this.profiles.get(modelId);
-  }
+  getProfile(modelId: string): ModelProfile | undefined {}
 
   complete(
killedBy: coverage: ModelGateway methods registerProfile and getProfile
statusReason: expected undefined to be defined

[Survived] LogicalOperator
gateway/model-gateway.ts:117:23
   ): GatewayCallResult {
     const adapter = this.resolve(type);
     const startTime = Date.now();
-    const timeoutMs = opts.timeoutMs ?? 30000;
+    const timeoutMs = opts.timeoutMs && 30000;
     const maxRetries = opts.retries ?? 2;
     const retryDelayMs = opts.retryDelayMs ?? 1000;

[Killed] LogicalOperator
gateway/model-gateway.ts:118:24
     const adapter = this.resolve(type);
     const startTime = Date.now();
     const timeoutMs = opts.timeoutMs ?? 30000;
-    const maxRetries = opts.retries ?? 2;
+    const maxRetries = opts.retries && 2;
     const retryDelayMs = opts.retryDelayMs ?? 1000;
 
killedBy: precision: ModelGateway exact values exact usage values from provider
statusReason: Provider scripted_test failed after NaN attempts

[Survived] LogicalOperator
gateway/model-gateway.ts:119:26
     const startTime = Date.now();
     const timeoutMs = opts.timeoutMs ?? 30000;
     const maxRetries = opts.retries ?? 2;
-    const retryDelayMs = opts.retryDelayMs ?? 1000;
+    const retryDelayMs = opts.retryDelayMs && 1000;
 
     let lastError: ProviderError | null = null;

[Killed] BooleanLiteral
gateway/model-gateway.ts:122:19
     const retryDelayMs = opts.retryDelayMs ?? 1000;
 
     let lastError: ProviderError | null = null;
-    let retried = false;
+    let retried = true;
 
     for (let attempt = 0; attempt <= maxRetries; attempt++) {
killedBy: precision: ModelGateway exact values exact usage values from provider
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
gateway/model-gateway.ts:125:11
     let retried = false;
 
     for (let attempt = 0; attempt <= maxRetries; attempt++) {
-      if (opts.signal?.aborted) {
+      if (true) {
         throw new GatewayTimeoutError('Request aborted');
       }
killedBy: precision: ModelGateway exact values exact usage values from provider
statusReason: Request aborted

[Killed] OptionalChaining
gateway/model-gateway.ts:125:11
     let retried = false;
 
     for (let attempt = 0; attempt <= maxRetries; attempt++) {
-      if (opts.signal?.aborted) {
+      if (opts.signal.aborted) {
         throw new GatewayTimeoutError('Request aborted');
       }
killedBy: AH-GATEWAY-001: ModelGateway completes a request and returns response with usage
statusReason: Cannot read properties of undefined (reading 'aborted')

[Killed] ArithmeticOperator
gateway/model-gateway.ts:130:23
       }
 
       // Check timeout
-      const elapsed = Date.now() - startTime;
+      const elapsed = Date.now() + startTime;
       if (elapsed > timeoutMs) {
         throw new GatewayTimeoutError(`Request timed out after ${timeoutMs}ms`);
killedBy: precision: ModelGateway exact values exact usage values from provider
statusReason: Request timed out after 30000ms

[Killed] EqualityOperator
gateway/model-gateway.ts:131:11
 
       // Check timeout
       const elapsed = Date.now() - startTime;
-      if (elapsed > timeoutMs) {
+      if (elapsed <= timeoutMs) {
         throw new GatewayTimeoutError(`Request timed out after ${timeoutMs}ms`);
       }
killedBy: AH-GATEWAY-001: ModelGateway completes a request and returns response with usage
statusReason: Request timed out after 30000ms

[Killed] ConditionalExpression
gateway/model-gateway.ts:131:11
 
       // Check timeout
       const elapsed = Date.now() - startTime;
-      if (elapsed > timeoutMs) {
+      if (true) {
         throw new GatewayTimeoutError(`Request timed out after ${timeoutMs}ms`);
       }
killedBy: AH-GATEWAY-001: ModelGateway completes a request and returns response with usage
statusReason: Request timed out after 30000ms

[Killed] ConditionalExpression
gateway/model-gateway.ts:138:13
       try {
         let response: ParsedResponse;
 
-        if (adapter instanceof ScriptedTestProvider) {
+        if (false) {
           response = adapter.resolve(req);
         } else {
killedBy: AH-GATEWAY-001: ModelGateway completes a request and returns response with usage
statusReason: Provider scripted_test failed after 1 attempts: parseResponse: content must be a string

[Killed] BlockStatement
gateway/model-gateway.ts:138:54
       try {
         let response: ParsedResponse;
 
-        if (adapter instanceof ScriptedTestProvider) {
-          response = adapter.resolve(req);
-        } else {
+        if (adapter instanceof ScriptedTestProvider) {} else {
           // For non-scripted providers, use normalizeRequest + parseResponse
           const raw = adapter.normalizeRequest(req);
killedBy: AH-GATEWAY-001: ModelGateway completes a request and returns response with usage
statusReason: Provider scripted_test failed after 1 attempts: Cannot read properties of undefined (reading 'usage')

[NoCoverage] BlockStatement
gateway/model-gateway.ts:140:16
 
         if (adapter instanceof ScriptedTestProvider) {
           response = adapter.resolve(req);
-        } else {
-          // For non-scripted providers, use normalizeRequest + parseResponse
-          const raw = adapter.normalizeRequest(req);
-          response = adapter.parseResponse(raw);
-        }
+        } else {}
 
         const usage = adapter.meterUsage(response);

[Survived] ArithmeticOperator
gateway/model-gateway.ts:147:28
         }
 
         const usage = adapter.meterUsage(response);
-        const durationMs = Date.now() - startTime;
+        const durationMs = Date.now() + startTime;
 
         // Record telemetry (no content, only metadata)

[Survived] LogicalOperator
gateway/model-gateway.ts:150:53
         const durationMs = Date.now() - startTime;
 
         // Record telemetry (no content, only metadata)
-        this.recordTelemetry(adapter.provider_type, response.model ?? 'unknown', usage, durationMs, retried);
+        this.recordTelemetry(adapter.provider_type, response.model && 'unknown', usage, durationMs, retried);
 
         // Track total usage

[Killed] ObjectLiteral
gateway/model-gateway.ts:155:16
         // Track total usage
         this.addUsage(adapter.provider_type, usage);
 
-        return {
-          response,
-          usage,
-          provider_type: adapter.provider_type,
-          model: response.model ?? 'unknown',
-          durationMs,
-          retried,
-        };
+        return {};
       } catch (err) {
         const providerError = adapter.mapError(err);
killedBy: AH-GATEWAY-001: ModelGateway completes a request and returns response with usage
statusReason: Cannot read properties of undefined (reading 'content')

[Killed] LogicalOperator
gateway/model-gateway.ts:159:18
           response,
           usage,
           provider_type: adapter.provider_type,
-          model: response.model ?? 'unknown',
+          model: response.model && 'unknown',
           durationMs,
           retried,
killedBy: precision: ModelGateway exact values exact usage values from provider
statusReason: expected 'unknown' to be 'scripted-test' // Object.is equality

[Survived] StringLiteral
gateway/model-gateway.ts:159:36
           response,
           usage,
           provider_type: adapter.provider_type,
-          model: response.model ?? 'unknown',
+          model: response.model ?? "",
           durationMs,
           retried,

[Killed] BlockStatement
gateway/model-gateway.ts:163:21
           durationMs,
           retried,
         };
-      } catch (err) {
-        const providerError = adapter.mapError(err);
-        lastError = providerError;
-
-        if (!providerError.retryable || attempt === maxRetries) {
-          if (err instanceof ScriptedResponseExhaustedError || err instanceof ScriptedResponseMissingError) {
-            throw err;
-          }
-          throw new GatewayRetryExhaustedError(
-            `Provider ${type} failed after ${attempt + 1} attempts: ${providerError.detail}`,
-            lastError,
-          );
-        }
-
-        retried = true;
-        // Simple backoff
-        const delay = retryDelayMs * Math.pow(2, attempt);
-        // Synchronous sleep for deterministic testing (very short)
-        if (delay > 0 && delay < 100) {
-          const start = Date.now();
-          while (Date.now() - start < delay) { /* busy wait */ }
-        }
-      }
+      } catch (err) {}
     }
 
killedBy: AH-GATEWAY-001: ModelGateway throws ScriptedResponseExhaustedError when queue runs out
statusReason: expected error to be instance of ScriptedResponseExhaustedError

[Killed] ConditionalExpression
gateway/model-gateway.ts:167:13
         const providerError = adapter.mapError(err);
         lastError = providerError;
 
-        if (!providerError.retryable || attempt === maxRetries) {
+        if (false) {
           if (err instanceof ScriptedResponseExhaustedError || err instanceof ScriptedResponseMissingError) {
             throw err;
killedBy: AH-GATEWAY-001: ModelGateway throws ScriptedResponseExhaustedError when queue runs out
statusReason: expected error to be instance of ScriptedResponseExhaustedError

[Killed] BlockStatement
gateway/model-gateway.ts:167:65
         const providerError = adapter.mapError(err);
         lastError = providerError;
 
-        if (!providerError.retryable || attempt === maxRetries) {
-          if (err instanceof ScriptedResponseExhaustedError || err instanceof ScriptedResponseMissingError) {
-            throw err;
-          }
-          throw new GatewayRetryExhaustedError(
-            `Provider ${type} failed after ${attempt + 1} attempts: ${providerError.detail}`,
-            lastError,
-          );
-        }
+        if (!providerError.retryable || attempt === maxRetries) {}
 
         retried = true;
killedBy: AH-GATEWAY-001: ModelGateway throws ScriptedResponseExhaustedError when queue runs out
statusReason: expected error to be instance of ScriptedResponseExhaustedError

[Killed] BlockStatement
gateway/model-gateway.ts:168:109
         lastError = providerError;
 
         if (!providerError.retryable || attempt === maxRetries) {
-          if (err instanceof ScriptedResponseExhaustedError || err instanceof ScriptedResponseMissingError) {
-            throw err;
-          }
+          if (err instanceof ScriptedResponseExhaustedError || err instanceof ScriptedResponseMissingError) {}
           throw new GatewayRetryExhaustedError(
             `Provider ${type} failed after ${attempt + 1} attempts: ${providerError.detail}`,
killedBy: AH-GATEWAY-001: ModelGateway throws ScriptedResponseExhaustedError when queue runs out
statusReason: expected error to be instance of ScriptedResponseExhaustedError

[Killed] ConditionalExpression
gateway/model-gateway.ts:168:15
         lastError = providerError;
 
         if (!providerError.retryable || attempt === maxRetries) {
-          if (err instanceof ScriptedResponseExhaustedError || err instanceof ScriptedResponseMissingError) {
+          if (false) {
             throw err;
           }
killedBy: AH-GATEWAY-001: ModelGateway throws ScriptedResponseExhaustedError when queue runs out
statusReason: expected error to be instance of ScriptedResponseExhaustedError

[NoCoverage] ArithmeticOperator
gateway/model-gateway.ts:172:46
             throw err;
           }
           throw new GatewayRetryExhaustedError(
-            `Provider ${type} failed after ${attempt + 1} attempts: ${providerError.detail}`,
+            `Provider ${type} failed after ${attempt - 1} attempts: ${providerError.detail}`,
             lastError,
           );

[NoCoverage] StringLiteral
gateway/model-gateway.ts:172:13
             throw err;
           }
           throw new GatewayRetryExhaustedError(
-            `Provider ${type} failed after ${attempt + 1} attempts: ${providerError.detail}`,
+            ``,
             lastError,
           );

[NoCoverage] BooleanLiteral
gateway/model-gateway.ts:177:19
           );
         }
 
-        retried = true;
+        retried = false;
         // Simple backoff
         const delay = retryDelayMs * Math.pow(2, attempt);

[NoCoverage] ArithmeticOperator
gateway/model-gateway.ts:179:23
 
         retried = true;
         // Simple backoff
-        const delay = retryDelayMs * Math.pow(2, attempt);
+        const delay = retryDelayMs / Math.pow(2, attempt);
         // Synchronous sleep for deterministic testing (very short)
         if (delay > 0 && delay < 100) {

[NoCoverage] EqualityOperator
gateway/model-gateway.ts:181:26
         // Simple backoff
         const delay = retryDelayMs * Math.pow(2, attempt);
         // Synchronous sleep for deterministic testing (very short)
-        if (delay > 0 && delay < 100) {
+        if (delay > 0 && delay <= 100) {
           const start = Date.now();
           while (Date.now() - start < delay) { /* busy wait */ }

[NoCoverage] EqualityOperator
gateway/model-gateway.ts:181:26
         // Simple backoff
         const delay = retryDelayMs * Math.pow(2, attempt);
         // Synchronous sleep for deterministic testing (very short)
-        if (delay > 0 && delay < 100) {
+        if (delay > 0 && delay >= 100) {
           const start = Date.now();
           while (Date.now() - start < delay) { /* busy wait */ }

[NoCoverage] EqualityOperator
gateway/model-gateway.ts:183:18
         // Synchronous sleep for deterministic testing (very short)
         if (delay > 0 && delay < 100) {
           const start = Date.now();
-          while (Date.now() - start < delay) { /* busy wait */ }
+          while (Date.now() - start <= delay) { /* busy wait */ }
         }
       }

[NoCoverage] EqualityOperator
gateway/model-gateway.ts:183:18
         // Synchronous sleep for deterministic testing (very short)
         if (delay > 0 && delay < 100) {
           const start = Date.now();
-          while (Date.now() - start < delay) { /* busy wait */ }
+          while (Date.now() - start >= delay) { /* busy wait */ }
         }
       }

[NoCoverage] ArithmeticOperator
gateway/model-gateway.ts:189:40
     }
 
     throw new GatewayRetryExhaustedError(
-      `Provider ${type} failed after ${maxRetries + 1} attempts`,
+      `Provider ${type} failed after ${maxRetries - 1} attempts`,
       lastError,
     );

[Killed] BlockStatement
gateway/model-gateway.ts:194:69
     );
   }
 
-  checkHealth(type: ProviderAdapter['provider_type']): HealthStatus {
-    return this.resolve(type).checkHealth();
-  }
+  checkHealth(type: ProviderAdapter['provider_type']): HealthStatus {}
 
   list(): ProviderAdapter['provider_type'][] {
killedBy: AH-GATEWAY-001: ModelGateway checks provider health
statusReason: expected undefined to be 'healthy' // Object.is equality

[Killed] BlockStatement
gateway/model-gateway.ts:198:46
     return this.resolve(type).checkHealth();
   }
 
-  list(): ProviderAdapter['provider_type'][] {
-    return [...this.adapters.keys()];
-  }
+  list(): ProviderAdapter['provider_type'][] {}
 
   getTelemetry(): readonly GatewayTelemetry[] {
killedBy: AH-GATEWAY-001: ModelGateway registers a provider
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] ArrayDeclaration
gateway/model-gateway.ts:199:12
   }
 
   list(): ProviderAdapter['provider_type'][] {
-    return [...this.adapters.keys()];
+    return [];
   }
 
killedBy: AH-GATEWAY-001: ModelGateway registers a provider
statusReason: expected [] to include 'scripted_test'

[Killed] BlockStatement
gateway/model-gateway.ts:202:47
     return [...this.adapters.keys()];
   }
 
-  getTelemetry(): readonly GatewayTelemetry[] {
-    return [...this.telemetry];
-  }
+  getTelemetry(): readonly GatewayTelemetry[] {}
 
   getTotalUsage(type: ProviderAdapter['provider_type']): Usage {
killedBy: mutation-kill: ModelGateway all paths getTelemetry records provider_type
statusReason: Cannot read properties of undefined (reading '0')

[Killed] ArrayDeclaration
gateway/model-gateway.ts:203:12
   }
 
   getTelemetry(): readonly GatewayTelemetry[] {
-    return [...this.telemetry];
+    return [];
   }
 
killedBy: AH-GATEWAY-001: ModelGateway records telemetry with metadata only (no content)
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
gateway/model-gateway.ts:206:64
     return [...this.telemetry];
   }
 
-  getTotalUsage(type: ProviderAdapter['provider_type']): Usage {
-    return this.totalUsage.get(type) ?? { input_tokens: 0, output_tokens: 0 };
-  }
+  getTotalUsage(type: ProviderAdapter['provider_type']): Usage {}
 
   private recordTelemetry(
killedBy: AH-GATEWAY-001: ModelGateway tracks total usage across calls
statusReason: Cannot read properties of undefined (reading 'input_tokens')

[Killed] LogicalOperator
gateway/model-gateway.ts:207:12
   }
 
   getTotalUsage(type: ProviderAdapter['provider_type']): Usage {
-    return this.totalUsage.get(type) ?? { input_tokens: 0, output_tokens: 0 };
+    return this.totalUsage.get(type) && {
+  input_tokens: 0,
+  output_tokens: 0
+};
   }
 
killedBy: precision: ModelGateway exact values total usage accumulates exactly
statusReason: expected +0 to be 30 // Object.is equality

[Killed] BlockStatement
gateway/model-gateway.ts:217:11
     durationMs: number,
     retried: boolean,
     errorKind?: string,
-  ): void {
-    this.telemetry.push({
-      provider_type: providerType,
-      model,
-      input_tokens: usage.input_tokens,
-      output_tokens: usage.output_tokens,
-      duration_ms: durationMs,
-      retried,
-      error_kind: errorKind,
-      timestamp: new Date().toISOString(),
-    });
-  }
+  ): void {}
 
   private addUsage(type: string, usage: Usage): void {
killedBy: mutation-kill: ModelGateway all paths getTelemetry records provider_type
statusReason: Cannot read properties of undefined (reading 'provider_type')

[Killed] BlockStatement
gateway/model-gateway.ts:230:54
     });
   }
 
-  private addUsage(type: string, usage: Usage): void {
-    const current = this.totalUsage.get(type) ?? { input_tokens: 0, output_tokens: 0 };
-    this.totalUsage.set(type, {
-      input_tokens: current.input_tokens + usage.input_tokens,
-      output_tokens: current.output_tokens + usage.output_tokens,
-    });
-  }
+  private addUsage(type: string, usage: Usage): void {}
 }
 
killedBy: precision: ModelGateway exact values total usage accumulates exactly
statusReason: expected +0 to be 30 // Object.is equality

[Killed] LogicalOperator
gateway/model-gateway.ts:231:21
   }
 
   private addUsage(type: string, usage: Usage): void {
-    const current = this.totalUsage.get(type) ?? { input_tokens: 0, output_tokens: 0 };
+    const current = this.totalUsage.get(type) && {
+  input_tokens: 0,
+  output_tokens: 0
+};
     this.totalUsage.set(type, {
       input_tokens: current.input_tokens + usage.input_tokens,
killedBy: AH-GATEWAY-001: ModelGateway completes a request and returns response with usage
statusReason: Provider scripted_test failed after 1 attempts: Cannot read properties of undefined (reading 'input_tokens')

[Killed] ArithmeticOperator
gateway/model-gateway.ts:233:21
   private addUsage(type: string, usage: Usage): void {
     const current = this.totalUsage.get(type) ?? { input_tokens: 0, output_tokens: 0 };
     this.totalUsage.set(type, {
-      input_tokens: current.input_tokens + usage.input_tokens,
+      input_tokens: current.input_tokens - usage.input_tokens,
       output_tokens: current.output_tokens + usage.output_tokens,
     });
killedBy: precision: ModelGateway exact values total usage accumulates exactly
statusReason: expected -30 to be 30 // Object.is equality

[Killed] ArithmeticOperator
gateway/model-gateway.ts:234:22
     const current = this.totalUsage.get(type) ?? { input_tokens: 0, output_tokens: 0 };
     this.totalUsage.set(type, {
       input_tokens: current.input_tokens + usage.input_tokens,
-      output_tokens: current.output_tokens + usage.output_tokens,
+      output_tokens: current.output_tokens - usage.output_tokens,
     });
   }
killedBy: AH-GATEWAY-001: ModelGateway tracks total usage across calls
statusReason: expected -15 to be 15 // Object.is equality
