[Killed] BlockStatement
gateway/scripted-provider.ts:98:89
 
 /** Thrown when the scripted response queue runs out. Prevents silent passes. */
 export class ScriptedResponseExhaustedError extends Error {
-  constructor(message = 'Scripted response queue exhausted: no more responses queued.') {
-    super(message);
-    this.name = 'ScriptedResponseExhaustedError';
-    Object.setPrototypeOf(this, ScriptedResponseExhaustedError.prototype);
-  }
+  constructor(message = 'Scripted response queue exhausted: no more responses queued.') {}
 }
 
killedBy: precision: one more kill ScriptedTestProvider resolve throws exhausted when no queue and no map
statusReason: expected error to be instance of ScriptedResponseExhaustedError

[Survived] StringLiteral
gateway/scripted-provider.ts:98:25
 
 /** Thrown when the scripted response queue runs out. Prevents silent passes. */
 export class ScriptedResponseExhaustedError extends Error {
-  constructor(message = 'Scripted response queue exhausted: no more responses queued.') {
+  constructor(message = "") {
     super(message);
     this.name = 'ScriptedResponseExhaustedError';

[Survived] StringLiteral
gateway/scripted-provider.ts:100:17
 export class ScriptedResponseExhaustedError extends Error {
   constructor(message = 'Scripted response queue exhausted: no more responses queued.') {
     super(message);
-    this.name = 'ScriptedResponseExhaustedError';
+    this.name = "";
     Object.setPrototypeOf(this, ScriptedResponseExhaustedError.prototype);
   }

[Killed] BlockStatement
gateway/scripted-provider.ts:108:28
 /** Thrown when a map lookup misses (no scripted response for that input hash). */
 export class ScriptedResponseMissingError extends Error {
   readonly key: string;
-  constructor(key: string) {
-    super(`Scripted response missing for input hash ${key}`);
-    this.name = 'ScriptedResponseMissingError';
-    this.key = key;
-    Object.setPrototypeOf(this, ScriptedResponseMissingError.prototype);
-  }
+  constructor(key: string) {}
 }
 
killedBy: precision: one more kill ScriptedTestProvider resolve uses map mode when queue empty but map has entries
statusReason: expected error to be instance of ScriptedResponseMissingError

[Survived] StringLiteral
gateway/scripted-provider.ts:109:11
 export class ScriptedResponseMissingError extends Error {
   readonly key: string;
   constructor(key: string) {
-    super(`Scripted response missing for input hash ${key}`);
+    super(``);
     this.name = 'ScriptedResponseMissingError';
     this.key = key;

[Survived] BlockStatement
gateway/scripted-provider.ts:116:52
   }
 }
 
-function hashMessages(messages: Message[]): string {
-  // Deterministic canonical JSON: stable key order, no whitespace.
-  const canonical = JSON.stringify(messages, Object.keys(messages[0] ?? {}).sort());
-  return createHash('sha256').update(canonical).digest('hex');
-}
+function hashMessages(messages: Message[]): string {}
 
 function defaultUsage(res: ParsedResponse): Usage {

[Survived] LogicalOperator
gateway/scripted-provider.ts:118:58
 
 function hashMessages(messages: Message[]): string {
   // Deterministic canonical JSON: stable key order, no whitespace.
-  const canonical = JSON.stringify(messages, Object.keys(messages[0] ?? {}).sort());
+  const canonical = JSON.stringify(messages, Object.keys(messages[0] && {}).sort());
   return createHash('sha256').update(canonical).digest('hex');
 }

[Survived] MethodExpression
gateway/scripted-provider.ts:118:46
 
 function hashMessages(messages: Message[]): string {
   // Deterministic canonical JSON: stable key order, no whitespace.
-  const canonical = JSON.stringify(messages, Object.keys(messages[0] ?? {}).sort());
+  const canonical = JSON.stringify(messages, Object.keys(messages[0] ?? {}));
   return createHash('sha256').update(canonical).digest('hex');
 }

[Killed] BlockStatement
gateway/scripted-provider.ts:122:51
   return createHash('sha256').update(canonical).digest('hex');
 }
 
-function defaultUsage(res: ParsedResponse): Usage {
-  const out = res.usage ?? { input_tokens: 0, output_tokens: 0 };
-  // If output tokens unset, estimate from content length so metering is non-zero.
-  if (out.output_tokens === 0 && res.content) {
-    return { input_tokens: out.input_tokens, output_tokens: Math.ceil(res.content.length / 4) };
-  }
-  return out;
-}
+function defaultUsage(res: ParsedResponse): Usage {}
 
 export interface ScriptedTestProviderOptions {
killedBy: precision: ModelGateway exact values exact usage values from provider
statusReason: Provider scripted_test failed after 1 attempts: Cannot read properties of undefined (reading 'input_tokens')

[Killed] LogicalOperator
gateway/scripted-provider.ts:123:15
 }
 
 function defaultUsage(res: ParsedResponse): Usage {
-  const out = res.usage ?? { input_tokens: 0, output_tokens: 0 };
+  const out = res.usage && {
+  input_tokens: 0,
+  output_tokens: 0
+};
   // If output tokens unset, estimate from content length so metering is non-zero.
   if (out.output_tokens === 0 && res.content) {
killedBy: coverage: gateway/scripted-provider branches meterUsage returns existing usage when non-zero
statusReason: expected 2 to be 10 // Object.is equality

[Killed] LogicalOperator
gateway/scripted-provider.ts:125:7
 function defaultUsage(res: ParsedResponse): Usage {
   const out = res.usage ?? { input_tokens: 0, output_tokens: 0 };
   // If output tokens unset, estimate from content length so metering is non-zero.
-  if (out.output_tokens === 0 && res.content) {
+  if (out.output_tokens === 0 || res.content) {
     return { input_tokens: out.input_tokens, output_tokens: Math.ceil(res.content.length / 4) };
   }
killedBy: precision: ModelGateway exact values exact usage values from provider
statusReason: expected 2 to be 17 // Object.is equality

[Killed] EqualityOperator
gateway/scripted-provider.ts:125:7
 function defaultUsage(res: ParsedResponse): Usage {
   const out = res.usage ?? { input_tokens: 0, output_tokens: 0 };
   // If output tokens unset, estimate from content length so metering is non-zero.
-  if (out.output_tokens === 0 && res.content) {
+  if (out.output_tokens !== 0 && res.content) {
     return { input_tokens: out.input_tokens, output_tokens: Math.ceil(res.content.length / 4) };
   }
killedBy: mutation-kill: scripted-provider all paths defaultUsage estimates from content length
statusReason: expected 0 to be greater than 0

[Survived] ArithmeticOperator
gateway/scripted-provider.ts:126:71
   const out = res.usage ?? { input_tokens: 0, output_tokens: 0 };
   // If output tokens unset, estimate from content length so metering is non-zero.
   if (out.output_tokens === 0 && res.content) {
-    return { input_tokens: out.input_tokens, output_tokens: Math.ceil(res.content.length / 4) };
+    return { input_tokens: out.input_tokens, output_tokens: Math.ceil(res.content.length * 4) };
   }
   return out;

[Killed] ObjectLiteral
gateway/scripted-provider.ts:126:12
   const out = res.usage ?? { input_tokens: 0, output_tokens: 0 };
   // If output tokens unset, estimate from content length so metering is non-zero.
   if (out.output_tokens === 0 && res.content) {
-    return { input_tokens: out.input_tokens, output_tokens: Math.ceil(res.content.length / 4) };
+    return {};
   }
   return out;
killedBy: coverage: gateway/scripted-provider branches meterUsage estimates output tokens when zero
statusReason: actual value must be number or bigint, received "undefined"

[Killed] ArrayDeclaration
gateway/scripted-provider.ts:155:44
   private readonly health: HealthStatus;
   private readonly dataPolicy: DataPolicyResult;
   private readonly model: string;
-  private readonly calls: CallMetadata[] = [];
+  private readonly calls: CallMetadata[] = ["Stryker was here"];
   private callIndex = 0;
 
killedBy: coverage: gateway/scripted-provider branches callLog returns copy of calls
statusReason: expected 2 to be 1 // Object.is equality

[Killed] BlockStatement
gateway/scripted-provider.ts:158:55
   private readonly calls: CallMetadata[] = [];
   private callIndex = 0;
 
-  constructor(opts: ScriptedTestProviderOptions = {}) {
-    this.queue = opts.queue ? [...opts.queue] : [];
-    this.map = opts.map ? { ...opts.map } : {};
-    this.health = opts.health ?? 'healthy';
-    this.dataPolicy = opts.dataPolicy ?? { allowed: true };
-    this.model = opts.model ?? 'scripted-test';
-  }
+  constructor(opts: ScriptedTestProviderOptions = {}) {}
 
   /** Resolve the scripted response for a request (the core dispatch). */
killedBy: AH-GATEWAY-001: ModelGateway completes a request and returns response with usage
statusReason: Provider scripted_test failed after 1 attempts: Cannot convert undefined or null to object

[Killed] ArrayDeclaration
gateway/scripted-provider.ts:159:49
   private callIndex = 0;
 
   constructor(opts: ScriptedTestProviderOptions = {}) {
-    this.queue = opts.queue ? [...opts.queue] : [];
+    this.queue = opts.queue ? [...opts.queue] : ["Stryker was here"];
     this.map = opts.map ? { ...opts.map } : {};
     this.health = opts.health ?? 'healthy';
killedBy: precision: one more kill ScriptedTestProvider resolve uses map mode when queue empty but map has entries
statusReason: expected function to throw an error, but it didn't

[Killed] LogicalOperator
gateway/scripted-provider.ts:161:19
   constructor(opts: ScriptedTestProviderOptions = {}) {
     this.queue = opts.queue ? [...opts.queue] : [];
     this.map = opts.map ? { ...opts.map } : {};
-    this.health = opts.health ?? 'healthy';
+    this.health = opts.health && 'healthy';
     this.dataPolicy = opts.dataPolicy ?? { allowed: true };
     this.model = opts.model ?? 'scripted-test';
killedBy: coverage: ModelGateway methods checkHealth returns provider health
statusReason: expected 'healthy' to be 'degraded' // Object.is equality

[Killed] LogicalOperator
gateway/scripted-provider.ts:162:23
     this.queue = opts.queue ? [...opts.queue] : [];
     this.map = opts.map ? { ...opts.map } : {};
     this.health = opts.health ?? 'healthy';
-    this.dataPolicy = opts.dataPolicy ?? { allowed: true };
+    this.dataPolicy = opts.dataPolicy && {
+  allowed: true
+};
     this.model = opts.model ?? 'scripted-test';
   }
killedBy: coverage: gateway/scripted-provider branches validateDataPolicy returns configured policy
statusReason: expected true to be false // Object.is equality

[Survived] BooleanLiteral
gateway/scripted-provider.ts:162:53
     this.queue = opts.queue ? [...opts.queue] : [];
     this.map = opts.map ? { ...opts.map } : {};
     this.health = opts.health ?? 'healthy';
-    this.dataPolicy = opts.dataPolicy ?? { allowed: true };
+    this.dataPolicy = opts.dataPolicy ?? { allowed: false };
     this.model = opts.model ?? 'scripted-test';
   }

[Survived] LogicalOperator
gateway/scripted-provider.ts:163:18
     this.map = opts.map ? { ...opts.map } : {};
     this.health = opts.health ?? 'healthy';
     this.dataPolicy = opts.dataPolicy ?? { allowed: true };
-    this.model = opts.model ?? 'scripted-test';
+    this.model = opts.model && 'scripted-test';
   }
 

[Survived] StringLiteral
gateway/scripted-provider.ts:163:32
     this.map = opts.map ? { ...opts.map } : {};
     this.health = opts.health ?? 'healthy';
     this.dataPolicy = opts.dataPolicy ?? { allowed: true };
-    this.model = opts.model ?? 'scripted-test';
+    this.model = opts.model ?? "";
   }
 

[Killed] ConditionalExpression
gateway/scripted-provider.ts:172:9
     let response: ParsedResponse | undefined;
     let mode: 'queue' | 'map';
 
-    if (Object.keys(this.map).length > 0 && key in this.map) {
+    if (true) {
       response = this.map[key];
       mode = 'map';
killedBy: coverage: gateway/scripted-provider branches streamEvents yields text_delta then message_stop
statusReason: Cannot read properties of undefined (reading 'usage')

[Killed] LogicalOperator
gateway/scripted-provider.ts:172:9
     let response: ParsedResponse | undefined;
     let mode: 'queue' | 'map';
 
-    if (Object.keys(this.map).length > 0 && key in this.map) {
+    if (Object.keys(this.map).length > 0 || key in this.map) {
       response = this.map[key];
       mode = 'map';
killedBy: mutation-kill: scripted-provider all paths resolve throws ScriptedResponseMissing for unknown hash
statusReason: expected error to be instance of ScriptedResponseMissingError

[NoCoverage] StringLiteral
gateway/scripted-provider.ts:174:14
 
     if (Object.keys(this.map).length > 0 && key in this.map) {
       response = this.map[key];
-      mode = 'map';
+      mode = "";
     } else if (this.queue.length > 0) {
       response = this.queue.shift();

[Killed] BlockStatement
gateway/scripted-provider.ts:175:39
     if (Object.keys(this.map).length > 0 && key in this.map) {
       response = this.map[key];
       mode = 'map';
-    } else if (this.queue.length > 0) {
-      response = this.queue.shift();
-      mode = 'queue';
-    } else if (Object.keys(this.map).length > 0) {
+    } else if (this.queue.length > 0) {} else if (Object.keys(this.map).length > 0) {
       throw new ScriptedResponseMissingError(key);
     } else {
killedBy: AH-GATEWAY-001: ModelGateway completes a request and returns response with usage
statusReason: Provider scripted_test failed after 1 attempts: Cannot read properties of undefined (reading 'usage')

[Killed] EqualityOperator
gateway/scripted-provider.ts:175:16
     if (Object.keys(this.map).length > 0 && key in this.map) {
       response = this.map[key];
       mode = 'map';
-    } else if (this.queue.length > 0) {
+    } else if (this.queue.length <= 0) {
       response = this.queue.shift();
       mode = 'queue';
killedBy: AH-GATEWAY-001: ModelGateway completes a request and returns response with usage
statusReason: Scripted response queue exhausted: no more responses queued.

[Killed] StringLiteral
gateway/scripted-provider.ts:177:14
       mode = 'map';
     } else if (this.queue.length > 0) {
       response = this.queue.shift();
-      mode = 'queue';
+      mode = "";
     } else if (Object.keys(this.map).length > 0) {
       throw new ScriptedResponseMissingError(key);
killedBy: precision: one more kill ScriptedTestProvider resolve prefers map over queue
statusReason: expected '' to be 'queue' // Object.is equality

[Killed] EqualityOperator
gateway/scripted-provider.ts:178:16
     } else if (this.queue.length > 0) {
       response = this.queue.shift();
       mode = 'queue';
-    } else if (Object.keys(this.map).length > 0) {
+    } else if (Object.keys(this.map).length >= 0) {
       throw new ScriptedResponseMissingError(key);
     } else {
killedBy: AH-GATEWAY-001: ModelGateway throws ScriptedResponseExhaustedError when queue runs out
statusReason: expected error to be instance of ScriptedResponseExhaustedError

[Killed] ConditionalExpression
gateway/scripted-provider.ts:178:16
     } else if (this.queue.length > 0) {
       response = this.queue.shift();
       mode = 'queue';
-    } else if (Object.keys(this.map).length > 0) {
+    } else if (true) {
       throw new ScriptedResponseMissingError(key);
     } else {
killedBy: AH-GATEWAY-001: ModelGateway throws ScriptedResponseExhaustedError when queue runs out
statusReason: expected error to be instance of ScriptedResponseExhaustedError

[Killed] BlockStatement
gateway/scripted-provider.ts:180:12
       mode = 'queue';
     } else if (Object.keys(this.map).length > 0) {
       throw new ScriptedResponseMissingError(key);
-    } else {
-      throw new ScriptedResponseExhaustedError();
-    }
+    } else {}
 
     const usage = defaultUsage(response!);
killedBy: AH-GATEWAY-001: ModelGateway throws ScriptedResponseExhaustedError when queue runs out
statusReason: expected error to be instance of ScriptedResponseExhaustedError

[Survived] UpdateOperator
gateway/scripted-provider.ts:186:14
 
     const usage = defaultUsage(response!);
     const meta: CallMetadata = {
-      index: this.callIndex++,
+      index: this.callIndex--,
       timestamp: new Date().toISOString(),
       messages: req.messages,

[Killed] LogicalOperator
gateway/scripted-provider.ts:189:25
       index: this.callIndex++,
       timestamp: new Date().toISOString(),
       messages: req.messages,
-      tools_requested: (req.tools ?? []).map((t) => t.name),
+      tools_requested: (req.tools && []).map((t) => t.name),
       response: response!,
       usage,
killedBy: AH-GATEWAY-001: ModelGateway completes a request and returns response with usage
statusReason: Provider scripted_test failed after 1 attempts: Cannot read properties of undefined (reading 'map')

[Survived] ArrowFunction
gateway/scripted-provider.ts:189:46
       index: this.callIndex++,
       timestamp: new Date().toISOString(),
       messages: req.messages,
-      tools_requested: (req.tools ?? []).map((t) => t.name),
+      tools_requested: (req.tools ?? []).map(() => undefined),
       response: response!,
       usage,

[Killed] BlockStatement
gateway/scripted-provider.ts:198:51
     return response!;
   }
 
-  normalizeRequest(req: ProviderRequest): unknown {
-    return {
-      model: req.model ?? this.model,
-      messages: req.messages,
-      tools: req.tools ?? [],
-      temperature: req.temperature ?? 0,
-      max_tokens: req.max_tokens ?? null,
-    };
-  }
+  normalizeRequest(req: ProviderRequest): unknown {}
 
   parseResponse(raw: unknown): ParsedResponse {
killedBy: mutation-kill: scripted-provider all paths normalizeRequest with temperature and max_tokens
statusReason: Cannot convert undefined or null to object

[Killed] ObjectLiteral
gateway/scripted-provider.ts:199:12
   }
 
   normalizeRequest(req: ProviderRequest): unknown {
-    return {
-      model: req.model ?? this.model,
-      messages: req.messages,
-      tools: req.tools ?? [],
-      temperature: req.temperature ?? 0,
-      max_tokens: req.max_tokens ?? null,
-    };
+    return {};
   }
 
killedBy: mutation-kill: scripted-provider all paths normalizeRequest with temperature and max_tokens
statusReason: expected {} to have property "temperature" with value 0.5

[Survived] LogicalOperator
gateway/scripted-provider.ts:200:14
 
   normalizeRequest(req: ProviderRequest): unknown {
     return {
-      model: req.model ?? this.model,
+      model: req.model && this.model,
       messages: req.messages,
       tools: req.tools ?? [],

[Survived] LogicalOperator
gateway/scripted-provider.ts:202:14
     return {
       model: req.model ?? this.model,
       messages: req.messages,
-      tools: req.tools ?? [],
+      tools: req.tools && [],
       temperature: req.temperature ?? 0,
       max_tokens: req.max_tokens ?? null,

[Killed] LogicalOperator
gateway/scripted-provider.ts:203:20
       model: req.model ?? this.model,
       messages: req.messages,
       tools: req.tools ?? [],
-      temperature: req.temperature ?? 0,
+      temperature: req.temperature && 0,
       max_tokens: req.max_tokens ?? null,
     };
killedBy: mutation-kill: scripted-provider all paths normalizeRequest with temperature and max_tokens
statusReason: expected { model: 'test', messages: [], …(3) } to have property "temperature" with value 0.5

[Survived] LogicalOperator
gateway/scripted-provider.ts:204:19
       messages: req.messages,
       tools: req.tools ?? [],
       temperature: req.temperature ?? 0,
-      max_tokens: req.max_tokens ?? null,
+      max_tokens: req.max_tokens && null,
     };
   }

[Killed] BlockStatement
gateway/scripted-provider.ts:208:47
     };
   }
 
-  parseResponse(raw: unknown): ParsedResponse {
-    if (typeof raw !== 'object' || raw === null) {
-      throw new TypeError('parseResponse expects an object');
-    }
-    const r = raw as Partial<ParsedResponse>;
-    if (typeof r.content !== 'string') {
-      throw new TypeError('parseResponse: content must be a string');
-    }
-    return {
-      content: r.content,
-      tool_calls: r.tool_calls,
-      stop_reason: r.stop_reason ?? 'stop',
-      usage: r.usage,
-      model: r.model ?? this.model,
-    };
-  }
+  parseResponse(raw: unknown): ParsedResponse {}
 
   normalizeToolCall(raw: unknown): ToolCall {
killedBy: mutation-kill: scripted-provider all paths parseResponse with tool_calls
statusReason: Cannot read properties of undefined (reading 'stop_reason')

[Killed] EqualityOperator
gateway/scripted-provider.ts:209:9
   }
 
   parseResponse(raw: unknown): ParsedResponse {
-    if (typeof raw !== 'object' || raw === null) {
+    if (typeof raw === 'object' || raw === null) {
       throw new TypeError('parseResponse expects an object');
     }
killedBy: mutation-kill: scripted-provider all paths parseResponse with tool_calls
statusReason: parseResponse expects an object

[Killed] EqualityOperator
gateway/scripted-provider.ts:209:36
   }
 
   parseResponse(raw: unknown): ParsedResponse {
-    if (typeof raw !== 'object' || raw === null) {
+    if (typeof raw !== 'object' || raw !== null) {
       throw new TypeError('parseResponse expects an object');
     }
killedBy: mutation-kill: scripted-provider all paths parseResponse with tool_calls
statusReason: parseResponse expects an object

[Killed] EqualityOperator
gateway/scripted-provider.ts:213:9
       throw new TypeError('parseResponse expects an object');
     }
     const r = raw as Partial<ParsedResponse>;
-    if (typeof r.content !== 'string') {
+    if (typeof r.content === 'string') {
       throw new TypeError('parseResponse: content must be a string');
     }
killedBy: mutation-kill: scripted-provider all paths parseResponse with tool_calls
statusReason: parseResponse: content must be a string

[Killed] BlockStatement
gateway/scripted-provider.ts:213:40
       throw new TypeError('parseResponse expects an object');
     }
     const r = raw as Partial<ParsedResponse>;
-    if (typeof r.content !== 'string') {
-      throw new TypeError('parseResponse: content must be a string');
-    }
+    if (typeof r.content !== 'string') {}
     return {
       content: r.content,
killedBy: coverage: gateway/scripted-provider branches parseResponse throws for missing content
statusReason: expected function to throw an error, but it didn't

[Killed] ObjectLiteral
gateway/scripted-provider.ts:216:12
     if (typeof r.content !== 'string') {
       throw new TypeError('parseResponse: content must be a string');
     }
-    return {
-      content: r.content,
-      tool_calls: r.tool_calls,
-      stop_reason: r.stop_reason ?? 'stop',
-      usage: r.usage,
-      model: r.model ?? this.model,
-    };
+    return {};
   }
 
killedBy: mutation-kill: scripted-provider all paths parseResponse with tool_calls
statusReason: expected undefined to be 'tool_use' // Object.is equality

[Killed] LogicalOperator
gateway/scripted-provider.ts:219:20
     return {
       content: r.content,
       tool_calls: r.tool_calls,
-      stop_reason: r.stop_reason ?? 'stop',
+      stop_reason: r.stop_reason && 'stop',
       usage: r.usage,
       model: r.model ?? this.model,
killedBy: mutation-kill: scripted-provider all paths parseResponse with tool_calls
statusReason: expected 'stop' to be 'tool_use' // Object.is equality

[Survived] LogicalOperator
gateway/scripted-provider.ts:221:14
       tool_calls: r.tool_calls,
       stop_reason: r.stop_reason ?? 'stop',
       usage: r.usage,
-      model: r.model ?? this.model,
+      model: r.model && this.model,
     };
   }

[Killed] BlockStatement
gateway/scripted-provider.ts:225:45
     };
   }
 
-  normalizeToolCall(raw: unknown): ToolCall {
-    if (typeof raw !== 'object' || raw === null) {
-      throw new TypeError('normalizeToolCall expects an object');
-    }
-    const r = raw as Partial<ToolCall>;
-    if (typeof r.name !== 'string' || typeof r.id !== 'string') {
-      throw new TypeError('normalizeToolCall: id and name required');
-    }
-    return { id: r.id, name: r.name, arguments: r.arguments ?? {} };
-  }
+  normalizeToolCall(raw: unknown): ToolCall {}
 
   async *streamEvents(req: ProviderRequest): AsyncIterable<StreamEvent> {
killedBy: mutation-kill: scripted-provider all paths normalizeToolCall with arguments
statusReason: Cannot read properties of undefined (reading 'arguments')

[Killed] EqualityOperator
gateway/scripted-provider.ts:226:9
   }
 
   normalizeToolCall(raw: unknown): ToolCall {
-    if (typeof raw !== 'object' || raw === null) {
+    if (typeof raw === 'object' || raw === null) {
       throw new TypeError('normalizeToolCall expects an object');
     }
killedBy: mutation-kill: scripted-provider all paths normalizeToolCall with arguments
statusReason: normalizeToolCall expects an object

[Killed] EqualityOperator
gateway/scripted-provider.ts:226:36
   }
 
   normalizeToolCall(raw: unknown): ToolCall {
-    if (typeof raw !== 'object' || raw === null) {
+    if (typeof raw !== 'object' || raw !== null) {
       throw new TypeError('normalizeToolCall expects an object');
     }
killedBy: mutation-kill: scripted-provider all paths normalizeToolCall with arguments
statusReason: normalizeToolCall expects an object

[Killed] BlockStatement
gateway/scripted-provider.ts:230:65
       throw new TypeError('normalizeToolCall expects an object');
     }
     const r = raw as Partial<ToolCall>;
-    if (typeof r.name !== 'string' || typeof r.id !== 'string') {
-      throw new TypeError('normalizeToolCall: id and name required');
-    }
+    if (typeof r.name !== 'string' || typeof r.id !== 'string') {}
     return { id: r.id, name: r.name, arguments: r.arguments ?? {} };
   }
killedBy: coverage: gateway/scripted-provider branches normalizeToolCall throws for missing name
statusReason: expected function to throw an error, but it didn't

[Killed] LogicalOperator
gateway/scripted-provider.ts:230:9
       throw new TypeError('normalizeToolCall expects an object');
     }
     const r = raw as Partial<ToolCall>;
-    if (typeof r.name !== 'string' || typeof r.id !== 'string') {
+    if (typeof r.name !== 'string' && typeof r.id !== 'string') {
       throw new TypeError('normalizeToolCall: id and name required');
     }
killedBy: coverage: gateway/scripted-provider branches normalizeToolCall throws for missing name
statusReason: expected function to throw an error, but it didn't

[Survived] StringLiteral
gateway/scripted-provider.ts:231:27
     }
     const r = raw as Partial<ToolCall>;
     if (typeof r.name !== 'string' || typeof r.id !== 'string') {
-      throw new TypeError('normalizeToolCall: id and name required');
+      throw new TypeError("");
     }
     return { id: r.id, name: r.name, arguments: r.arguments ?? {} };

[Killed] LogicalOperator
gateway/scripted-provider.ts:233:49
     if (typeof r.name !== 'string' || typeof r.id !== 'string') {
       throw new TypeError('normalizeToolCall: id and name required');
     }
-    return { id: r.id, name: r.name, arguments: r.arguments ?? {} };
+    return { id: r.id, name: r.name, arguments: r.arguments && {} };
   }
 
killedBy: mutation-kill: scripted-provider all paths normalizeToolCall with arguments
statusReason: expected {} to deeply equal { key: 'val' }

[Killed] BlockStatement
gateway/scripted-provider.ts:236:73
     return { id: r.id, name: r.name, arguments: r.arguments ?? {} };
   }
 
-  async *streamEvents(req: ProviderRequest): AsyncIterable<StreamEvent> {
-    const res = this.resolve(req);
-    if (res.content) {
-      yield { type: 'text_delta', text: res.content };
-    }
-    for (const tc of res.tool_calls ?? []) {
-      yield { type: 'tool_call', tool_call: tc };
-    }
-    yield { type: 'message_stop', stop_reason: res.stop_reason ?? 'stop', usage: defaultUsage(res) };
-  }
+  async *streamEvents(req: ProviderRequest): AsyncIterable<StreamEvent> {}
 
   mapError(raw: unknown): ProviderError {
killedBy: coverage: gateway/scripted-provider branches streamEvents yields text_delta then message_stop
statusReason: expected 0 to be greater than or equal to 2

[Killed] BlockStatement
gateway/scripted-provider.ts:238:22
 
   async *streamEvents(req: ProviderRequest): AsyncIterable<StreamEvent> {
     const res = this.resolve(req);
-    if (res.content) {
-      yield { type: 'text_delta', text: res.content };
-    }
+    if (res.content) {}
     for (const tc of res.tool_calls ?? []) {
       yield { type: 'tool_call', tool_call: tc };
killedBy: coverage: gateway/scripted-provider branches streamEvents yields text_delta then message_stop
statusReason: expected 1 to be greater than or equal to 2

[Killed] ConditionalExpression
gateway/scripted-provider.ts:238:9
 
   async *streamEvents(req: ProviderRequest): AsyncIterable<StreamEvent> {
     const res = this.resolve(req);
-    if (res.content) {
+    if (false) {
       yield { type: 'text_delta', text: res.content };
     }
killedBy: coverage: gateway/scripted-provider branches streamEvents yields text_delta then message_stop
statusReason: expected 1 to be greater than or equal to 2

[Killed] StringLiteral
gateway/scripted-provider.ts:239:21
   async *streamEvents(req: ProviderRequest): AsyncIterable<StreamEvent> {
     const res = this.resolve(req);
     if (res.content) {
-      yield { type: 'text_delta', text: res.content };
+      yield { type: "", text: res.content };
     }
     for (const tc of res.tool_calls ?? []) {
killedBy: coverage: gateway/scripted-provider branches streamEvents yields text_delta then message_stop
statusReason: expected '' to be 'text_delta' // Object.is equality

[Killed] BlockStatement
gateway/scripted-provider.ts:241:44
     if (res.content) {
       yield { type: 'text_delta', text: res.content };
     }
-    for (const tc of res.tool_calls ?? []) {
-      yield { type: 'tool_call', tool_call: tc };
-    }
+    for (const tc of res.tool_calls ?? []) {}
     yield { type: 'message_stop', stop_reason: res.stop_reason ?? 'stop', usage: defaultUsage(res) };
   }
killedBy: coverage: gateway/scripted-provider branches streamEvents yields tool_call when present
statusReason: expected false to be true // Object.is equality
