[Killed] LogicalOperator
gateway/scripted-provider.ts:241:22
     if (res.content) {
       yield { type: 'text_delta', text: res.content };
     }
-    for (const tc of res.tool_calls ?? []) {
+    for (const tc of res.tool_calls && []) {
       yield { type: 'tool_call', tool_call: tc };
     }
killedBy: coverage: gateway/scripted-provider branches streamEvents yields text_delta then message_stop
statusReason: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] ObjectLiteral
gateway/scripted-provider.ts:242:13
       yield { type: 'text_delta', text: res.content };
     }
     for (const tc of res.tool_calls ?? []) {
-      yield { type: 'tool_call', tool_call: tc };
+      yield {};
     }
     yield { type: 'message_stop', stop_reason: res.stop_reason ?? 'stop', usage: defaultUsage(res) };
killedBy: coverage: gateway/scripted-provider branches streamEvents yields tool_call when present
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
gateway/scripted-provider.ts:242:21
       yield { type: 'text_delta', text: res.content };
     }
     for (const tc of res.tool_calls ?? []) {
-      yield { type: 'tool_call', tool_call: tc };
+      yield { type: "", tool_call: tc };
     }
     yield { type: 'message_stop', stop_reason: res.stop_reason ?? 'stop', usage: defaultUsage(res) };
killedBy: coverage: gateway/scripted-provider branches streamEvents yields tool_call when present
statusReason: expected false to be true // Object.is equality

[Survived] LogicalOperator
gateway/scripted-provider.ts:244:48
     for (const tc of res.tool_calls ?? []) {
       yield { type: 'tool_call', tool_call: tc };
     }
-    yield { type: 'message_stop', stop_reason: res.stop_reason ?? 'stop', usage: defaultUsage(res) };
+    yield { type: 'message_stop', stop_reason: res.stop_reason && 'stop', usage: defaultUsage(res) };
   }
 

[Killed] BlockStatement
gateway/scripted-provider.ts:247:41
     yield { type: 'message_stop', stop_reason: res.stop_reason ?? 'stop', usage: defaultUsage(res) };
   }
 
-  mapError(raw: unknown): ProviderError {
-    const msg = raw instanceof Error ? raw.message : String(raw);
-    if (raw instanceof ScriptedResponseExhaustedError || raw instanceof ScriptedResponseMissingError) {
-      return { kind: 'invalid_request', retryable: false, detail: msg };
-    }
-    const lower = msg.toLowerCase();
-    if (lower.includes('rate')) return { kind: 'rate_limited', retryable: true, detail: msg };
-    if (lower.includes('auth') || lower.includes('401') || lower.includes('key')) {
-      return { kind: 'auth', retryable: false, detail: msg };
-    }
-    if (lower.includes('timeout')) return { kind: 'timeout', retryable: true, detail: msg };
-    if (lower.includes('500') || lower.includes('server')) return { kind: 'server', retryable: true, detail: msg };
-    if (lower.includes('400') || lower.includes('invalid')) {
-      return { kind: 'invalid_request', retryable: false, detail: msg };
-    }
-    return { kind: 'unknown', retryable: false, detail: msg };
-  }
+  mapError(raw: unknown): ProviderError {}
 
   meterUsage(res: ParsedResponse): Usage {
killedBy: mutation-kill: scripted-provider all paths mapError classifies auth error
statusReason: Cannot read properties of undefined (reading 'kind')

[Killed] ConditionalExpression
gateway/scripted-provider.ts:249:9
 
   mapError(raw: unknown): ProviderError {
     const msg = raw instanceof Error ? raw.message : String(raw);
-    if (raw instanceof ScriptedResponseExhaustedError || raw instanceof ScriptedResponseMissingError) {
+    if (true) {
       return { kind: 'invalid_request', retryable: false, detail: msg };
     }
killedBy: mutation-kill: scripted-provider all paths mapError classifies auth error
statusReason: expected 'invalid_request' to be 'auth' // Object.is equality

[Killed] LogicalOperator
gateway/scripted-provider.ts:249:9
 
   mapError(raw: unknown): ProviderError {
     const msg = raw instanceof Error ? raw.message : String(raw);
-    if (raw instanceof ScriptedResponseExhaustedError || raw instanceof ScriptedResponseMissingError) {
+    if (raw instanceof ScriptedResponseExhaustedError && raw instanceof ScriptedResponseMissingError) {
       return { kind: 'invalid_request', retryable: false, detail: msg };
     }
killedBy: mutation-kill: scripted-provider all paths mapError classifies ScriptedResponseExhausted
statusReason: expected 'unknown' to be 'invalid_request' // Object.is equality

[Survived] BooleanLiteral
gateway/scripted-provider.ts:250:52
   mapError(raw: unknown): ProviderError {
     const msg = raw instanceof Error ? raw.message : String(raw);
     if (raw instanceof ScriptedResponseExhaustedError || raw instanceof ScriptedResponseMissingError) {
-      return { kind: 'invalid_request', retryable: false, detail: msg };
+      return { kind: 'invalid_request', retryable: true, detail: msg };
     }
     const lower = msg.toLowerCase();

[Killed] StringLiteral
gateway/scripted-provider.ts:250:22
   mapError(raw: unknown): ProviderError {
     const msg = raw instanceof Error ? raw.message : String(raw);
     if (raw instanceof ScriptedResponseExhaustedError || raw instanceof ScriptedResponseMissingError) {
-      return { kind: 'invalid_request', retryable: false, detail: msg };
+      return { kind: "", retryable: false, detail: msg };
     }
     const lower = msg.toLowerCase();
killedBy: mutation-kill: scripted-provider all paths mapError classifies ScriptedResponseExhausted
statusReason: expected '' to be 'invalid_request' // Object.is equality

[Killed] MethodExpression
gateway/scripted-provider.ts:252:19
     if (raw instanceof ScriptedResponseExhaustedError || raw instanceof ScriptedResponseMissingError) {
       return { kind: 'invalid_request', retryable: false, detail: msg };
     }
-    const lower = msg.toLowerCase();
+    const lower = msg.toUpperCase();
     if (lower.includes('rate')) return { kind: 'rate_limited', retryable: true, detail: msg };
     if (lower.includes('auth') || lower.includes('401') || lower.includes('key')) {
killedBy: mutation-kill: scripted-provider all paths mapError classifies timeout
statusReason: expected 'unknown' to be 'timeout' // Object.is equality

[Killed] ConditionalExpression
gateway/scripted-provider.ts:253:9
       return { kind: 'invalid_request', retryable: false, detail: msg };
     }
     const lower = msg.toLowerCase();
-    if (lower.includes('rate')) return { kind: 'rate_limited', retryable: true, detail: msg };
+    if (false) return { kind: 'rate_limited', retryable: true, detail: msg };
     if (lower.includes('auth') || lower.includes('401') || lower.includes('key')) {
       return { kind: 'auth', retryable: false, detail: msg };
killedBy: coverage: gateway/scripted-provider branches mapError classifies rate limited
statusReason: expected 'unknown' to be 'rate_limited' // Object.is equality

[Killed] ConditionalExpression
gateway/scripted-provider.ts:253:9
       return { kind: 'invalid_request', retryable: false, detail: msg };
     }
     const lower = msg.toLowerCase();
-    if (lower.includes('rate')) return { kind: 'rate_limited', retryable: true, detail: msg };
+    if (true) return { kind: 'rate_limited', retryable: true, detail: msg };
     if (lower.includes('auth') || lower.includes('401') || lower.includes('key')) {
       return { kind: 'auth', retryable: false, detail: msg };
killedBy: mutation-kill: scripted-provider all paths mapError classifies auth error
statusReason: expected 'rate_limited' to be 'auth' // Object.is equality

[Killed] LogicalOperator
gateway/scripted-provider.ts:254:9
     }
     const lower = msg.toLowerCase();
     if (lower.includes('rate')) return { kind: 'rate_limited', retryable: true, detail: msg };
-    if (lower.includes('auth') || lower.includes('401') || lower.includes('key')) {
+    if ((lower.includes('auth') || lower.includes('401')) && lower.includes('key')) {
       return { kind: 'auth', retryable: false, detail: msg };
     }
killedBy: mutation-kill: scripted-provider all paths mapError classifies auth error
statusReason: expected 'unknown' to be 'auth' // Object.is equality

[Killed] ConditionalExpression
gateway/scripted-provider.ts:254:9
     }
     const lower = msg.toLowerCase();
     if (lower.includes('rate')) return { kind: 'rate_limited', retryable: true, detail: msg };
-    if (lower.includes('auth') || lower.includes('401') || lower.includes('key')) {
+    if (false) {
       return { kind: 'auth', retryable: false, detail: msg };
     }
killedBy: mutation-kill: scripted-provider all paths mapError classifies auth error
statusReason: expected 'unknown' to be 'auth' // Object.is equality

[Survived] BooleanLiteral
gateway/scripted-provider.ts:255:41
     const lower = msg.toLowerCase();
     if (lower.includes('rate')) return { kind: 'rate_limited', retryable: true, detail: msg };
     if (lower.includes('auth') || lower.includes('401') || lower.includes('key')) {
-      return { kind: 'auth', retryable: false, detail: msg };
+      return { kind: 'auth', retryable: true, detail: msg };
     }
     if (lower.includes('timeout')) return { kind: 'timeout', retryable: true, detail: msg };

[Killed] ObjectLiteral
gateway/scripted-provider.ts:255:14
     const lower = msg.toLowerCase();
     if (lower.includes('rate')) return { kind: 'rate_limited', retryable: true, detail: msg };
     if (lower.includes('auth') || lower.includes('401') || lower.includes('key')) {
-      return { kind: 'auth', retryable: false, detail: msg };
+      return {};
     }
     if (lower.includes('timeout')) return { kind: 'timeout', retryable: true, detail: msg };
killedBy: mutation-kill: scripted-provider all paths mapError classifies auth error
statusReason: expected undefined to be 'auth' // Object.is equality

[Killed] ConditionalExpression
gateway/scripted-provider.ts:257:9
     if (lower.includes('auth') || lower.includes('401') || lower.includes('key')) {
       return { kind: 'auth', retryable: false, detail: msg };
     }
-    if (lower.includes('timeout')) return { kind: 'timeout', retryable: true, detail: msg };
+    if (false) return { kind: 'timeout', retryable: true, detail: msg };
     if (lower.includes('500') || lower.includes('server')) return { kind: 'server', retryable: true, detail: msg };
     if (lower.includes('400') || lower.includes('invalid')) {
killedBy: mutation-kill: scripted-provider all paths mapError classifies timeout
statusReason: expected 'unknown' to be 'timeout' // Object.is equality

[Killed] ConditionalExpression
gateway/scripted-provider.ts:257:9
     if (lower.includes('auth') || lower.includes('401') || lower.includes('key')) {
       return { kind: 'auth', retryable: false, detail: msg };
     }
-    if (lower.includes('timeout')) return { kind: 'timeout', retryable: true, detail: msg };
+    if (true) return { kind: 'timeout', retryable: true, detail: msg };
     if (lower.includes('500') || lower.includes('server')) return { kind: 'server', retryable: true, detail: msg };
     if (lower.includes('400') || lower.includes('invalid')) {
killedBy: coverage: gateway/scripted-provider branches mapError classifies server error
statusReason: expected 'timeout' to be 'server' // Object.is equality

[Killed] ConditionalExpression
gateway/scripted-provider.ts:258:9
       return { kind: 'auth', retryable: false, detail: msg };
     }
     if (lower.includes('timeout')) return { kind: 'timeout', retryable: true, detail: msg };
-    if (lower.includes('500') || lower.includes('server')) return { kind: 'server', retryable: true, detail: msg };
+    if (false) return { kind: 'server', retryable: true, detail: msg };
     if (lower.includes('400') || lower.includes('invalid')) {
       return { kind: 'invalid_request', retryable: false, detail: msg };
killedBy: coverage: gateway/scripted-provider branches mapError classifies server error
statusReason: expected 'unknown' to be 'server' // Object.is equality

[Killed] ConditionalExpression
gateway/scripted-provider.ts:258:9
       return { kind: 'auth', retryable: false, detail: msg };
     }
     if (lower.includes('timeout')) return { kind: 'timeout', retryable: true, detail: msg };
-    if (lower.includes('500') || lower.includes('server')) return { kind: 'server', retryable: true, detail: msg };
+    if (true) return { kind: 'server', retryable: true, detail: msg };
     if (lower.includes('400') || lower.includes('invalid')) {
       return { kind: 'invalid_request', retryable: false, detail: msg };
killedBy: coverage: gateway/scripted-provider branches mapError classifies invalid request
statusReason: expected 'server' to be 'invalid_request' // Object.is equality

[Killed] BlockStatement
gateway/scripted-provider.ts:259:61
     }
     if (lower.includes('timeout')) return { kind: 'timeout', retryable: true, detail: msg };
     if (lower.includes('500') || lower.includes('server')) return { kind: 'server', retryable: true, detail: msg };
-    if (lower.includes('400') || lower.includes('invalid')) {
-      return { kind: 'invalid_request', retryable: false, detail: msg };
-    }
+    if (lower.includes('400') || lower.includes('invalid')) {}
     return { kind: 'unknown', retryable: false, detail: msg };
   }
killedBy: coverage: gateway/scripted-provider branches mapError classifies invalid request
statusReason: expected 'unknown' to be 'invalid_request' // Object.is equality

[Killed] ConditionalExpression
gateway/scripted-provider.ts:259:9
     }
     if (lower.includes('timeout')) return { kind: 'timeout', retryable: true, detail: msg };
     if (lower.includes('500') || lower.includes('server')) return { kind: 'server', retryable: true, detail: msg };
-    if (lower.includes('400') || lower.includes('invalid')) {
+    if (false) {
       return { kind: 'invalid_request', retryable: false, detail: msg };
     }
killedBy: coverage: gateway/scripted-provider branches mapError classifies invalid request
statusReason: expected 'unknown' to be 'invalid_request' // Object.is equality

[Survived] BooleanLiteral
gateway/scripted-provider.ts:260:52
     if (lower.includes('timeout')) return { kind: 'timeout', retryable: true, detail: msg };
     if (lower.includes('500') || lower.includes('server')) return { kind: 'server', retryable: true, detail: msg };
     if (lower.includes('400') || lower.includes('invalid')) {
-      return { kind: 'invalid_request', retryable: false, detail: msg };
+      return { kind: 'invalid_request', retryable: true, detail: msg };
     }
     return { kind: 'unknown', retryable: false, detail: msg };

[Killed] ObjectLiteral
gateway/scripted-provider.ts:260:14
     if (lower.includes('timeout')) return { kind: 'timeout', retryable: true, detail: msg };
     if (lower.includes('500') || lower.includes('server')) return { kind: 'server', retryable: true, detail: msg };
     if (lower.includes('400') || lower.includes('invalid')) {
-      return { kind: 'invalid_request', retryable: false, detail: msg };
+      return {};
     }
     return { kind: 'unknown', retryable: false, detail: msg };
killedBy: coverage: gateway/scripted-provider branches mapError classifies invalid request
statusReason: expected undefined to be 'invalid_request' // Object.is equality

[Survived] BooleanLiteral
gateway/scripted-provider.ts:262:42
     if (lower.includes('400') || lower.includes('invalid')) {
       return { kind: 'invalid_request', retryable: false, detail: msg };
     }
-    return { kind: 'unknown', retryable: false, detail: msg };
+    return { kind: 'unknown', retryable: true, detail: msg };
   }
 

[Killed] ObjectLiteral
gateway/scripted-provider.ts:262:12
     if (lower.includes('400') || lower.includes('invalid')) {
       return { kind: 'invalid_request', retryable: false, detail: msg };
     }
-    return { kind: 'unknown', retryable: false, detail: msg };
+    return {};
   }
 
killedBy: coverage: gateway/scripted-provider branches mapError classifies unknown error
statusReason: expected undefined to be 'unknown' // Object.is equality

[Killed] BlockStatement
gateway/scripted-provider.ts:265:42
     return { kind: 'unknown', retryable: false, detail: msg };
   }
 
-  meterUsage(res: ParsedResponse): Usage {
-    return defaultUsage(res);
-  }
+  meterUsage(res: ParsedResponse): Usage {}
 
   checkHealth(): HealthStatus {
killedBy: precision: ModelGateway exact values exact usage values from provider
statusReason: Provider scripted_test failed after 1 attempts: Cannot read properties of undefined (reading 'input_tokens')

[Killed] BlockStatement
gateway/scripted-provider.ts:269:31
     return defaultUsage(res);
   }
 
-  checkHealth(): HealthStatus {
-    // Always healthy without network -- by design.
-    return this.health;
-  }
+  checkHealth(): HealthStatus {}
 
   validateDataPolicy(_req: ProviderRequest): DataPolicyResult {
killedBy: coverage: ModelGateway methods checkHealth returns provider health
statusReason: expected undefined to be 'degraded' // Object.is equality

[Killed] BlockStatement
gateway/scripted-provider.ts:274:63
     return this.health;
   }
 
-  validateDataPolicy(_req: ProviderRequest): DataPolicyResult {
-    // Scripted provider never transmits data; policy trivially satisfied.
-    return this.dataPolicy;
-  }
+  validateDataPolicy(_req: ProviderRequest): DataPolicyResult {}
 
   get callLog(): readonly CallMetadata[] {
killedBy: coverage: gateway/scripted-provider branches validateDataPolicy returns configured policy
statusReason: Cannot read properties of undefined (reading 'allowed')

[Killed] BlockStatement
gateway/scripted-provider.ts:279:42
     return this.dataPolicy;
   }
 
-  get callLog(): readonly CallMetadata[] {
-    return [...this.calls];
-  }
+  get callLog(): readonly CallMetadata[] {}
 
   get callCount(): number {
killedBy: mutation-kill: scripted-provider all paths defaultUsage estimates from content length
statusReason: Cannot read properties of undefined (reading '0')

[Killed] BlockStatement
gateway/scripted-provider.ts:283:27
     return [...this.calls];
   }
 
-  get callCount(): number {
-    return this.calls.length;
-  }
+  get callCount(): number {}
 
   get remainingQueueLength(): number {
killedBy: coverage: gateway/scripted-provider branches callLog returns copy of calls
statusReason: expected undefined to be 1 // Object.is equality

[Killed] BlockStatement
gateway/scripted-provider.ts:287:38
     return this.calls.length;
   }
 
-  get remainingQueueLength(): number {
-    return this.queue.length;
-  }
+  get remainingQueueLength(): number {}
 }
 
killedBy: coverage: gateway/scripted-provider branches remainingQueueLength decrements
statusReason: expected undefined to be 2 // Object.is equality

[NoCoverage] BlockStatement
gateway/scripted-provider.ts:313:90
     return a;
   }
 
-  complete(type: ProviderAdapter['provider_type'], req: ProviderRequest): ParsedResponse {
-    const adapter = this.resolve(type);
-    if (adapter instanceof ScriptedTestProvider) {
-      return adapter.resolve(req);
-    }
-    throw new Error('ModelGateway.complete only supports scripted_test providers in Phase 1');
-  }
+  complete(type: ProviderAdapter['provider_type'], req: ProviderRequest): ParsedResponse {}
 
   list(): ProviderAdapter['provider_type'][] {

[NoCoverage] BlockStatement
gateway/scripted-provider.ts:315:50
 
   complete(type: ProviderAdapter['provider_type'], req: ProviderRequest): ParsedResponse {
     const adapter = this.resolve(type);
-    if (adapter instanceof ScriptedTestProvider) {
-      return adapter.resolve(req);
-    }
+    if (adapter instanceof ScriptedTestProvider) {}
     throw new Error('ModelGateway.complete only supports scripted_test providers in Phase 1');
   }

[NoCoverage] ConditionalExpression
gateway/scripted-provider.ts:315:9
 
   complete(type: ProviderAdapter['provider_type'], req: ProviderRequest): ParsedResponse {
     const adapter = this.resolve(type);
-    if (adapter instanceof ScriptedTestProvider) {
+    if (true) {
       return adapter.resolve(req);
     }
