[Killed] StringLiteral
tools/tool-registry.ts:71:11
 }
 
 const REQUIRED_FIELDS: (keyof ToolSpec)[] = [
-  'name', 'summary', 'tags', 'version', 'domains',
+  'name', "", 'tags', 'version', 'domains',
   'implementation_status', 'input_schema_ref', 'output_schema_ref',
   'effect_model', 'risk_feature_extractor', 'preconditions',
killedBy: AH-TOOLS-001: register all nine in ToolRegistry all nine tools register successfully
statusReason: ToolSpec missing required field:

[Killed] StringLiteral
tools/tool-registry.ts:71:30
 }
 
 const REQUIRED_FIELDS: (keyof ToolSpec)[] = [
-  'name', 'summary', 'tags', 'version', 'domains',
+  'name', 'summary', 'tags', "", 'domains',
   'implementation_status', 'input_schema_ref', 'output_schema_ref',
   'effect_model', 'risk_feature_extractor', 'preconditions',
killedBy: AH-TOOLS-001: register all nine in ToolRegistry all nine tools register successfully
statusReason: ToolSpec missing required field:

[Killed] StringLiteral
tools/tool-registry.ts:72:3
 
 const REQUIRED_FIELDS: (keyof ToolSpec)[] = [
   'name', 'summary', 'tags', 'version', 'domains',
-  'implementation_status', 'input_schema_ref', 'output_schema_ref',
+  "", 'input_schema_ref', 'output_schema_ref',
   'effect_model', 'risk_feature_extractor', 'preconditions',
   'postconditions', 'timeout_policy', 'cancellation_policy',
killedBy: AH-TOOL-REGISTRY-001: registration registers a valid tool spec
statusReason: ToolSpec missing required field:

[Killed] StringLiteral
tools/tool-registry.ts:73:19
 const REQUIRED_FIELDS: (keyof ToolSpec)[] = [
   'name', 'summary', 'tags', 'version', 'domains',
   'implementation_status', 'input_schema_ref', 'output_schema_ref',
-  'effect_model', 'risk_feature_extractor', 'preconditions',
+  'effect_model', "", 'preconditions',
   'postconditions', 'timeout_policy', 'cancellation_policy',
   'retry_policy', 'idempotency_policy', 'sandbox_policy',
killedBy: AH-TOOLS-001: register all nine in ToolRegistry all nine tools register successfully
statusReason: ToolSpec missing required field:

[Killed] StringLiteral
tools/tool-registry.ts:75:3
   'implementation_status', 'input_schema_ref', 'output_schema_ref',
   'effect_model', 'risk_feature_extractor', 'preconditions',
   'postconditions', 'timeout_policy', 'cancellation_policy',
-  'retry_policy', 'idempotency_policy', 'sandbox_policy',
+  "", 'idempotency_policy', 'sandbox_policy',
   'network_policy', 'credential_requirements', 'data_egress_policy',
   'receipt_schema_ref', 'verification_adapter', 'maturity',
killedBy: AH-TOOL-REGISTRY-001: registration registers a valid tool spec
statusReason: ToolSpec missing required field:

[Killed] StringLiteral
tools/tool-registry.ts:75:19
   'implementation_status', 'input_schema_ref', 'output_schema_ref',
   'effect_model', 'risk_feature_extractor', 'preconditions',
   'postconditions', 'timeout_policy', 'cancellation_policy',
-  'retry_policy', 'idempotency_policy', 'sandbox_policy',
+  'retry_policy', "", 'sandbox_policy',
   'network_policy', 'credential_requirements', 'data_egress_policy',
   'receipt_schema_ref', 'verification_adapter', 'maturity',
killedBy: AH-TOOL-REGISTRY-001: registration registers a valid tool spec
statusReason: ToolSpec missing required field:

[Killed] StringLiteral
tools/tool-registry.ts:80:42
   'receipt_schema_ref', 'verification_adapter', 'maturity',
 ];
 
-const VALID_MATURITY = ['draft', 'mock', 'sandbox_verified', 'provider_sandbox_verified', 'production_certified'];
+const VALID_MATURITY = ['draft', 'mock', "", 'provider_sandbox_verified', 'production_certified'];
 const VALID_STATUS = ['interface_only', 'stub', 'mock', 'partial', 'implemented', 'verified', 'production_certified'];
 
killedBy: AH-TOOLS-001: register all nine in ToolRegistry all nine tools register successfully
statusReason: ToolSpec maturity 'sandbox_verified' is not valid

[Survived] StringLiteral
tools/tool-registry.ts:80:25
   'receipt_schema_ref', 'verification_adapter', 'maturity',
 ];
 
-const VALID_MATURITY = ['draft', 'mock', 'sandbox_verified', 'provider_sandbox_verified', 'production_certified'];
+const VALID_MATURITY = ["", 'mock', 'sandbox_verified', 'provider_sandbox_verified', 'production_certified'];
 const VALID_STATUS = ['interface_only', 'stub', 'mock', 'partial', 'implemented', 'verified', 'production_certified'];
 

[Survived] StringLiteral
tools/tool-registry.ts:81:49
 ];
 
 const VALID_MATURITY = ['draft', 'mock', 'sandbox_verified', 'provider_sandbox_verified', 'production_certified'];
-const VALID_STATUS = ['interface_only', 'stub', 'mock', 'partial', 'implemented', 'verified', 'production_certified'];
+const VALID_STATUS = ['interface_only', 'stub', "", 'partial', 'implemented', 'verified', 'production_certified'];
 
 // ---------------------------------------------------------------------------

[Killed] BlockStatement
tools/tool-registry.ts:88:32
 // ---------------------------------------------------------------------------
 
 export class ToolValidationError extends Error {
-  constructor(message: string) {
-    super(message);
-    this.name = 'ToolValidationError';
-    Object.setPrototypeOf(this, ToolValidationError.prototype);
-  }
+  constructor(message: string) {}
 }
 
killedBy: AH-TOOL-REGISTRY-001: registration rejects missing required field
statusReason: expected error to be instance of ToolValidationError

[Killed] BlockStatement
tools/tool-registry.ts:96:32
 }
 
 export class ToolConflictError extends Error {
-  constructor(message: string) {
-    super(message);
-    this.name = 'ToolConflictError';
-    Object.setPrototypeOf(this, ToolConflictError.prototype);
-  }
+  constructor(message: string) {}
 }
 
killedBy: AH-TOOL-REGISTRY-001: registration rejects duplicate name+version
statusReason: expected error to be instance of ToolConflictError

[Killed] BlockStatement
tools/tool-registry.ts:112:42
   private readonly specHashes = new Map<string, string>();
 
   register(spec: ToolSpec): void {
-    for (const field of REQUIRED_FIELDS) {
-      if (spec[field] === undefined || spec[field] === null) {
-        throw new ToolValidationError(`ToolSpec missing required field: ${field}`);
-      }
-    }
+    for (const field of REQUIRED_FIELDS) {}
 
     if (!/^[a-z][a-z0-9_-]*$/.test(spec.name)) {
killedBy: AH-TOOL-REGISTRY-001: registration rejects missing required field
statusReason: expected function to throw an error, but it didn't

[Killed] BlockStatement
tools/tool-registry.ts:113:62
 
   register(spec: ToolSpec): void {
     for (const field of REQUIRED_FIELDS) {
-      if (spec[field] === undefined || spec[field] === null) {
-        throw new ToolValidationError(`ToolSpec missing required field: ${field}`);
-      }
+      if (spec[field] === undefined || spec[field] === null) {}
     }
 
killedBy: AH-TOOL-REGISTRY-001: registration rejects missing required field
statusReason: expected function to throw an error, but it didn't

[Killed] ConditionalExpression
tools/tool-registry.ts:118:9
       }
     }
 
-    if (!/^[a-z][a-z0-9_-]*$/.test(spec.name)) {
+    if (true) {
       throw new ToolValidationError(`ToolSpec name '${spec.name}' must be lowercase snake/kebab-case`);
     }
killedBy: AH-TOOL-REGISTRY-001: registration registers a valid tool spec
statusReason: ToolSpec name 'read_file' must be lowercase snake/kebab-case

[Survived] StringLiteral
tools/tool-registry.ts:119:37
     }
 
     if (!/^[a-z][a-z0-9_-]*$/.test(spec.name)) {
-      throw new ToolValidationError(`ToolSpec name '${spec.name}' must be lowercase snake/kebab-case`);
+      throw new ToolValidationError(``);
     }
 

[Killed] ConditionalExpression
tools/tool-registry.ts:122:9
       throw new ToolValidationError(`ToolSpec name '${spec.name}' must be lowercase snake/kebab-case`);
     }
 
-    if (!VALID_MATURITY.includes(spec.maturity)) {
+    if (false) {
       throw new ToolValidationError(`ToolSpec maturity '${spec.maturity}' is not valid`);
     }
killedBy: AH-TOOL-REGISTRY-001: registration rejects invalid maturity
statusReason: expected function to throw an error, but it didn't

[Killed] BooleanLiteral
tools/tool-registry.ts:122:9
       throw new ToolValidationError(`ToolSpec name '${spec.name}' must be lowercase snake/kebab-case`);
     }
 
-    if (!VALID_MATURITY.includes(spec.maturity)) {
+    if (VALID_MATURITY.includes(spec.maturity)) {
       throw new ToolValidationError(`ToolSpec maturity '${spec.maturity}' is not valid`);
     }
killedBy: mutation-kill: tool registry validation rejects invalid maturity
statusReason: expected [Function] to throw an error

[Survived] StringLiteral
tools/tool-registry.ts:123:37
     }
 
     if (!VALID_MATURITY.includes(spec.maturity)) {
-      throw new ToolValidationError(`ToolSpec maturity '${spec.maturity}' is not valid`);
+      throw new ToolValidationError(``);
     }
 

[Killed] ConditionalExpression
tools/tool-registry.ts:126:9
       throw new ToolValidationError(`ToolSpec maturity '${spec.maturity}' is not valid`);
     }
 
-    if (!VALID_STATUS.includes(spec.implementation_status)) {
+    if (true) {
       throw new ToolValidationError(`ToolSpec implementation_status '${spec.implementation_status}' is not valid`);
     }
killedBy: AH-TOOLS-001: register all nine in ToolRegistry all nine tools register successfully
statusReason: ToolSpec implementation_status 'implemented' is not valid

[Killed] BlockStatement
tools/tool-registry.ts:126:61
       throw new ToolValidationError(`ToolSpec maturity '${spec.maturity}' is not valid`);
     }
 
-    if (!VALID_STATUS.includes(spec.implementation_status)) {
-      throw new ToolValidationError(`ToolSpec implementation_status '${spec.implementation_status}' is not valid`);
-    }
+    if (!VALID_STATUS.includes(spec.implementation_status)) {}
 
     if (/<system>|<\|im_start|<\|im_end|ignore.*previous/i.test(spec.summary)) {
killedBy: AH-TOOL-REGISTRY-001: registration rejects invalid implementation_status
statusReason: expected function to throw an error, but it didn't

[Killed] StringLiteral
tools/tool-registry.ts:134:17
       throw new ToolValidationError('ToolSpec summary contains suspicious prompt-injection pattern');
     }
 
-    const key = `${spec.name}@${spec.version}`;
+    const key = ``;
     if (this.tools.has(key)) {
       throw new ToolConflictError(`Tool '${key}' already registered (duplicate ID)`);
killedBy: AH-TOOL-REGISTRY-001: registration allows same name with different version
statusReason: Tool '' already registered (duplicate ID)

[Killed] ConditionalExpression
tools/tool-registry.ts:135:9
     }
 
     const key = `${spec.name}@${spec.version}`;
-    if (this.tools.has(key)) {
+    if (false) {
       throw new ToolConflictError(`Tool '${key}' already registered (duplicate ID)`);
     }
killedBy: AH-TOOL-REGISTRY-001: registration rejects duplicate name+version
statusReason: expected function to throw an error, but it didn't

[Killed] ConditionalExpression
tools/tool-registry.ts:135:9
     }
 
     const key = `${spec.name}@${spec.version}`;
-    if (this.tools.has(key)) {
+    if (true) {
       throw new ToolConflictError(`Tool '${key}' already registered (duplicate ID)`);
     }
killedBy: mutation-kill: tool registry validation search by query matches name
statusReason: Tool 'read_file@1.0.0' already registered (duplicate ID)

[Killed] LogicalOperator
tools/tool-registry.ts:140:9
     }
 
     const hash = this.hashSpec(spec);
-    if (this.specHashes.has(hash) && this.specHashes.get(hash) !== key) {
+    if (this.specHashes.has(hash) || this.specHashes.get(hash) !== key) {
       throw new ToolConflictError('Tool spec hash collision: untrusted override attempt detected');
     }
killedBy: AH-TOOL-REGISTRY-001: registration registers a valid tool spec
statusReason: Tool spec hash collision: untrusted override attempt detected

[Killed] ConditionalExpression
tools/tool-registry.ts:140:9
     }
 
     const hash = this.hashSpec(spec);
-    if (this.specHashes.has(hash) && this.specHashes.get(hash) !== key) {
+    if (true) {
       throw new ToolConflictError('Tool spec hash collision: untrusted override attempt detected');
     }
killedBy: AH-TOOLS-001: register all nine in ToolRegistry all nine tools register successfully
statusReason: Tool spec hash collision: untrusted override attempt detected

[Killed] BooleanLiteral
tools/tool-registry.ts:144:61
       throw new ToolConflictError('Tool spec hash collision: untrusted override attempt detected');
     }
 
-    this.tools.set(key, { ...spec, visible: spec.visible ?? true });
+    this.tools.set(key, { ...spec, visible: spec.visible ?? false });
     this.specHashes.set(hash, key);
   }
killedBy: AH-TOOL-REGISTRY-001: tool_search returns all visible tools with empty query
statusReason: expected +0 to be 4 // Object.is equality

[Survived] LogicalOperator
tools/tool-registry.ts:144:45
       throw new ToolConflictError('Tool spec hash collision: untrusted override attempt detected');
     }
 
-    this.tools.set(key, { ...spec, visible: spec.visible ?? true });
+    this.tools.set(key, { ...spec, visible: spec.visible && true });
     this.specHashes.set(hash, key);
   }

[Killed] BlockStatement
tools/tool-registry.ts:148:61
     this.specHashes.set(hash, key);
   }
 
-  get(name: string, version?: string): ToolSpec | undefined {
-    if (version) {
-      return this.tools.get(`${name}@${version}`);
-    }
-    let latest: ToolSpec | undefined;
-    for (const tool of this.tools.values()) {
-      if (tool.name === name) {
-        if (!latest || tool.version > latest.version) {
-          latest = tool;
-        }
-      }
-    }
-    return latest;
-  }
+  get(name: string, version?: string): ToolSpec | undefined {}
 
   list(): string[] {
killedBy: AH-TOOLS-001: register all nine in ToolRegistry all nine tools register successfully
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
tools/tool-registry.ts:149:9
   }
 
   get(name: string, version?: string): ToolSpec | undefined {
-    if (version) {
+    if (true) {
       return this.tools.get(`${name}@${version}`);
     }
killedBy: AH-TOOL-REGISTRY-001: registration registers a valid tool spec
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
tools/tool-registry.ts:149:18
   }
 
   get(name: string, version?: string): ToolSpec | undefined {
-    if (version) {
-      return this.tools.get(`${name}@${version}`);
-    }
+    if (version) {}
     let latest: ToolSpec | undefined;
     for (const tool of this.tools.values()) {
killedBy: AH-TOOL-REGISTRY-001: registration get with explicit version returns that version
statusReason: expected '2.0.0' to be '1.0.0' // Object.is equality

[Killed] BlockStatement
tools/tool-registry.ts:153:45
       return this.tools.get(`${name}@${version}`);
     }
     let latest: ToolSpec | undefined;
-    for (const tool of this.tools.values()) {
-      if (tool.name === name) {
-        if (!latest || tool.version > latest.version) {
-          latest = tool;
-        }
-      }
-    }
+    for (const tool of this.tools.values()) {}
     return latest;
   }
killedBy: AH-TOOL-REGISTRY-001: registration registers a valid tool spec
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
tools/tool-registry.ts:154:11
     }
     let latest: ToolSpec | undefined;
     for (const tool of this.tools.values()) {
-      if (tool.name === name) {
+      if (tool.name !== name) {
         if (!latest || tool.version > latest.version) {
           latest = tool;
killedBy: AH-TOOL-REGISTRY-001: registration registers a valid tool spec
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
tools/tool-registry.ts:154:11
     }
     let latest: ToolSpec | undefined;
     for (const tool of this.tools.values()) {
-      if (tool.name === name) {
+      if (false) {
         if (!latest || tool.version > latest.version) {
           latest = tool;
killedBy: AH-TOOL-REGISTRY-001: registration registers a valid tool spec
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
tools/tool-registry.ts:155:24
     let latest: ToolSpec | undefined;
     for (const tool of this.tools.values()) {
       if (tool.name === name) {
-        if (!latest || tool.version > latest.version) {
+        if (!latest || tool.version <= latest.version) {
           latest = tool;
         }
killedBy: AH-TOOL-REGISTRY-001: registration get returns latest version when version not specified
statusReason: expected '1.0.0' to be '2.0.0' // Object.is equality

[Killed] LogicalOperator
tools/tool-registry.ts:155:13
     let latest: ToolSpec | undefined;
     for (const tool of this.tools.values()) {
       if (tool.name === name) {
-        if (!latest || tool.version > latest.version) {
+        if (!latest && tool.version > latest.version) {
           latest = tool;
         }
killedBy: AH-TOOL-REGISTRY-001: registration registers a valid tool spec
statusReason: Cannot read properties of undefined (reading 'version')

[NoCoverage] BlockStatement
tools/tool-registry.ts:163:20
     return latest;
   }
 
-  list(): string[] {
-    return [...this.tools.keys()];
-  }
+  list(): string[] {}
 
   search(opts: ToolSearchOptions = {}): SearchResult[] {

[Killed] LogicalOperator
tools/tool-registry.ts:168:19
   }
 
   search(opts: ToolSearchOptions = {}): SearchResult[] {
-    const limit = opts.limit ?? 20;
+    const limit = opts.limit && 20;
     const results: SearchResult[] = [];
 
killedBy: AH-TOOL-REGISTRY-001: tool_search respects limit
statusReason: expected 4 to be 2 // Object.is equality

[Killed] BooleanLiteral
tools/tool-registry.ts:172:28
     const results: SearchResult[] = [];
 
     for (const tool of this.tools.values()) {
-      if (tool.visible === false) continue;
+      if (tool.visible === true) continue;
 
       if (opts.tags && opts.tags.length > 0) {
killedBy: AH-TOOL-REGISTRY-001: tool_search returns all visible tools with empty query
statusReason: expected +0 to be 4 // Object.is equality

[Killed] EqualityOperator
tools/tool-registry.ts:172:11
     const results: SearchResult[] = [];
 
     for (const tool of this.tools.values()) {
-      if (tool.visible === false) continue;
+      if (tool.visible !== false) continue;
 
       if (opts.tags && opts.tags.length > 0) {
killedBy: AH-TOOL-REGISTRY-001: tool_search returns all visible tools with empty query
statusReason: expected +0 to be 4 // Object.is equality

[Killed] LogicalOperator
tools/tool-registry.ts:174:11
     for (const tool of this.tools.values()) {
       if (tool.visible === false) continue;
 
-      if (opts.tags && opts.tags.length > 0) {
+      if (opts.tags || opts.tags.length > 0) {
         if (!opts.tags.some((t) => tool.tags.includes(t))) continue;
       }
killedBy: AH-TOOLS-001: register all nine in ToolRegistry tool_search discovers all nine
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ArrowFunction
tools/tool-registry.ts:175:29
       if (tool.visible === false) continue;
 
       if (opts.tags && opts.tags.length > 0) {
-        if (!opts.tags.some((t) => tool.tags.includes(t))) continue;
+        if (!opts.tags.some(() => undefined)) continue;
       }
 
killedBy: AH-TOOL-REGISTRY-001: tool_search filters by tags
statusReason: expected +0 to be 3 // Object.is equality

[Killed] BooleanLiteral
tools/tool-registry.ts:175:13
       if (tool.visible === false) continue;
 
       if (opts.tags && opts.tags.length > 0) {
-        if (!opts.tags.some((t) => tool.tags.includes(t))) continue;
+        if (opts.tags.some(t => tool.tags.includes(t))) continue;
       }
 
killedBy: AH-TOOL-REGISTRY-001: tool_search filters by tags
statusReason: expected 1 to be 3 // Object.is equality

[Killed] ConditionalExpression
tools/tool-registry.ts:178:11
         if (!opts.tags.some((t) => tool.tags.includes(t))) continue;
       }
 
-      if (opts.domains && opts.domains.length > 0) {
+      if (false) {
         if (!opts.domains.some((d) => tool.domains.includes(d))) continue;
       }
killedBy: mutation-kill: tool registry validation search by domains
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
tools/tool-registry.ts:178:11
         if (!opts.tags.some((t) => tool.tags.includes(t))) continue;
       }
 
-      if (opts.domains && opts.domains.length > 0) {
+      if (true) {
         if (!opts.domains.some((d) => tool.domains.includes(d))) continue;
       }
killedBy: AH-TOOL-REGISTRY-001: tool_search returns all visible tools with empty query
statusReason: Cannot read properties of undefined (reading 'some')

[Killed] ArrowFunction
tools/tool-registry.ts:179:32
       }
 
       if (opts.domains && opts.domains.length > 0) {
-        if (!opts.domains.some((d) => tool.domains.includes(d))) continue;
+        if (!opts.domains.some(() => undefined)) continue;
       }
 
killedBy: mutation-kill: tool registry validation search by domains
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
tools/tool-registry.ts:179:13
       }
 
       if (opts.domains && opts.domains.length > 0) {
-        if (!opts.domains.some((d) => tool.domains.includes(d))) continue;
+        if (false) continue;
       }
 
killedBy: mutation-kill: tool registry validation search by domains
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
tools/tool-registry.ts:182:11
         if (!opts.domains.some((d) => tool.domains.includes(d))) continue;
       }
 
-      if (opts.tool_group && tool.tool_group !== opts.tool_group) continue;
+      if (true) continue;
 
       if (opts.query) {
killedBy: AH-TOOLS-001: register all nine in ToolRegistry tool_search discovers all nine
statusReason: expected +0 to be 9 // Object.is equality

[Survived] ConditionalExpression
tools/tool-registry.ts:182:11
         if (!opts.domains.some((d) => tool.domains.includes(d))) continue;
       }
 
-      if (opts.tool_group && tool.tool_group !== opts.tool_group) continue;
+      if (false) continue;
 
       if (opts.query) {

[Killed] ConditionalExpression
tools/tool-registry.ts:184:11
 
       if (opts.tool_group && tool.tool_group !== opts.tool_group) continue;
 
-      if (opts.query) {
+      if (true) {
         const q = opts.query.toLowerCase();
         const haystack = [tool.name, tool.summary, ...tool.tags].join(' ').toLowerCase();
killedBy: mutation-kill: tool registry validation search by domains
statusReason: Cannot read properties of undefined (reading 'toLowerCase')

[Killed] MethodExpression
tools/tool-registry.ts:186:26
 
       if (opts.query) {
         const q = opts.query.toLowerCase();
-        const haystack = [tool.name, tool.summary, ...tool.tags].join(' ').toLowerCase();
+        const haystack = [tool.name, tool.summary, ...tool.tags].join(' ').toUpperCase();
         if (!haystack.includes(q)) continue;
       }
killedBy: AH-TOOL-REGISTRY-001: tool_search filters by query string
statusReason: expected +0 to be 3 // Object.is equality

[Killed] BooleanLiteral
tools/tool-registry.ts:187:13
       if (opts.query) {
         const q = opts.query.toLowerCase();
         const haystack = [tool.name, tool.summary, ...tool.tags].join(' ').toLowerCase();
-        if (!haystack.includes(q)) continue;
+        if (haystack.includes(q)) continue;
       }
 
killedBy: AH-TOOL-REGISTRY-001: tool_search filters by query string
statusReason: expected 1 to be 3 // Object.is equality

[Killed] ConditionalExpression
tools/tool-registry.ts:187:13
       if (opts.query) {
         const q = opts.query.toLowerCase();
         const haystack = [tool.name, tool.summary, ...tool.tags].join(' ').toLowerCase();
-        if (!haystack.includes(q)) continue;
+        if (false) continue;
       }
 
killedBy: AH-TOOL-REGISTRY-001: tool_search filters by query string
statusReason: expected 4 to be 3 // Object.is equality

[Survived] ArrayDeclaration
tools/tool-registry.ts:195:18
         version: tool.version,
         summary: tool.summary,
         tags: [...tool.tags],
-        domains: [...tool.domains],
+        domains: [],
         tool_group: tool.tool_group,
       });

[Killed] BlockStatement
tools/tool-registry.ts:203:19
     return results.slice(0, limit);
   }
 
-  count(): number {
-    return this.tools.size;
-  }
+  count(): number {}
 
   has(name: string, version?: string): boolean {
killedBy: AH-TOOL-REGISTRY-001: registration registers a valid tool spec
statusReason: expected undefined to be 1 // Object.is equality

[Killed] BlockStatement
tools/tool-registry.ts:207:48
     return this.tools.size;
   }
 
-  has(name: string, version?: string): boolean {
-    if (version) return this.tools.has(`${name}@${version}`);
-    return this.get(name) !== undefined;
-  }
+  has(name: string, version?: string): boolean {}
 
   private hashSpec(spec: ToolSpec): string {
killedBy: AH-TOOL-REGISTRY-001: registration registers a valid tool spec
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
tools/tool-registry.ts:208:9
   }
 
   has(name: string, version?: string): boolean {
-    if (version) return this.tools.has(`${name}@${version}`);
+    if (true) return this.tools.has(`${name}@${version}`);
     return this.get(name) !== undefined;
   }
killedBy: AH-TOOL-REGISTRY-001: registration registers a valid tool spec
statusReason: expected false to be true // Object.is equality

[Survived] ConditionalExpression
tools/tool-registry.ts:208:9
   }
 
   has(name: string, version?: string): boolean {
-    if (version) return this.tools.has(`${name}@${version}`);
+    if (false) return this.tools.has(`${name}@${version}`);
     return this.get(name) !== undefined;
   }

[Killed] EqualityOperator
tools/tool-registry.ts:209:12
 
   has(name: string, version?: string): boolean {
     if (version) return this.tools.has(`${name}@${version}`);
-    return this.get(name) !== undefined;
+    return this.get(name) === undefined;
   }
 
killedBy: AH-TOOL-REGISTRY-001: registration registers a valid tool spec
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
tools/tool-registry.ts:209:12
 
   has(name: string, version?: string): boolean {
     if (version) return this.tools.has(`${name}@${version}`);
-    return this.get(name) !== undefined;
+    return true;
   }
 
killedBy: coverage: ToolRegistry methods has returns false for unregistered
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
tools/tool-registry.ts:212:44
     return this.get(name) !== undefined;
   }
 
-  private hashSpec(spec: ToolSpec): string {
-    const payload = JSON.stringify({
-      name: spec.name,
-      version: spec.version,
-      input_schema_ref: spec.input_schema_ref,
-      output_schema_ref: spec.output_schema_ref,
-      effect_model: spec.effect_model,
-    });
-    return createHash('sha256').update(payload).digest('hex');
-  }
+  private hashSpec(spec: ToolSpec): string {}
 }
 
killedBy: AH-TOOL-REGISTRY-001: registration allows same name with different version
statusReason: Tool spec hash collision: untrusted override attempt detected

[Killed] BlockStatement
tools/tool-registry.ts:227:19
 export function tool_search(
   registry: ToolRegistry,
   opts: ToolSearchOptions = {},
-): SearchResult[] {
-  return registry.search(opts);
-}
+): SearchResult[] {}
 
killedBy: AH-TOOL-REGISTRY-001: tool_search returns all visible tools with empty query
statusReason: Cannot read properties of undefined (reading 'length')
