[Killed] BlockStatement
ingestion/parse-document.ts:22:96
   total_chars: number;
 }
 
-export function parseDocument(content: string, input: ParseDocumentInput): ParseDocumentResult {
-  const format = input.format ?? 'txt';
-  const maxPages = input.max_pages ?? 100;
-
-  switch (format) {
-    case 'json':
-      return parseJson(content, input.path);
-    case 'csv':
-      return parseCsv(content, input.path);
-    case 'md':
-      return parseMarkdown(content, input.path, maxPages);
-    case 'txt':
-    default:
-      return parseText(content, input.path, maxPages);
-  }
-}
+export function parseDocument(content: string, input: ParseDocumentInput): ParseDocumentResult {}
 
 function parseText(content: string, path: string, maxPages: number): ParseDocumentResult {
killedBy: AH-VERTICALS: six product verticals documents: parses, summarizes, cites pages
statusReason: Cannot read properties of undefined (reading 'sections')

[Killed] LogicalOperator
ingestion/parse-document.ts:23:18
 }
 
 export function parseDocument(content: string, input: ParseDocumentInput): ParseDocumentResult {
-  const format = input.format ?? 'txt';
+  const format = input.format && 'txt';
   const maxPages = input.max_pages ?? 100;
 
killedBy: AH-TOOLS-001: all nine tools through VFS/Sandbox parse_document parses markdown
statusReason: expected 1 to be 3 // Object.is equality

[Survived] StringLiteral
ingestion/parse-document.ts:23:34
 }
 
 export function parseDocument(content: string, input: ParseDocumentInput): ParseDocumentResult {
-  const format = input.format ?? 'txt';
+  const format = input.format ?? "";
   const maxPages = input.max_pages ?? 100;
 

[Killed] LogicalOperator
ingestion/parse-document.ts:24:20
 
 export function parseDocument(content: string, input: ParseDocumentInput): ParseDocumentResult {
   const format = input.format ?? 'txt';
-  const maxPages = input.max_pages ?? 100;
+  const maxPages = input.max_pages && 100;
 
   switch (format) {
killedBy: AH-TOOLS-001: all nine tools through VFS/Sandbox parse_document parses markdown
statusReason: expected 2 to be 3 // Object.is equality

[Killed] ConditionalExpression
ingestion/parse-document.ts:27:5
   const maxPages = input.max_pages ?? 100;
 
   switch (format) {
-    case 'json':
-      return parseJson(content, input.path);
+    case 'json':
     case 'csv':
       return parseCsv(content, input.path);
killedBy: AH-TOOLS-001: all nine tools through VFS/Sandbox parse_document parses JSON
statusReason: expected 'csv' to be 'json' // Object.is equality

[Killed] StringLiteral
ingestion/parse-document.ts:27:10
   const maxPages = input.max_pages ?? 100;
 
   switch (format) {
-    case 'json':
+    case "":
       return parseJson(content, input.path);
     case 'csv':
killedBy: AH-TOOLS-001: all nine tools through VFS/Sandbox parse_document parses JSON
statusReason: expected 'txt' to be 'json' // Object.is equality

[Killed] ConditionalExpression
ingestion/parse-document.ts:29:5
   switch (format) {
     case 'json':
       return parseJson(content, input.path);
-    case 'csv':
-      return parseCsv(content, input.path);
+    case 'csv':
     case 'md':
       return parseMarkdown(content, input.path, maxPages);
killedBy: AH-TOOLS-001: all nine tools through VFS/Sandbox parse_document parses CSV
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ConditionalExpression
ingestion/parse-document.ts:31:5
       return parseJson(content, input.path);
     case 'csv':
       return parseCsv(content, input.path);
-    case 'md':
-      return parseMarkdown(content, input.path, maxPages);
+    case 'md':
     case 'txt':
     default:
killedBy: AH-TOOLS-001: all nine tools through VFS/Sandbox parse_document parses markdown
statusReason: expected 1 to be 3 // Object.is equality

[Survived] StringLiteral
ingestion/parse-document.ts:33:10
       return parseCsv(content, input.path);
     case 'md':
       return parseMarkdown(content, input.path, maxPages);
-    case 'txt':
+    case "":
     default:
       return parseText(content, input.path, maxPages);

[Killed] ConditionalExpression
ingestion/parse-document.ts:34:5
     case 'md':
       return parseMarkdown(content, input.path, maxPages);
     case 'txt':
-    default:
-      return parseText(content, input.path, maxPages);
+    default:
   }
 }
killedBy: AH-TOOLS-001: all nine tools through VFS/Sandbox parse_document parses text
statusReason: Cannot read properties of undefined (reading 'sections')

[Killed] BlockStatement
ingestion/parse-document.ts:39:90
   }
 }
 
-function parseText(content: string, path: string, maxPages: number): ParseDocumentResult {
-  // Split by form feed or every 1000 chars as "pages"
-  const pageBreak = '\f';
-  const rawPages = content.split(pageBreak);
-  const pages = rawPages.length > 0 ? rawPages : [content];
-  const sections = pages.slice(0, maxPages).map((text, i) => ({
-    page: i + 1,
-    text,
-    source: path,
-  }));
-  return {
-    path,
-    format: 'txt',
-    sections,
-    total_pages: pages.length,
-    total_chars: content.length,
-  };
-}
+function parseText(content: string, path: string, maxPages: number): ParseDocumentResult {}
 
 function parseMarkdown(content: string, path: string, maxPages: number): ParseDocumentResult {
killedBy: AH-TOOLS-001: all nine tools through VFS/Sandbox parse_document parses text
statusReason: Cannot read properties of undefined (reading 'sections')

[Killed] ConditionalExpression
ingestion/parse-document.ts:43:17
   // Split by form feed or every 1000 chars as "pages"
   const pageBreak = '\f';
   const rawPages = content.split(pageBreak);
-  const pages = rawPages.length > 0 ? rawPages : [content];
+  const pages = false ? rawPages : [content];
   const sections = pages.slice(0, maxPages).map((text, i) => ({
     page: i + 1,
killedBy: AH-TOOLS-001: all nine tools through VFS/Sandbox parse_document parses text
statusReason: expected 1 to be 2 // Object.is equality

[Killed] EqualityOperator
ingestion/parse-document.ts:43:17
   // Split by form feed or every 1000 chars as "pages"
   const pageBreak = '\f';
   const rawPages = content.split(pageBreak);
-  const pages = rawPages.length > 0 ? rawPages : [content];
+  const pages = rawPages.length <= 0 ? rawPages : [content];
   const sections = pages.slice(0, maxPages).map((text, i) => ({
     page: i + 1,
killedBy: AH-TOOLS-001: all nine tools through VFS/Sandbox parse_document parses text
statusReason: expected 1 to be 2 // Object.is equality

[Killed] MethodExpression
ingestion/parse-document.ts:44:20
   const pageBreak = '\f';
   const rawPages = content.split(pageBreak);
   const pages = rawPages.length > 0 ? rawPages : [content];
-  const sections = pages.slice(0, maxPages).map((text, i) => ({
+  const sections = pages.map((text, i) => ({
     page: i + 1,
     text,
killedBy: AH-INGESTION-001: parse_document respects max_pages
statusReason: expected 5 to be 2 // Object.is equality

[Killed] ArrowFunction
ingestion/parse-document.ts:44:49
   const pageBreak = '\f';
   const rawPages = content.split(pageBreak);
   const pages = rawPages.length > 0 ? rawPages : [content];
-  const sections = pages.slice(0, maxPages).map((text, i) => ({
-    page: i + 1,
-    text,
-    source: path,
-  }));
+  const sections = pages.slice(0, maxPages).map(() => undefined);
   return {
     path,
killedBy: AH-VERTICALS: six product verticals documents: parses, summarizes, cites pages
statusReason: Cannot read properties of undefined (reading 'text')

[Killed] ArithmeticOperator
ingestion/parse-document.ts:45:11
   const rawPages = content.split(pageBreak);
   const pages = rawPages.length > 0 ? rawPages : [content];
   const sections = pages.slice(0, maxPages).map((text, i) => ({
-    page: i + 1,
+    page: i - 1,
     text,
     source: path,
killedBy: AH-TOOLS-001: all nine tools through VFS/Sandbox parse_document parses text
statusReason: expected -1 to be 1 // Object.is equality

[Killed] ArrayDeclaration
ingestion/parse-document.ts:60:37
 
 function parseMarkdown(content: string, path: string, maxPages: number): ParseDocumentResult {
   // Split by ## headers as "pages"
-  const sections: ParsedSection[] = [];
+  const sections: ParsedSection[] = ["Stryker was here"];
   const lines = content.split('\n');
   let currentPage = 0;
killedBy: AH-INGESTION-001: parse_document parses markdown by headers
statusReason: expected 3 to be 2 // Object.is equality

[Killed] BlockStatement
ingestion/parse-document.ts:65:29
   let currentPage = 0;
   let currentText: string[] = [];
 
-  for (const line of lines) {
-    if (line.startsWith('## ') && currentText.length > 0) {
-      currentPage++;
-      if (currentPage > maxPages) break;
-      sections.push({ page: currentPage, text: currentText.join('\n'), source: path });
-      currentText = [];
-    }
-    currentText.push(line);
-  }
+  for (const line of lines) {}
 
   if (currentText.length > 0 && sections.length < maxPages) {
killedBy: AH-TOOLS-001: all nine tools through VFS/Sandbox parse_document parses markdown
statusReason: expected +0 to be 3 // Object.is equality

[Killed] ConditionalExpression
ingestion/parse-document.ts:66:35
   let currentText: string[] = [];
 
   for (const line of lines) {
-    if (line.startsWith('## ') && currentText.length > 0) {
+    if (line.startsWith('## ') && true) {
       currentPage++;
       if (currentPage > maxPages) break;
killedBy: AH-INGESTION-001: parse_document parses markdown by headers
statusReason: expected 3 to be 2 // Object.is equality

[Killed] ConditionalExpression
ingestion/parse-document.ts:66:9
   let currentText: string[] = [];
 
   for (const line of lines) {
-    if (line.startsWith('## ') && currentText.length > 0) {
+    if (false) {
       currentPage++;
       if (currentPage > maxPages) break;
killedBy: AH-INGESTION-001: parse_document parses markdown by headers
statusReason: expected 1 to be 2 // Object.is equality

[Survived] UpdateOperator
ingestion/parse-document.ts:67:7
 
   for (const line of lines) {
     if (line.startsWith('## ') && currentText.length > 0) {
-      currentPage++;
+      currentPage--;
       if (currentPage > maxPages) break;
       sections.push({ page: currentPage, text: currentText.join('\n'), source: path });

[Killed] EqualityOperator
ingestion/parse-document.ts:68:11
   for (const line of lines) {
     if (line.startsWith('## ') && currentText.length > 0) {
       currentPage++;
-      if (currentPage > maxPages) break;
+      if (currentPage <= maxPages) break;
       sections.push({ page: currentPage, text: currentText.join('\n'), source: path });
       currentText = [];
killedBy: AH-INGESTION-001: parse_document parses markdown by headers
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ConditionalExpression
ingestion/parse-document.ts:68:11
   for (const line of lines) {
     if (line.startsWith('## ') && currentText.length > 0) {
       currentPage++;
-      if (currentPage > maxPages) break;
+      if (true) break;
       sections.push({ page: currentPage, text: currentText.join('\n'), source: path });
       currentText = [];
killedBy: AH-INGESTION-001: parse_document parses markdown by headers
statusReason: expected 1 to be 2 // Object.is equality

[Killed] BlockStatement
ingestion/parse-document.ts:75:61
     currentText.push(line);
   }
 
-  if (currentText.length > 0 && sections.length < maxPages) {
-    sections.push({ page: sections.length + 1, text: currentText.join('\n'), source: path });
-  }
+  if (currentText.length > 0 && sections.length < maxPages) {}
 
   return {
killedBy: AH-TOOLS-001: all nine tools through VFS/Sandbox parse_document parses markdown
statusReason: expected 2 to be 3 // Object.is equality

[Killed] ConditionalExpression
ingestion/parse-document.ts:75:7
     currentText.push(line);
   }
 
-  if (currentText.length > 0 && sections.length < maxPages) {
+  if (false) {
     sections.push({ page: sections.length + 1, text: currentText.join('\n'), source: path });
   }
killedBy: AH-INGESTION-001: parse_document parses markdown by headers
statusReason: expected 1 to be 2 // Object.is equality

[Survived] ArithmeticOperator
ingestion/parse-document.ts:76:27
   }
 
   if (currentText.length > 0 && sections.length < maxPages) {
-    sections.push({ page: sections.length + 1, text: currentText.join('\n'), source: path });
+    sections.push({ page: sections.length - 1, text: currentText.join('\n'), source: path });
   }
 

[Survived] StringLiteral
ingestion/parse-document.ts:76:71
   }
 
   if (currentText.length > 0 && sections.length < maxPages) {
-    sections.push({ page: sections.length + 1, text: currentText.join('\n'), source: path });
+    sections.push({ page: sections.length + 1, text: currentText.join(""), source: path });
   }
 

[Killed] BlockStatement
ingestion/parse-document.ts:88:72
   };
 }
 
-function parseJson(content: string, path: string): ParseDocumentResult {
-  const parsed = JSON.parse(content);
-  const text = JSON.stringify(parsed, null, 2);
-  return {
-    path,
-    format: 'json',
-    sections: [{ page: 1, text, source: path }],
-    total_pages: 1,
-    total_chars: text.length,
-  };
-}
+function parseJson(content: string, path: string): ParseDocumentResult {}
 
 function parseCsv(content: string, path: string): ParseDocumentResult {
killedBy: AH-TOOLS-001: all nine tools through VFS/Sandbox parse_document parses JSON
statusReason: Cannot read properties of undefined (reading 'sections')

[Killed] StringLiteral
ingestion/parse-document.ts:93:13
   const text = JSON.stringify(parsed, null, 2);
   return {
     path,
-    format: 'json',
+    format: "",
     sections: [{ page: 1, text, source: path }],
     total_pages: 1,
killedBy: AH-TOOLS-001: all nine tools through VFS/Sandbox parse_document parses JSON
statusReason: expected '' to be 'json' // Object.is equality

[Survived] ObjectLiteral
ingestion/parse-document.ts:94:16
   return {
     path,
     format: 'json',
-    sections: [{ page: 1, text, source: path }],
+    sections: [{}],
     total_pages: 1,
     total_chars: text.length,

[Killed] BlockStatement
ingestion/parse-document.ts:100:71
   };
 }
 
-function parseCsv(content: string, path: string): ParseDocumentResult {
-  const lines = content.split('\n').filter((l) => l.trim());
-  const sections: ParsedSection[] = lines.map((line, i) => ({
-    page: i + 1,
-    text: line,
-    source: path,
-  }));
-  return {
-    path,
-    format: 'csv',
-    sections,
-    total_pages: lines.length,
-    total_chars: content.length,
-  };
-}
+function parseCsv(content: string, path: string): ParseDocumentResult {}
 
killedBy: AH-TOOLS-001: all nine tools through VFS/Sandbox parse_document parses CSV
statusReason: Cannot read properties of undefined (reading 'sections')

[Killed] ArrowFunction
ingestion/parse-document.ts:101:44
 }
 
 function parseCsv(content: string, path: string): ParseDocumentResult {
-  const lines = content.split('\n').filter((l) => l.trim());
+  const lines = content.split('\n').filter(() => undefined);
   const sections: ParsedSection[] = lines.map((line, i) => ({
     page: i + 1,
killedBy: AH-TOOLS-001: all nine tools through VFS/Sandbox parse_document parses CSV
statusReason: expected +0 to be 2 // Object.is equality

[Survived] MethodExpression
ingestion/parse-document.ts:101:51
 }
 
 function parseCsv(content: string, path: string): ParseDocumentResult {
-  const lines = content.split('\n').filter((l) => l.trim());
+  const lines = content.split('\n').filter((l) => l);
   const sections: ParsedSection[] = lines.map((line, i) => ({
     page: i + 1,

[Survived] ArrowFunction
ingestion/parse-document.ts:102:47
 
 function parseCsv(content: string, path: string): ParseDocumentResult {
   const lines = content.split('\n').filter((l) => l.trim());
-  const sections: ParsedSection[] = lines.map((line, i) => ({
-    page: i + 1,
-    text: line,
-    source: path,
-  }));
+  const sections: ParsedSection[] = lines.map(() => undefined);
   return {
     path,

[Survived] ArithmeticOperator
ingestion/parse-document.ts:103:11
 function parseCsv(content: string, path: string): ParseDocumentResult {
   const lines = content.split('\n').filter((l) => l.trim());
   const sections: ParsedSection[] = lines.map((line, i) => ({
-    page: i + 1,
+    page: i - 1,
     text: line,
     source: path,
