[NoCoverage] ConditionalExpression
vfs/virtual-filesystem.ts:217:13
     for (const [path, committedContent] of this.committed) {
       const entry = this.overlay.get(path);
       if (entry) {
-        if (!entry.deleted) {
+        if (true) {
           snapshot.set(path, entry.content);
         }

[NoCoverage] BlockStatement
vfs/virtual-filesystem.ts:220:14
         if (!entry.deleted) {
           snapshot.set(path, entry.content);
         }
-      } else {
-        snapshot.set(path, committedContent);
-      }
+      } else {}
     }
 

[Killed] BlockStatement
vfs/virtual-filesystem.ts:226:47
     }
 
     // Add overlay-only entries
-    for (const [path, entry] of this.overlay) {
-      if (!entry.deleted && !snapshot.has(path)) {
-        snapshot.set(path, entry.content);
-      }
-    }
+    for (const [path, entry] of this.overlay) {}
 
     this.checkpoints.set(id, snapshot);
killedBy: AH-VFS-001: diff and checkpoint checkpoint captures current overlay state
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
vfs/virtual-filesystem.ts:227:50
 
     // Add overlay-only entries
     for (const [path, entry] of this.overlay) {
-      if (!entry.deleted && !snapshot.has(path)) {
-        snapshot.set(path, entry.content);
-      }
+      if (!entry.deleted && !snapshot.has(path)) {}
     }
 
killedBy: AH-VFS-001: diff and checkpoint checkpoint captures current overlay state
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BooleanLiteral
vfs/virtual-filesystem.ts:227:11
 
     // Add overlay-only entries
     for (const [path, entry] of this.overlay) {
-      if (!entry.deleted && !snapshot.has(path)) {
+      if (entry.deleted && !snapshot.has(path)) {
         snapshot.set(path, entry.content);
       }
killedBy: AH-VFS-001: diff and checkpoint checkpoint captures current overlay state
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
vfs/virtual-filesystem.ts:236:29
     return { id, files: new Map(snapshot) };
   }
 
-  restore(id: string): void {
-    const snapshot = this.checkpoints.get(id);
-    if (!snapshot) {
-      throw new Error(`VFS: checkpoint '${id}' not found`);
-    }
-
-    // Clear overlay and rebuild from snapshot
-    this.overlay.clear();
-    for (const [path, content] of snapshot) {
-      this.overlay.set(path, { content, version: this.hashContent(content), deleted: false });
-    }
-  }
+  restore(id: string): void {}
 
   commit(): VfsCommitResult {
killedBy: AH-VFS-001: diff and checkpoint can restore to a checkpoint
statusReason: expected 'v2' to be 'v1' // Object.is equality

[Killed] ConditionalExpression
vfs/virtual-filesystem.ts:238:9
 
   restore(id: string): void {
     const snapshot = this.checkpoints.get(id);
-    if (!snapshot) {
+    if (false) {
       throw new Error(`VFS: checkpoint '${id}' not found`);
     }
killedBy: coverage: VFS methods restore throws for unknown checkpoint
statusReason: expected [Function] to throw error matching /not found/ but got 'snapshot is not iterable'

[Killed] BlockStatement
vfs/virtual-filesystem.ts:238:20
 
   restore(id: string): void {
     const snapshot = this.checkpoints.get(id);
-    if (!snapshot) {
-      throw new Error(`VFS: checkpoint '${id}' not found`);
-    }
+    if (!snapshot) {}
 
     // Clear overlay and rebuild from snapshot
killedBy: coverage: VFS methods restore throws for unknown checkpoint
statusReason: expected [Function] to throw error matching /not found/ but got 'snapshot is not iterable'

[Killed] BlockStatement
vfs/virtual-filesystem.ts:244:45
 
     // Clear overlay and rebuild from snapshot
     this.overlay.clear();
-    for (const [path, content] of snapshot) {
-      this.overlay.set(path, { content, version: this.hashContent(content), deleted: false });
-    }
+    for (const [path, content] of snapshot) {}
   }
 
killedBy: AH-VFS-001: diff and checkpoint can restore to a checkpoint
statusReason: expected null to be 'v1' // Object.is equality

[Killed] BooleanLiteral
vfs/virtual-filesystem.ts:245:86
     // Clear overlay and rebuild from snapshot
     this.overlay.clear();
     for (const [path, content] of snapshot) {
-      this.overlay.set(path, { content, version: this.hashContent(content), deleted: false });
+      this.overlay.set(path, { content, version: this.hashContent(content), deleted: true });
     }
   }
killedBy: mutation-kill: VFS all paths restore to checkpoint
statusReason: expected null to be 'v1' // Object.is equality

[Killed] BlockStatement
vfs/virtual-filesystem.ts:249:29
     }
   }
 
-  commit(): VfsCommitResult {
-    let count = 0;
-    for (const [path, entry] of this.overlay) {
-      if (entry.deleted) {
-        this.committed.delete(path);
-        count++;
-      } else {
-        this.committed.set(path, entry.content);
-        count++;
-      }
-    }
-    this.overlay.clear();
-    return { committed: count };
-  }
+  commit(): VfsCommitResult {}
 
   discard(): void {
killedBy: AH-VFS-001: commit and discard commit moves overlay changes to committed store
statusReason: Cannot read properties of undefined (reading 'committed')

[Killed] BlockStatement
vfs/virtual-filesystem.ts:251:47
 
   commit(): VfsCommitResult {
     let count = 0;
-    for (const [path, entry] of this.overlay) {
-      if (entry.deleted) {
-        this.committed.delete(path);
-        count++;
-      } else {
-        this.committed.set(path, entry.content);
-        count++;
-      }
-    }
+    for (const [path, entry] of this.overlay) {}
     this.overlay.clear();
     return { committed: count };
killedBy: AH-VFS-001: commit and discard commit moves overlay changes to committed store
statusReason: expected +0 to be 2 // Object.is equality

[NoCoverage] UpdateOperator
vfs/virtual-filesystem.ts:254:9
     for (const [path, entry] of this.overlay) {
       if (entry.deleted) {
         this.committed.delete(path);
-        count++;
+        count--;
       } else {
         this.committed.set(path, entry.content);

[Killed] BlockStatement
vfs/virtual-filesystem.ts:255:14
       if (entry.deleted) {
         this.committed.delete(path);
         count++;
-      } else {
-        this.committed.set(path, entry.content);
-        count++;
-      }
+      } else {}
     }
     this.overlay.clear();
killedBy: mutation-kill: VFS all paths commit moves overlay to committed
statusReason: expected +0 to be 1 // Object.is equality

[Killed] UpdateOperator
vfs/virtual-filesystem.ts:257:9
         count++;
       } else {
         this.committed.set(path, entry.content);
-        count++;
+        count--;
       }
     }
killedBy: AH-VFS-001: commit and discard commit moves overlay changes to committed store
statusReason: expected -2 to be 2 // Object.is equality

[Killed] ObjectLiteral
vfs/virtual-filesystem.ts:261:12
       }
     }
     this.overlay.clear();
-    return { committed: count };
+    return {};
   }
 
killedBy: AH-VFS-001: commit and discard commit moves overlay changes to committed store
statusReason: expected undefined to be 2 // Object.is equality

[Killed] BlockStatement
vfs/virtual-filesystem.ts:264:19
     return { committed: count };
   }
 
-  discard(): void {
-    this.overlay.clear();
-  }
+  discard(): void {}
 
   exists(path: string): boolean {
killedBy: mutation-kill: VFS all paths discard removes overlay
statusReason: expected 'data' to be null

[Killed] BlockStatement
vfs/virtual-filesystem.ts:268:33
     this.overlay.clear();
   }
 
-  exists(path: string): boolean {
-    return this.read(path) !== null;
-  }
+  exists(path: string): boolean {}
 
   // ---------------------------------------------------------------------------
killedBy: coverage: VFS methods exists returns false for non-existent
statusReason: expected undefined to be false // Object.is equality

[Killed] ConditionalExpression
vfs/virtual-filesystem.ts:269:12
   }
 
   exists(path: string): boolean {
-    return this.read(path) !== null;
+    return true;
   }
 
killedBy: coverage: VFS methods exists returns false for non-existent
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
vfs/virtual-filesystem.ts:269:12
   }
 
   exists(path: string): boolean {
-    return this.read(path) !== null;
+    return this.read(path) === null;
   }
 
killedBy: coverage: VFS methods exists returns false for non-existent
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
vfs/virtual-filesystem.ts:276:79
   // Private methods
   // ---------------------------------------------------------------------------
 
-  private checkPermission(normalizedPath: string, op: 'read' | 'write'): void {
-    // If no permissions defined, allow all (for testing without permission setup)
-    if (this.permissions.length === 0) return;
-
-    for (const perm of this.permissions) {
-      const prefix = perm.path_prefix.endsWith(sep) ? perm.path_prefix : perm.path_prefix + sep;
-      if (normalizedPath.startsWith(prefix) || normalizedPath === perm.path_prefix) {
-        if (op === 'read' && !perm.read) {
-          throw new Error(`VFS: read denied for '${normalizedPath}' (permission rule)`);
-        }
-        if (op === 'write' && !perm.write) {
-          throw new Error(`VFS: write denied for '${normalizedPath}' (permission rule)`);
-        }
-        return;
-      }
-    }
-
-    // No matching rule -> default deny
-    throw new Error(`VFS: no permission rule for '${normalizedPath}' (default deny)`);
-  }
+  private checkPermission(normalizedPath: string, op: 'read' | 'write'): void {}
 
   private hashContent(content: string): string {
killedBy: AH-VFS-001: permission enforcement allows read but denies write in readonly path
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
vfs/virtual-filesystem.ts:278:9
 
   private checkPermission(normalizedPath: string, op: 'read' | 'write'): void {
     // If no permissions defined, allow all (for testing without permission setup)
-    if (this.permissions.length === 0) return;
+    if (true) return;
 
     for (const perm of this.permissions) {
killedBy: AH-VFS-001: permission enforcement allows read but denies write in readonly path
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
vfs/virtual-filesystem.ts:278:9
 
   private checkPermission(normalizedPath: string, op: 'read' | 'write'): void {
     // If no permissions defined, allow all (for testing without permission setup)
-    if (this.permissions.length === 0) return;
+    if (this.permissions.length !== 0) return;
 
     for (const perm of this.permissions) {
killedBy: coverage: VFS methods exists returns false for non-existent
statusReason: VFS: no permission rule for '/workspace/scratch/missing.txt' (default deny)

[Killed] BlockStatement
vfs/virtual-filesystem.ts:280:42
     // If no permissions defined, allow all (for testing without permission setup)
     if (this.permissions.length === 0) return;
 
-    for (const perm of this.permissions) {
-      const prefix = perm.path_prefix.endsWith(sep) ? perm.path_prefix : perm.path_prefix + sep;
-      if (normalizedPath.startsWith(prefix) || normalizedPath === perm.path_prefix) {
-        if (op === 'read' && !perm.read) {
-          throw new Error(`VFS: read denied for '${normalizedPath}' (permission rule)`);
-        }
-        if (op === 'write' && !perm.write) {
-          throw new Error(`VFS: write denied for '${normalizedPath}' (permission rule)`);
-        }
-        return;
-      }
-    }
+    for (const perm of this.permissions) {}
 
     // No matching rule -> default deny
killedBy: AH-VFS-001: permission enforcement allows read and write in allowed path
statusReason: expected [Function] to not throw an error but 'Error: VFS: no permission rule for \'…' was thrown

[Survived] ArithmeticOperator
vfs/virtual-filesystem.ts:281:74
     if (this.permissions.length === 0) return;
 
     for (const perm of this.permissions) {
-      const prefix = perm.path_prefix.endsWith(sep) ? perm.path_prefix : perm.path_prefix + sep;
+      const prefix = perm.path_prefix.endsWith(sep) ? perm.path_prefix : perm.path_prefix - sep;
       if (normalizedPath.startsWith(prefix) || normalizedPath === perm.path_prefix) {
         if (op === 'read' && !perm.read) {

[Survived] MethodExpression
vfs/virtual-filesystem.ts:281:22
     if (this.permissions.length === 0) return;
 
     for (const perm of this.permissions) {
-      const prefix = perm.path_prefix.endsWith(sep) ? perm.path_prefix : perm.path_prefix + sep;
+      const prefix = perm.path_prefix.startsWith(sep) ? perm.path_prefix : perm.path_prefix + sep;
       if (normalizedPath.startsWith(prefix) || normalizedPath === perm.path_prefix) {
         if (op === 'read' && !perm.read) {

[Killed] EqualityOperator
vfs/virtual-filesystem.ts:282:48
 
     for (const perm of this.permissions) {
       const prefix = perm.path_prefix.endsWith(sep) ? perm.path_prefix : perm.path_prefix + sep;
-      if (normalizedPath.startsWith(prefix) || normalizedPath === perm.path_prefix) {
+      if (normalizedPath.startsWith(prefix) || normalizedPath !== perm.path_prefix) {
         if (op === 'read' && !perm.read) {
           throw new Error(`VFS: read denied for '${normalizedPath}' (permission rule)`);
killedBy: mutation-kill: VFS all paths permission denied for unknown path
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
vfs/virtual-filesystem.ts:282:11
 
     for (const perm of this.permissions) {
       const prefix = perm.path_prefix.endsWith(sep) ? perm.path_prefix : perm.path_prefix + sep;
-      if (normalizedPath.startsWith(prefix) || normalizedPath === perm.path_prefix) {
+      if (true) {
         if (op === 'read' && !perm.read) {
           throw new Error(`VFS: read denied for '${normalizedPath}' (permission rule)`);
killedBy: mutation-kill: VFS all paths permission denied for unknown path
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
vfs/virtual-filesystem.ts:283:13
     for (const perm of this.permissions) {
       const prefix = perm.path_prefix.endsWith(sep) ? perm.path_prefix : perm.path_prefix + sep;
       if (normalizedPath.startsWith(prefix) || normalizedPath === perm.path_prefix) {
-        if (op === 'read' && !perm.read) {
+        if (true) {
           throw new Error(`VFS: read denied for '${normalizedPath}' (permission rule)`);
         }
killedBy: AH-VFS-001: permission enforcement allows read and write in allowed path
statusReason: expected [Function] to not throw an error but 'Error: VFS: read denied for \'/worksp…' was thrown

[Killed] BooleanLiteral
vfs/virtual-filesystem.ts:283:30
     for (const perm of this.permissions) {
       const prefix = perm.path_prefix.endsWith(sep) ? perm.path_prefix : perm.path_prefix + sep;
       if (normalizedPath.startsWith(prefix) || normalizedPath === perm.path_prefix) {
-        if (op === 'read' && !perm.read) {
+        if (op === 'read' && perm.read) {
           throw new Error(`VFS: read denied for '${normalizedPath}' (permission rule)`);
         }
killedBy: AH-VFS-001: permission enforcement allows read and write in allowed path
statusReason: VFS: read denied for '/workspace/allowed/test.txt' (permission rule)

[Killed] StringLiteral
vfs/virtual-filesystem.ts:284:27
       const prefix = perm.path_prefix.endsWith(sep) ? perm.path_prefix : perm.path_prefix + sep;
       if (normalizedPath.startsWith(prefix) || normalizedPath === perm.path_prefix) {
         if (op === 'read' && !perm.read) {
-          throw new Error(`VFS: read denied for '${normalizedPath}' (permission rule)`);
+          throw new Error(``);
         }
         if (op === 'write' && !perm.write) {
killedBy: AH-VFS-001: permission enforcement denies both read and write in denied path
statusReason: expected [Function] to throw error matching /permission|denied|read/i but got ''

[Killed] BlockStatement
vfs/virtual-filesystem.ts:286:44
         if (op === 'read' && !perm.read) {
           throw new Error(`VFS: read denied for '${normalizedPath}' (permission rule)`);
         }
-        if (op === 'write' && !perm.write) {
-          throw new Error(`VFS: write denied for '${normalizedPath}' (permission rule)`);
-        }
+        if (op === 'write' && !perm.write) {}
         return;
       }
killedBy: AH-VFS-001: permission enforcement allows read but denies write in readonly path
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
vfs/virtual-filesystem.ts:286:13
         if (op === 'read' && !perm.read) {
           throw new Error(`VFS: read denied for '${normalizedPath}' (permission rule)`);
         }
-        if (op === 'write' && !perm.write) {
+        if (op !== 'write' && !perm.write) {
           throw new Error(`VFS: write denied for '${normalizedPath}' (permission rule)`);
         }
killedBy: AH-VFS-001: permission enforcement allows read but denies write in readonly path
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
vfs/virtual-filesystem.ts:287:27
           throw new Error(`VFS: read denied for '${normalizedPath}' (permission rule)`);
         }
         if (op === 'write' && !perm.write) {
-          throw new Error(`VFS: write denied for '${normalizedPath}' (permission rule)`);
+          throw new Error(``);
         }
         return;
killedBy: AH-VFS-001: permission enforcement allows read but denies write in readonly path
statusReason: expected [Function] to throw error matching /permission|denied|write/i but got ''

[Killed] StringLiteral
vfs/virtual-filesystem.ts:294:21
     }
 
     // No matching rule -> default deny
-    throw new Error(`VFS: no permission rule for '${normalizedPath}' (default deny)`);
+    throw new Error(``);
   }
 
killedBy: AH-VFS-001: permission enforcement denies access to paths without matching permission rule (default deny)
statusReason: expected [Function] to throw error matching /permission|denied|no.*rule/i but got ''

[Killed] BlockStatement
vfs/virtual-filesystem.ts:297:48
     throw new Error(`VFS: no permission rule for '${normalizedPath}' (default deny)`);
   }
 
-  private hashContent(content: string): string {
-    return createHash('sha256').update(content).digest('hex');
-  }
+  private hashContent(content: string): string {}
 }
 
killedBy: AH-TOOLS-001: all nine tools through VFS/Sandbox write_file writes through VFS with version
statusReason: expected undefined to be truthy

[Killed] StringLiteral
vfs/virtual-filesystem.ts:298:23
   }
 
   private hashContent(content: string): string {
-    return createHash('sha256').update(content).digest('hex');
+    return createHash("").update(content).digest('hex');
   }
 }
killedBy: AH-VFS-001: overlay read/write writes and reads a file in overlay
statusReason: Digest method not supported
