[Killed] MethodExpression
personal_assistant/ah_pa_vertical_001.ts:17:18
 export function runPAVertical(input: PAVerticalInput): PAVerticalResult {
   // Sort by priority then duration
   const priorityRank = { high: 0, medium: 1, low: 2 };
-  const sorted = [...input.tasks].sort((a, b) => {
-    const pr = priorityRank[a.priority] - priorityRank[b.priority];
-    if (pr !== 0) return pr;
-    return b.duration_minutes - a.duration_minutes;
-  });
+  const sorted = [...input.tasks];
 
   const schedule: PAVerticalResult['schedule'] = [];
killedBy: precision: personal assistant exact schedule schedules tasks in priority order with exact times
statusReason: expected 'low' to be 'high' // Object.is equality

[Killed] BlockStatement
personal_assistant/ah_pa_vertical_001.ts:17:50
 export function runPAVertical(input: PAVerticalInput): PAVerticalResult {
   // Sort by priority then duration
   const priorityRank = { high: 0, medium: 1, low: 2 };
-  const sorted = [...input.tasks].sort((a, b) => {
-    const pr = priorityRank[a.priority] - priorityRank[b.priority];
-    if (pr !== 0) return pr;
-    return b.duration_minutes - a.duration_minutes;
-  });
+  const sorted = [...input.tasks].sort((a, b) => {});
 
   const schedule: PAVerticalResult['schedule'] = [];
killedBy: precision: personal assistant exact schedule schedules tasks in priority order with exact times
statusReason: expected 'low' to be 'high' // Object.is equality

[Killed] ArithmeticOperator
personal_assistant/ah_pa_vertical_001.ts:18:16
   // Sort by priority then duration
   const priorityRank = { high: 0, medium: 1, low: 2 };
   const sorted = [...input.tasks].sort((a, b) => {
-    const pr = priorityRank[a.priority] - priorityRank[b.priority];
+    const pr = priorityRank[a.priority] + priorityRank[b.priority];
     if (pr !== 0) return pr;
     return b.duration_minutes - a.duration_minutes;
killedBy: precision: personal assistant exact schedule schedules tasks in priority order with exact times
statusReason: expected 'low' to be 'high' // Object.is equality

[Killed] EqualityOperator
personal_assistant/ah_pa_vertical_001.ts:19:9
   const priorityRank = { high: 0, medium: 1, low: 2 };
   const sorted = [...input.tasks].sort((a, b) => {
     const pr = priorityRank[a.priority] - priorityRank[b.priority];
-    if (pr !== 0) return pr;
+    if (pr === 0) return pr;
     return b.duration_minutes - a.duration_minutes;
   });
killedBy: precision: personal assistant exact schedule schedules tasks in priority order with exact times
statusReason: expected 'low' to be 'high' // Object.is equality

[Killed] ConditionalExpression
personal_assistant/ah_pa_vertical_001.ts:19:9
   const priorityRank = { high: 0, medium: 1, low: 2 };
   const sorted = [...input.tasks].sort((a, b) => {
     const pr = priorityRank[a.priority] - priorityRank[b.priority];
-    if (pr !== 0) return pr;
+    if (false) return pr;
     return b.duration_minutes - a.duration_minutes;
   });
killedBy: precision: personal assistant exact schedule schedules tasks in priority order with exact times
statusReason: expected 'low' to be 'high' // Object.is equality

[NoCoverage] ArithmeticOperator
personal_assistant/ah_pa_vertical_001.ts:20:12
   const sorted = [...input.tasks].sort((a, b) => {
     const pr = priorityRank[a.priority] - priorityRank[b.priority];
     if (pr !== 0) return pr;
-    return b.duration_minutes - a.duration_minutes;
+    return b.duration_minutes + a.duration_minutes;
   });
 

[Killed] BlockStatement
personal_assistant/ah_pa_vertical_001.ts:27:30
   const unscheduled: string[] = [];
   let currentTime = 0;
 
-  for (const task of sorted) {
-    if (currentTime + task.duration_minutes <= input.available_minutes) {
-      schedule.push({
-        task_id: task.id,
-        title: task.title,
-        start_minute: currentTime,
-        duration_minutes: task.duration_minutes,
-      });
-      currentTime += task.duration_minutes;
-    } else {
-      unscheduled.push(task.id);
-    }
-  }
+  for (const task of sorted) {}
 
   return {
killedBy: precision: personal assistant exact schedule schedules tasks in priority order with exact times
statusReason: Cannot read properties of undefined (reading 'task_id')

[Killed] EqualityOperator
personal_assistant/ah_pa_vertical_001.ts:28:9
   let currentTime = 0;
 
   for (const task of sorted) {
-    if (currentTime + task.duration_minutes <= input.available_minutes) {
+    if (currentTime + task.duration_minutes < input.available_minutes) {
       schedule.push({
         task_id: task.id,
killedBy: precision: personal assistant exact schedule schedules tasks in priority order with exact times
statusReason: Cannot read properties of undefined (reading 'task_id')

[Killed] EqualityOperator
personal_assistant/ah_pa_vertical_001.ts:28:9
   let currentTime = 0;
 
   for (const task of sorted) {
-    if (currentTime + task.duration_minutes <= input.available_minutes) {
+    if (currentTime + task.duration_minutes > input.available_minutes) {
       schedule.push({
         task_id: task.id,
killedBy: precision: personal assistant exact schedule schedules tasks in priority order with exact times
statusReason: Cannot read properties of undefined (reading 'task_id')

[Killed] AssignmentOperator
personal_assistant/ah_pa_vertical_001.ts:35:7
         start_minute: currentTime,
         duration_minutes: task.duration_minutes,
       });
-      currentTime += task.duration_minutes;
+      currentTime -= task.duration_minutes;
     } else {
       unscheduled.push(task.id);
killedBy: precision: personal assistant exact schedule schedules tasks in priority order with exact times
statusReason: expected -30 to be 30 // Object.is equality

[Killed] BlockStatement
personal_assistant/ah_pa_vertical_001.ts:36:12
         duration_minutes: task.duration_minutes,
       });
       currentTime += task.duration_minutes;
-    } else {
-      unscheduled.push(task.id);
-    }
+    } else {}
   }
 
killedBy: AH-VERTICALS: six product verticals personal assistant: unschedules when over budget
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BooleanLiteral
personal_assistant/ah_pa_vertical_001.ts:44:16
   return {
     schedule,
     unscheduled,
-    conflicts: false, // No conflicts in a linear schedule
+    conflicts: true, // No conflicts in a linear schedule
     total_scheduled_minutes: currentTime,
   };
killedBy: precision: personal assistant exact schedule schedules tasks in priority order with exact times
statusReason: expected true to be false // Object.is equality
