[Survived] StringLiteral
security/authorization-service.ts:71:67
 // Authorization Service
 // ---------------------------------------------------------------------------
 
-const VALID_EFFECTS: AuthzEffect[] = ['read', 'write', 'execute', 'delete'];
+const VALID_EFFECTS: AuthzEffect[] = ['read', 'write', 'execute', ""];
 
 export class AuthorizationService {

[Killed] BlockStatement
security/authorization-service.ts:80:54
   private readonly denies = new Map<string, boolean>();
   private readonly capabilityService: CapabilityService;
 
-  constructor(capabilityService?: CapabilityService) {
-    this.capabilityService = capabilityService ?? new CapabilityService();
-  }
+  constructor(capabilityService?: CapabilityService) {}
 
   authorize(req: AuthzRequest): AuthzDecision {
killedBy: coverage: AuthorizationService methods getCapabilityService returns the service
statusReason: expected undefined to be defined

[Killed] LogicalOperator
security/authorization-service.ts:81:30
   private readonly capabilityService: CapabilityService;
 
   constructor(capabilityService?: CapabilityService) {
-    this.capabilityService = capabilityService ?? new CapabilityService();
+    this.capabilityService = capabilityService && new CapabilityService();
   }
 
killedBy: coverage: AuthorizationService methods getCapabilityService returns the service
statusReason: expected undefined to be defined

[Killed] BlockStatement
security/authorization-service.ts:88:46
     const now = new Date().toISOString();
 
     // Validate effect
-    if (!VALID_EFFECTS.includes(req.effect)) {
-      return this.makeDeny(req, ['unknown effect: ' + req.effect], now);
-    }
+    if (!VALID_EFFECTS.includes(req.effect)) {}
 
     // Cross-tenant check
killedBy: AH-AUTHZ-001: authorization service unknown effect is denied
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
security/authorization-service.ts:88:9
     const now = new Date().toISOString();
 
     // Validate effect
-    if (!VALID_EFFECTS.includes(req.effect)) {
+    if (true) {
       return this.makeDeny(req, ['unknown effect: ' + req.effect], now);
     }
killedBy: AH-AUTHZ-001: authorization service allows owner to read own resource
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
security/authorization-service.ts:93:9
     }
 
     // Cross-tenant check
-    if (req.subject.tenant_id !== req.resource.tenant_id) {
+    if (true) {
       return this.makeDeny(req, ['tenant mismatch'], now);
     }
killedBy: AH-AUTHZ-001: authorization service allows owner to read own resource
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
security/authorization-service.ts:93:9
     }
 
     // Cross-tenant check
-    if (req.subject.tenant_id !== req.resource.tenant_id) {
+    if (req.subject.tenant_id === req.resource.tenant_id) {
       return this.makeDeny(req, ['tenant mismatch'], now);
     }
killedBy: mutation-kill: authz all paths admin role grants wildcard
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
security/authorization-service.ts:99:35
 
     // Check explicit deny first (deny overrides allow)
     const denyKey = this.grantKey(req.subject.user_id, req.resource.id, req.effect);
-    if (this.denies.has(denyKey)) {
-      return this.makeDeny(req, ['explicit deny rule'], now);
-    }
+    if (this.denies.has(denyKey)) {}
 
     // Check resource policy (allowed effects)
killedBy: AH-AUTHZ-001: authorization service explicit deny rule overrides allow
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
security/authorization-service.ts:99:9
 
     // Check explicit deny first (deny overrides allow)
     const denyKey = this.grantKey(req.subject.user_id, req.resource.id, req.effect);
-    if (this.denies.has(denyKey)) {
+    if (false) {
       return this.makeDeny(req, ['explicit deny rule'], now);
     }
killedBy: AH-AUTHZ-001: authorization service explicit deny rule overrides allow
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
security/authorization-service.ts:105:9
 
     // Check resource policy (allowed effects)
     const resourcePolicy = this.resourcePolicies.get(req.resource.type);
-    if (resourcePolicy && !resourcePolicy.allowed_effects.includes(req.effect)) {
+    if (false) {
       return this.makeDeny(req, [`effect '${req.effect}' not allowed for resource type '${req.resource.type}'`], now);
     }
killedBy: AH-AUTHZ-001: authorization service denies write to read-only resource
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
security/authorization-service.ts:105:9
 
     // Check resource policy (allowed effects)
     const resourcePolicy = this.resourcePolicies.get(req.resource.type);
-    if (resourcePolicy && !resourcePolicy.allowed_effects.includes(req.effect)) {
+    if (resourcePolicy || !resourcePolicy.allowed_effects.includes(req.effect)) {
       return this.makeDeny(req, [`effect '${req.effect}' not allowed for resource type '${req.resource.type}'`], now);
     }
killedBy: coverage: AuthorizationService methods revokeGrant removes access
statusReason: Cannot read properties of undefined (reading 'allowed_effects')

[Killed] BlockStatement
security/authorization-service.ts:110:43
     }
 
     // Check wildcard role (admin)
-    for (const role of req.subject.roles) {
-      const rolePolicy = this.rolePolicies.get(role);
-      if (rolePolicy?.wildcard_access) {
-        return this.makeAllow(req, [`role '${role}' has wildcard access`], now);
-      }
-    }
+    for (const role of req.subject.roles) {}
 
     // Owner can access own resources
killedBy: AH-AUTHZ-001: authorization service admin role can access any resource in tenant
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
security/authorization-service.ts:112:11
     // Check wildcard role (admin)
     for (const role of req.subject.roles) {
       const rolePolicy = this.rolePolicies.get(role);
-      if (rolePolicy?.wildcard_access) {
+      if (false) {
         return this.makeAllow(req, [`role '${role}' has wildcard access`], now);
       }
killedBy: AH-AUTHZ-001: authorization service admin role can access any resource in tenant
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
security/authorization-service.ts:112:11
     // Check wildcard role (admin)
     for (const role of req.subject.roles) {
       const rolePolicy = this.rolePolicies.get(role);
-      if (rolePolicy?.wildcard_access) {
+      if (true) {
         return this.makeAllow(req, [`role '${role}' has wildcard access`], now);
       }
killedBy: AH-AUTHZ-001: authorization service denies non-owner read when no explicit grant
statusReason: expected true to be false // Object.is equality

[Survived] ArrayDeclaration
security/authorization-service.ts:113:36
     for (const role of req.subject.roles) {
       const rolePolicy = this.rolePolicies.get(role);
       if (rolePolicy?.wildcard_access) {
-        return this.makeAllow(req, [`role '${role}' has wildcard access`], now);
+        return this.makeAllow(req, [], now);
       }
     }

[Survived] StringLiteral
security/authorization-service.ts:113:37
     for (const role of req.subject.roles) {
       const rolePolicy = this.rolePolicies.get(role);
       if (rolePolicy?.wildcard_access) {
-        return this.makeAllow(req, [`role '${role}' has wildcard access`], now);
+        return this.makeAllow(req, [``], now);
       }
     }

[Killed] EqualityOperator
security/authorization-service.ts:118:9
     }
 
     // Owner can access own resources
-    if (req.subject.user_id === req.resource.owner) {
+    if (req.subject.user_id !== req.resource.owner) {
       return this.makeAllow(req, ['subject is resource owner'], now);
     }
killedBy: AH-AUTHZ-001: authorization service allows owner to read own resource
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
security/authorization-service.ts:118:9
     }
 
     // Owner can access own resources
-    if (req.subject.user_id === req.resource.owner) {
+    if (true) {
       return this.makeAllow(req, ['subject is resource owner'], now);
     }
killedBy: AH-AUTHZ-001: authorization service denies non-owner read when no explicit grant
statusReason: expected true to be false // Object.is equality

[Survived] StringLiteral
security/authorization-service.ts:119:35
 
     // Owner can access own resources
     if (req.subject.user_id === req.resource.owner) {
-      return this.makeAllow(req, ['subject is resource owner'], now);
+      return this.makeAllow(req, [""], now);
     }
 

[Killed] ConditionalExpression
security/authorization-service.ts:123:9
     }
 
     // Check explicit grants
-    if (this.grants.has(denyKey)) {
+    if (true) {
       return this.makeAllow(req, ['explicit grant'], now);
     }
killedBy: AH-AUTHZ-001: authorization service denies non-owner read when no explicit grant
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
security/authorization-service.ts:123:9
     }
 
     // Check explicit grants
-    if (this.grants.has(denyKey)) {
+    if (false) {
       return this.makeAllow(req, ['explicit grant'], now);
     }
killedBy: AH-AUTHZ-001: authorization service explicit allow grant for non-owner works
statusReason: expected false to be true // Object.is equality

[Survived] StringLiteral
security/authorization-service.ts:128:32
     }
 
     // Default deny
-    return this.makeDeny(req, ['no matching allow rule (deny by default)'], now);
+    return this.makeDeny(req, [""], now);
   }
 

[Survived] ArrayDeclaration
security/authorization-service.ts:128:31
     }
 
     // Default deny
-    return this.makeDeny(req, ['no matching allow rule (deny by default)'], now);
+    return this.makeDeny(req, [], now);
   }
 

[Killed] BlockStatement
security/authorization-service.ts:131:78
     return this.makeDeny(req, ['no matching allow rule (deny by default)'], now);
   }
 
-  registerResourcePolicy(resourceType: string, policy: ResourcePolicy): void {
-    this.resourcePolicies.set(resourceType, { ...policy });
-  }
+  registerResourcePolicy(resourceType: string, policy: ResourcePolicy): void {}
 
   registerRolePolicy(role: string, policy: RolePolicy): void {
killedBy: AH-AUTHZ-001: authorization service denies write to read-only resource
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
security/authorization-service.ts:135:62
     this.resourcePolicies.set(resourceType, { ...policy });
   }
 
-  registerRolePolicy(role: string, policy: RolePolicy): void {
-    this.rolePolicies.set(role, { ...policy });
-  }
+  registerRolePolicy(role: string, policy: RolePolicy): void {}
 
   grant(userId: string, resourceId: string, effect: AuthzEffect): void {
killedBy: AH-AUTHZ-001: authorization service admin role can access any resource in tenant
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
security/authorization-service.ts:139:72
     this.rolePolicies.set(role, { ...policy });
   }
 
-  grant(userId: string, resourceId: string, effect: AuthzEffect): void {
-    const key = this.grantKey(userId, resourceId, effect);
-    this.grants.set(key, true);
-    // Remove any existing deny
-    this.denies.delete(key);
-  }
+  grant(userId: string, resourceId: string, effect: AuthzEffect): void {}
 
   deny(userId: string, resourceId: string, effect: AuthzEffect): void {
killedBy: AH-AUTHZ-001: authorization service explicit allow grant for non-owner works
statusReason: expected false to be true // Object.is equality

[Survived] BooleanLiteral
security/authorization-service.ts:141:26
 
   grant(userId: string, resourceId: string, effect: AuthzEffect): void {
     const key = this.grantKey(userId, resourceId, effect);
-    this.grants.set(key, true);
+    this.grants.set(key, false);
     // Remove any existing deny
     this.denies.delete(key);

[Killed] BlockStatement
security/authorization-service.ts:146:71
     this.denies.delete(key);
   }
 
-  deny(userId: string, resourceId: string, effect: AuthzEffect): void {
-    const key = this.grantKey(userId, resourceId, effect);
-    this.denies.set(key, true);
-  }
+  deny(userId: string, resourceId: string, effect: AuthzEffect): void {}
 
   revokeGrant(userId: string, resourceId: string, effect: AuthzEffect): void {
killedBy: AH-AUTHZ-001: authorization service explicit deny rule overrides allow
statusReason: expected true to be false // Object.is equality

[Survived] BooleanLiteral
security/authorization-service.ts:148:26
 
   deny(userId: string, resourceId: string, effect: AuthzEffect): void {
     const key = this.grantKey(userId, resourceId, effect);
-    this.denies.set(key, true);
+    this.denies.set(key, false);
   }
 

[Killed] BlockStatement
security/authorization-service.ts:151:78
     this.denies.set(key, true);
   }
 
-  revokeGrant(userId: string, resourceId: string, effect: AuthzEffect): void {
-    const key = this.grantKey(userId, resourceId, effect);
-    this.grants.delete(key);
-  }
+  revokeGrant(userId: string, resourceId: string, effect: AuthzEffect): void {}
 
   getCapabilityService(): CapabilityService {
killedBy: AH-AUTHZ-001: authorization service revoking a grant removes access
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
security/authorization-service.ts:156:45
     this.grants.delete(key);
   }
 
-  getCapabilityService(): CapabilityService {
-    return this.capabilityService;
-  }
+  getCapabilityService(): CapabilityService {}
 
   private makeAllow(req: AuthzRequest, reasons: string[], now: string): AuthzDecision {
killedBy: coverage: AuthorizationService methods getCapabilityService returns the service
statusReason: expected undefined to be defined

[Killed] BlockStatement
security/authorization-service.ts:160:87
     return this.capabilityService;
   }
 
-  private makeAllow(req: AuthzRequest, reasons: string[], now: string): AuthzDecision {
-    return {
-      allowed: true,
-      reasons,
-      subject_id: req.subject.user_id,
-      resource_id: req.resource.id,
-      effect: req.effect,
-      run_id: req.run_id,
-      step_id: req.step_id,
-      attempt_id: req.attempt_id,
-      decided_at: now,
-    };
-  }
+  private makeAllow(req: AuthzRequest, reasons: string[], now: string): AuthzDecision {}
 
   private makeDeny(req: AuthzRequest, reasons: string[], now: string): AuthzDecision {
killedBy: AH-AUTHZ-001: authorization service allows owner to read own resource
statusReason: Cannot read properties of undefined (reading 'allowed')

[Killed] ObjectLiteral
security/authorization-service.ts:161:12
   }
 
   private makeAllow(req: AuthzRequest, reasons: string[], now: string): AuthzDecision {
-    return {
-      allowed: true,
-      reasons,
-      subject_id: req.subject.user_id,
-      resource_id: req.resource.id,
-      effect: req.effect,
-      run_id: req.run_id,
-      step_id: req.step_id,
-      attempt_id: req.attempt_id,
-      decided_at: now,
-    };
+    return {};
   }
 
killedBy: AH-AUTHZ-001: authorization service allows owner to read own resource
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
security/authorization-service.ts:174:86
     };
   }
 
-  private makeDeny(req: AuthzRequest, reasons: string[], now: string): AuthzDecision {
-    return {
-      allowed: false,
-      reasons,
-      subject_id: req.subject.user_id,
-      resource_id: req.resource.id,
-      effect: req.effect,
-      run_id: req.run_id,
-      step_id: req.step_id,
-      attempt_id: req.attempt_id,
-      decided_at: now,
-    };
-  }
+  private makeDeny(req: AuthzRequest, reasons: string[], now: string): AuthzDecision {}
 
   private grantKey(userId: string, resourceId: string, effect: AuthzEffect): string {
killedBy: AH-AUTHZ-001: authorization service denies non-owner read when no explicit grant
statusReason: Cannot read properties of undefined (reading 'allowed')

[Survived] BlockStatement
security/authorization-service.ts:188:85
     };
   }
 
-  private grantKey(userId: string, resourceId: string, effect: AuthzEffect): string {
-    return `${userId}:${resourceId}:${effect}`;
-  }
+  private grantKey(userId: string, resourceId: string, effect: AuthzEffect): string {}
 }
 

[Survived] StringLiteral
security/authorization-service.ts:189:12
   }
 
   private grantKey(userId: string, resourceId: string, effect: AuthzEffect): string {
-    return `${userId}:${resourceId}:${effect}`;
+    return ``;
   }
 }
