[Killed] BlockStatement
research/ah_research_vertical_001.ts:15:115
   summary: string;
 }
 
-export function runResearchVertical(vfs: VirtualFilesystem, input: ResearchVerticalInput): ResearchVerticalResult {
-  const search = searchFiles(vfs, { directory: input.source_directory, pattern: input.research_question.split(' ')[0] || 'topic' });
-  const claims = search.matches.map((m) => ({
-    source: m.file,
-    claim: m.line,
-    citation: `${m.file}:${m.line_number}`,
-  }));
-  return { claims, summary: `Found ${claims.length} relevant sources for: ${input.research_question}` };
-}
+export function runResearchVertical(vfs: VirtualFilesystem, input: ResearchVerticalInput): ResearchVerticalResult {}
 
killedBy: precision: research vertical exact claims returns claims with exact source and line
statusReason: Cannot read properties of undefined (reading 'claims')

[Killed] ConditionalExpression
research/ah_research_vertical_001.ts:16:81
 }
 
 export function runResearchVertical(vfs: VirtualFilesystem, input: ResearchVerticalInput): ResearchVerticalResult {
-  const search = searchFiles(vfs, { directory: input.source_directory, pattern: input.research_question.split(' ')[0] || 'topic' });
+  const search = searchFiles(vfs, { directory: input.source_directory, pattern: true });
   const claims = search.matches.map((m) => ({
     source: m.file,
killedBy: precision: research vertical exact claims returns claims with exact source and line
statusReason: input.pattern.replace is not a function

[Killed] ConditionalExpression
research/ah_research_vertical_001.ts:16:81
 }
 
 export function runResearchVertical(vfs: VirtualFilesystem, input: ResearchVerticalInput): ResearchVerticalResult {
-  const search = searchFiles(vfs, { directory: input.source_directory, pattern: input.research_question.split(' ')[0] || 'topic' });
+  const search = searchFiles(vfs, { directory: input.source_directory, pattern: false });
   const claims = search.matches.map((m) => ({
     source: m.file,
killedBy: AH-VERTICALS: six product verticals research: reads sources, organizes claims
statusReason: input.pattern.replace is not a function

[Killed] ArrowFunction
research/ah_research_vertical_001.ts:17:37
 
 export function runResearchVertical(vfs: VirtualFilesystem, input: ResearchVerticalInput): ResearchVerticalResult {
   const search = searchFiles(vfs, { directory: input.source_directory, pattern: input.research_question.split(' ')[0] || 'topic' });
-  const claims = search.matches.map((m) => ({
-    source: m.file,
-    claim: m.line,
-    citation: `${m.file}:${m.line_number}`,
-  }));
+  const claims = search.matches.map(() => undefined);
   return { claims, summary: `Found ${claims.length} relevant sources for: ${input.research_question}` };
 }
killedBy: precision: research vertical exact claims returns claims with exact source and line
statusReason: Cannot read properties of undefined (reading 'source')

[Killed] StringLiteral
research/ah_research_vertical_001.ts:20:15
   const claims = search.matches.map((m) => ({
     source: m.file,
     claim: m.line,
-    citation: `${m.file}:${m.line_number}`,
+    citation: ``,
   }));
   return { claims, summary: `Found ${claims.length} relevant sources for: ${input.research_question}` };
killedBy: precision: research vertical exact claims returns claims with exact source and line
statusReason: expected '' to contain '/sources/a.txt:'
