[Killed] MethodExpression
router/intent-profiler.ts:29:18
 }
 
 export function profileIntent(input: ProfilerInput): TaskFeatures {
-  const prompt = input.prompt.toLowerCase();
+  const prompt = input.prompt.toUpperCase();
   const tools = input.available_tools ?? [];
 
killedBy: precision: static-router exact decisions file transaction -> plan_execute + MULTI_STEP_OR_TRANSACTIONAL
statusReason: expected 'direct' to be 'plan_execute' // Object.is equality

[Killed] LogicalOperator
router/intent-profiler.ts:30:17
 
 export function profileIntent(input: ProfilerInput): TaskFeatures {
   const prompt = input.prompt.toLowerCase();
-  const tools = input.available_tools ?? [];
+  const tools = input.available_tools && [];
 
   // Detect tool need
killedBy: precision: static-router exact decisions simple greeting -> direct + SINGLE_STEP_NO_TOOLS
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] StringLiteral
router/intent-profiler.ts:33:33
   const tools = input.available_tools ?? [];
 
   // Detect tool need
-  const toolKeywords = ['read', 'write', 'edit', 'search', 'execute', 'run', 'create', 'list', 'parse', 'ask'];
+  const toolKeywords = ['read', "", 'edit', 'search', 'execute', 'run', 'create', 'list', 'parse', 'ask'];
   const needsTools = toolKeywords.some((kw) => prompt.includes(kw)) || tools.length > 0;
 
killedBy: precision: static-router exact decisions simple greeting -> direct + SINGLE_STEP_NO_TOOLS
statusReason: expected 'react' to be 'direct' // Object.is equality

[Killed] StringLiteral
router/intent-profiler.ts:33:88
   const tools = input.available_tools ?? [];
 
   // Detect tool need
-  const toolKeywords = ['read', 'write', 'edit', 'search', 'execute', 'run', 'create', 'list', 'parse', 'ask'];
+  const toolKeywords = ['read', 'write', 'edit', 'search', 'execute', 'run', 'create', "", 'parse', 'ask'];
   const needsTools = toolKeywords.some((kw) => prompt.includes(kw)) || tools.length > 0;
 
killedBy: precision: static-router exact decisions simple greeting -> direct + SINGLE_STEP_NO_TOOLS
statusReason: expected 'react' to be 'direct' // Object.is equality

[Killed] LogicalOperator
router/intent-profiler.ts:34:22
 
   // Detect tool need
   const toolKeywords = ['read', 'write', 'edit', 'search', 'execute', 'run', 'create', 'list', 'parse', 'ask'];
-  const needsTools = toolKeywords.some((kw) => prompt.includes(kw)) || tools.length > 0;
+  const needsTools = toolKeywords.some(kw => prompt.includes(kw)) && tools.length > 0;
 
   // Count tool mentions
killedBy: mutation-kill: router all decision paths routes uncertain tool use to react
statusReason: expected 'direct' to be 'react' // Object.is equality

[Killed] ConditionalExpression
router/intent-profiler.ts:34:22
 
   // Detect tool need
   const toolKeywords = ['read', 'write', 'edit', 'search', 'execute', 'run', 'create', 'list', 'parse', 'ask'];
-  const needsTools = toolKeywords.some((kw) => prompt.includes(kw)) || tools.length > 0;
+  const needsTools = false;
 
   // Count tool mentions
killedBy: precision: static-router exact decisions uncertain tool use -> react + OBSERVATION_DEPENDENT
statusReason: expected 'direct' to be 'react' // Object.is equality

[Survived] BlockStatement
router/intent-profiler.ts:38:29
 
   // Count tool mentions
   let toolCount = 0;
-  for (const tool of tools) {
-    if (prompt.includes(tool.toLowerCase())) toolCount++;
-  }
+  for (const tool of tools) {}
   if (toolCount === 0 && needsTools) toolCount = 1;
 

[Survived] ConditionalExpression
router/intent-profiler.ts:39:9
   // Count tool mentions
   let toolCount = 0;
   for (const tool of tools) {
-    if (prompt.includes(tool.toLowerCase())) toolCount++;
+    if (false) toolCount++;
   }
   if (toolCount === 0 && needsTools) toolCount = 1;

[NoCoverage] UpdateOperator
router/intent-profiler.ts:39:46
   // Count tool mentions
   let toolCount = 0;
   for (const tool of tools) {
-    if (prompt.includes(tool.toLowerCase())) toolCount++;
+    if (prompt.includes(tool.toLowerCase())) toolCount--;
   }
   if (toolCount === 0 && needsTools) toolCount = 1;

[Killed] ConditionalExpression
router/intent-profiler.ts:41:7
   for (const tool of tools) {
     if (prompt.includes(tool.toLowerCase())) toolCount++;
   }
-  if (toolCount === 0 && needsTools) toolCount = 1;
+  if (true) toolCount = 1;
 
   // Detect dependencies (multiple steps)
killedBy: precision: intent-profiler exact values simple prompt: exact feature set
statusReason: expected 1 to be +0 // Object.is equality

[Killed] EqualityOperator
router/intent-profiler.ts:41:7
   for (const tool of tools) {
     if (prompt.includes(tool.toLowerCase())) toolCount++;
   }
-  if (toolCount === 0 && needsTools) toolCount = 1;
+  if (toolCount !== 0 && needsTools) toolCount = 1;
 
   // Detect dependencies (multiple steps)
killedBy: precision: intent-profiler exact values read file: exact feature set
statusReason: expected +0 to be 1 // Object.is equality

[Killed] MethodExpression
router/intent-profiler.ts:45:27
 
   // Detect dependencies (multiple steps)
   const dependencyKeywords = ['then', 'after', 'depends', 'first', 'next', 'finally', 'before'];
-  const dependencyCount = dependencyKeywords.filter((kw) => prompt.includes(kw)).length;
+  const dependencyCount = dependencyKeywords.length;
 
   // Detect effect risk
killedBy: AH-RUNTIME-GUARD: GuardedToolExecutor enforcement direct strategy with no tool executor works
statusReason: expected 'plan_execute' to be 'direct' // Object.is equality

[Killed] ArrowFunction
router/intent-profiler.ts:45:53
 
   // Detect dependencies (multiple steps)
   const dependencyKeywords = ['then', 'after', 'depends', 'first', 'next', 'finally', 'before'];
-  const dependencyCount = dependencyKeywords.filter((kw) => prompt.includes(kw)).length;
+  const dependencyCount = dependencyKeywords.filter(() => undefined).length;
 
   // Detect effect risk
killedBy: precision: intent-profiler exact values steps from 3 dependencies: exact value
statusReason: expected +0 to be 3 // Object.is equality

[Killed] StringLiteral
router/intent-profiler.ts:48:49
   const dependencyCount = dependencyKeywords.filter((kw) => prompt.includes(kw)).length;
 
   // Detect effect risk
-  let effectRisk: TaskFeatures['effect_risk'] = 'none';
+  let effectRisk: TaskFeatures['effect_risk'] = "";
   if (/\b(delete|remove|destroy|execute|purchase|publish|send)\b/.test(prompt)) {
     effectRisk = 'high';
killedBy: precision: intent-profiler exact values simple prompt: exact feature set
statusReason: expected '' to be 'none' // Object.is equality

[Killed] ConditionalExpression
router/intent-profiler.ts:49:7
 
   // Detect effect risk
   let effectRisk: TaskFeatures['effect_risk'] = 'none';
-  if (/\b(delete|remove|destroy|execute|purchase|publish|send)\b/.test(prompt)) {
+  if (true) {
     effectRisk = 'high';
   } else if (/\b(write|edit|modify|update|create|install)\b/.test(prompt)) {
killedBy: AH-RUNTIME-GUARD: GuardedToolExecutor enforcement tool call succeeds when policy allows and capability+PEP pass
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
router/intent-profiler.ts:49:81
 
   // Detect effect risk
   let effectRisk: TaskFeatures['effect_risk'] = 'none';
-  if (/\b(delete|remove|destroy|execute|purchase|publish|send)\b/.test(prompt)) {
-    effectRisk = 'high';
-  } else if (/\b(write|edit|modify|update|create|install)\b/.test(prompt)) {
+  if (/\b(delete|remove|destroy|execute|purchase|publish|send)\b/.test(prompt)) {} else if (/\b(write|edit|modify|update|create|install)\b/.test(prompt)) {
     effectRisk = 'medium';
   } else if (/\b(read|list|search|view|show)\b/.test(prompt)) {
killedBy: precision: static-router exact decisions high risk uncertain -> deny + HIGH_RISK_UNCERTAIN
statusReason: expected 'plan_execute' to be 'deny' // Object.is equality

[Killed] StringLiteral
router/intent-profiler.ts:50:18
   // Detect effect risk
   let effectRisk: TaskFeatures['effect_risk'] = 'none';
   if (/\b(delete|remove|destroy|execute|purchase|publish|send)\b/.test(prompt)) {
-    effectRisk = 'high';
+    effectRisk = "";
   } else if (/\b(write|edit|modify|update|create|install)\b/.test(prompt)) {
     effectRisk = 'medium';
killedBy: precision: static-router exact decisions high risk uncertain -> deny + HIGH_RISK_UNCERTAIN
statusReason: expected 'plan_execute' to be 'deny' // Object.is equality

[Killed] ConditionalExpression
router/intent-profiler.ts:51:14
   let effectRisk: TaskFeatures['effect_risk'] = 'none';
   if (/\b(delete|remove|destroy|execute|purchase|publish|send)\b/.test(prompt)) {
     effectRisk = 'high';
-  } else if (/\b(write|edit|modify|update|create|install)\b/.test(prompt)) {
+  } else if (true) {
     effectRisk = 'medium';
   } else if (/\b(read|list|search|view|show)\b/.test(prompt)) {
killedBy: precision: intent-profiler exact values simple prompt: exact feature set
statusReason: expected 'medium' to be 'none' // Object.is equality

[Killed] ConditionalExpression
router/intent-profiler.ts:51:14
   let effectRisk: TaskFeatures['effect_risk'] = 'none';
   if (/\b(delete|remove|destroy|execute|purchase|publish|send)\b/.test(prompt)) {
     effectRisk = 'high';
-  } else if (/\b(write|edit|modify|update|create|install)\b/.test(prompt)) {
+  } else if (false) {
     effectRisk = 'medium';
   } else if (/\b(read|list|search|view|show)\b/.test(prompt)) {
killedBy: precision: intent-profiler exact values write file: exact risk
statusReason: expected 'none' to be 'medium' // Object.is equality

[Killed] ConditionalExpression
router/intent-profiler.ts:53:14
     effectRisk = 'high';
   } else if (/\b(write|edit|modify|update|create|install)\b/.test(prompt)) {
     effectRisk = 'medium';
-  } else if (/\b(read|list|search|view|show)\b/.test(prompt)) {
+  } else if (true) {
     effectRisk = 'low';
   }
killedBy: precision: intent-profiler exact values simple prompt: exact feature set
statusReason: expected 'low' to be 'none' // Object.is equality

[Killed] ConditionalExpression
router/intent-profiler.ts:53:14
     effectRisk = 'high';
   } else if (/\b(write|edit|modify|update|create|install)\b/.test(prompt)) {
     effectRisk = 'medium';
-  } else if (/\b(read|list|search|view|show)\b/.test(prompt)) {
+  } else if (false) {
     effectRisk = 'low';
   }
killedBy: precision: intent-profiler exact values read file: exact feature set
statusReason: expected 'none' to be 'low' // Object.is equality

[Killed] ConditionalExpression
router/intent-profiler.ts:61:35
   const requiresInteraction = /\b(ask|prompt|confirm|approve|choose|select)\b/.test(prompt);
 
   // Detect file transaction
-  const requiresFileTransaction = /\b(file|directory|path|repository|code|source)\b/.test(prompt)
-    || (needsTools && (prompt.includes('write') || prompt.includes('edit')));
+  const requiresFileTransaction = false;
 
   // Estimate uncertainty
killedBy: precision: static-router exact decisions file transaction -> plan_execute + MULTI_STEP_OR_TRANSACTIONAL
statusReason: expected 'react' to be 'plan_execute' // Object.is equality

[Killed] LogicalOperator
router/intent-profiler.ts:61:35
   const requiresInteraction = /\b(ask|prompt|confirm|approve|choose|select)\b/.test(prompt);
 
   // Detect file transaction
-  const requiresFileTransaction = /\b(file|directory|path|repository|code|source)\b/.test(prompt)
-    || (needsTools && (prompt.includes('write') || prompt.includes('edit')));
+  const requiresFileTransaction = /\b(file|directory|path|repository|code|source)\b/.test(prompt) && needsTools && (prompt.includes('write') || prompt.includes('edit'));
 
   // Estimate uncertainty
killedBy: precision: intent-profiler exact values read file: exact feature set
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
router/intent-profiler.ts:62:9
 
   // Detect file transaction
   const requiresFileTransaction = /\b(file|directory|path|repository|code|source)\b/.test(prompt)
-    || (needsTools && (prompt.includes('write') || prompt.includes('edit')));
+    || (needsTools || prompt.includes('write') || prompt.includes('edit'));
 
   // Estimate uncertainty
killedBy: precision: static-router exact decisions uncertain tool use -> react + OBSERVATION_DEPENDENT
statusReason: expected 'plan_execute' to be 'react' // Object.is equality

[Killed] ConditionalExpression
router/intent-profiler.ts:62:24
 
   // Detect file transaction
   const requiresFileTransaction = /\b(file|directory|path|repository|code|source)\b/.test(prompt)
-    || (needsTools && (prompt.includes('write') || prompt.includes('edit')));
+    || (needsTools && (true));
 
   // Estimate uncertainty
killedBy: precision: static-router exact decisions uncertain tool use -> react + OBSERVATION_DEPENDENT
statusReason: expected 'plan_execute' to be 'react' // Object.is equality

[Killed] AssignmentOperator
router/intent-profiler.ts:66:80
 
   // Estimate uncertainty
   let uncertainty = 0;
-  if (/\b(maybe|might|uncertain|unclear|not sure|approximate)\b/.test(prompt)) uncertainty += 0.3;
+  if (/\b(maybe|might|uncertain|unclear|not sure|approximate)\b/.test(prompt)) uncertainty -= 0.3;
   if (dependencyCount > 2) uncertainty += 0.2;
   if (effectRisk === 'high') uncertainty += 0.2;
killedBy: precision: static-router exact decisions uncertain tool use -> react + OBSERVATION_DEPENDENT
statusReason: expected 'TOOL_NEEDED' to be 'OBSERVATION_DEPENDENT' // Object.is equality

[Killed] ConditionalExpression
router/intent-profiler.ts:66:7
 
   // Estimate uncertainty
   let uncertainty = 0;
-  if (/\b(maybe|might|uncertain|unclear|not sure|approximate)\b/.test(prompt)) uncertainty += 0.3;
+  if (false) uncertainty += 0.3;
   if (dependencyCount > 2) uncertainty += 0.2;
   if (effectRisk === 'high') uncertainty += 0.2;
killedBy: precision: static-router exact decisions uncertain tool use -> react + OBSERVATION_DEPENDENT
statusReason: expected 'TOOL_NEEDED' to be 'OBSERVATION_DEPENDENT' // Object.is equality

[Killed] EqualityOperator
router/intent-profiler.ts:67:7
   // Estimate uncertainty
   let uncertainty = 0;
   if (/\b(maybe|might|uncertain|unclear|not sure|approximate)\b/.test(prompt)) uncertainty += 0.3;
-  if (dependencyCount > 2) uncertainty += 0.2;
+  if (dependencyCount <= 2) uncertainty += 0.2;
   if (effectRisk === 'high') uncertainty += 0.2;
   uncertainty = Math.min(1, uncertainty);
killedBy: precision: static-router exact decisions tool needed without uncertainty -> react + TOOL_NEEDED
statusReason: expected 'OBSERVATION_DEPENDENT' to be 'TOOL_NEEDED' // Object.is equality

[Killed] ConditionalExpression
router/intent-profiler.ts:67:7
   // Estimate uncertainty
   let uncertainty = 0;
   if (/\b(maybe|might|uncertain|unclear|not sure|approximate)\b/.test(prompt)) uncertainty += 0.3;
-  if (dependencyCount > 2) uncertainty += 0.2;
+  if (true) uncertainty += 0.2;
   if (effectRisk === 'high') uncertainty += 0.2;
   uncertainty = Math.min(1, uncertainty);
killedBy: precision: static-router exact decisions tool needed without uncertainty -> react + TOOL_NEEDED
statusReason: expected 'OBSERVATION_DEPENDENT' to be 'TOOL_NEEDED' // Object.is equality

[Killed] EqualityOperator
router/intent-profiler.ts:68:7
   let uncertainty = 0;
   if (/\b(maybe|might|uncertain|unclear|not sure|approximate)\b/.test(prompt)) uncertainty += 0.3;
   if (dependencyCount > 2) uncertainty += 0.2;
-  if (effectRisk === 'high') uncertainty += 0.2;
+  if (effectRisk !== 'high') uncertainty += 0.2;
   uncertainty = Math.min(1, uncertainty);
 
killedBy: precision: static-router exact decisions tool needed without uncertainty -> react + TOOL_NEEDED
statusReason: expected 'OBSERVATION_DEPENDENT' to be 'TOOL_NEEDED' // Object.is equality

[Killed] ConditionalExpression
router/intent-profiler.ts:68:7
   let uncertainty = 0;
   if (/\b(maybe|might|uncertain|unclear|not sure|approximate)\b/.test(prompt)) uncertainty += 0.3;
   if (dependencyCount > 2) uncertainty += 0.2;
-  if (effectRisk === 'high') uncertainty += 0.2;
+  if (true) uncertainty += 0.2;
   uncertainty = Math.min(1, uncertainty);
 
killedBy: precision: static-router exact decisions tool needed without uncertainty -> react + TOOL_NEEDED
statusReason: expected 'OBSERVATION_DEPENDENT' to be 'TOOL_NEEDED' // Object.is equality

[Killed] MethodExpression
router/intent-profiler.ts:69:17
   if (/\b(maybe|might|uncertain|unclear|not sure|approximate)\b/.test(prompt)) uncertainty += 0.3;
   if (dependencyCount > 2) uncertainty += 0.2;
   if (effectRisk === 'high') uncertainty += 0.2;
-  uncertainty = Math.min(1, uncertainty);
+  uncertainty = Math.max(1, uncertainty);
 
   // Estimate steps
killedBy: precision: static-router exact decisions tool needed without uncertainty -> react + TOOL_NEEDED
statusReason: expected 'OBSERVATION_DEPENDENT' to be 'TOOL_NEEDED' // Object.is equality

[Killed] ConditionalExpression
router/intent-profiler.ts:73:7
 
   // Estimate steps
   let stepsEstimated = 1;
-  if (needsTools) stepsEstimated = Math.max(2, toolCount);
+  if (true) stepsEstimated = Math.max(2, toolCount);
   if (dependencyCount > 0) stepsEstimated += dependencyCount;
   if (requiresFileTransaction) stepsEstimated = Math.max(stepsEstimated, 3);
killedBy: precision: static-router exact decisions simple greeting -> direct + SINGLE_STEP_NO_TOOLS
statusReason: expected 'DEFAULT_DIRECT' to be 'SINGLE_STEP_NO_TOOLS' // Object.is equality

[Survived] MethodExpression
router/intent-profiler.ts:73:36
 
   // Estimate steps
   let stepsEstimated = 1;
-  if (needsTools) stepsEstimated = Math.max(2, toolCount);
+  if (needsTools) stepsEstimated = Math.min(2, toolCount);
   if (dependencyCount > 0) stepsEstimated += dependencyCount;
   if (requiresFileTransaction) stepsEstimated = Math.max(stepsEstimated, 3);

[Survived] AssignmentOperator
router/intent-profiler.ts:74:28
   // Estimate steps
   let stepsEstimated = 1;
   if (needsTools) stepsEstimated = Math.max(2, toolCount);
-  if (dependencyCount > 0) stepsEstimated += dependencyCount;
+  if (dependencyCount > 0) stepsEstimated -= dependencyCount;
   if (requiresFileTransaction) stepsEstimated = Math.max(stepsEstimated, 3);
 

[Survived] EqualityOperator
router/intent-profiler.ts:74:7
   // Estimate steps
   let stepsEstimated = 1;
   if (needsTools) stepsEstimated = Math.max(2, toolCount);
-  if (dependencyCount > 0) stepsEstimated += dependencyCount;
+  if (dependencyCount <= 0) stepsEstimated += dependencyCount;
   if (requiresFileTransaction) stepsEstimated = Math.max(stepsEstimated, 3);
 

[Killed] ConditionalExpression
router/intent-profiler.ts:75:7
   let stepsEstimated = 1;
   if (needsTools) stepsEstimated = Math.max(2, toolCount);
   if (dependencyCount > 0) stepsEstimated += dependencyCount;
-  if (requiresFileTransaction) stepsEstimated = Math.max(stepsEstimated, 3);
+  if (true) stepsEstimated = Math.max(stepsEstimated, 3);
 
   // Detect domains
killedBy: precision: static-router exact decisions simple greeting -> direct + SINGLE_STEP_NO_TOOLS
statusReason: expected 'plan_execute' to be 'direct' // Object.is equality

[Survived] ConditionalExpression
router/intent-profiler.ts:75:7
   let stepsEstimated = 1;
   if (needsTools) stepsEstimated = Math.max(2, toolCount);
   if (dependencyCount > 0) stepsEstimated += dependencyCount;
-  if (requiresFileTransaction) stepsEstimated = Math.max(stepsEstimated, 3);
+  if (false) stepsEstimated = Math.max(stepsEstimated, 3);
 
   // Detect domains

[Killed] ConditionalExpression
router/intent-profiler.ts:79:7
 
   // Detect domains
   const domains: string[] = [];
-  if (/\b(code|function|bug|test|repository|programming)\b/.test(prompt)) domains.push('coding');
+  if (true) domains.push('coding');
   if (/\b(document|pdf|summary|page)\b/.test(prompt)) domains.push('documents');
   if (/\b(research|citation|source|evidence)\b/.test(prompt)) domains.push('research');
killedBy: precision: intent-profiler exact values simple prompt: exact feature set
statusReason: expected [ 'coding' ] to deeply equal [ 'general' ]

[Killed] ConditionalExpression
router/intent-profiler.ts:79:7
 
   // Detect domains
   const domains: string[] = [];
-  if (/\b(code|function|bug|test|repository|programming)\b/.test(prompt)) domains.push('coding');
+  if (false) domains.push('coding');
   if (/\b(document|pdf|summary|page)\b/.test(prompt)) domains.push('documents');
   if (/\b(research|citation|source|evidence)\b/.test(prompt)) domains.push('research');
killedBy: mutation-kill: profiler all branches detects coding domain
statusReason: expected [ 'general' ] to include 'coding'

[Killed] ConditionalExpression
router/intent-profiler.ts:80:7
   // Detect domains
   const domains: string[] = [];
   if (/\b(code|function|bug|test|repository|programming)\b/.test(prompt)) domains.push('coding');
-  if (/\b(document|pdf|summary|page)\b/.test(prompt)) domains.push('documents');
+  if (true) domains.push('documents');
   if (/\b(research|citation|source|evidence)\b/.test(prompt)) domains.push('research');
   if (/\b(write|draft|article|blog|essay)\b/.test(prompt)) domains.push('writing');
killedBy: precision: intent-profiler exact values simple prompt: exact feature set
statusReason: expected [ 'documents' ] to deeply equal [ 'general' ]

[Killed] ConditionalExpression
router/intent-profiler.ts:80:7
   // Detect domains
   const domains: string[] = [];
   if (/\b(code|function|bug|test|repository|programming)\b/.test(prompt)) domains.push('coding');
-  if (/\b(document|pdf|summary|page)\b/.test(prompt)) domains.push('documents');
+  if (false) domains.push('documents');
   if (/\b(research|citation|source|evidence)\b/.test(prompt)) domains.push('research');
   if (/\b(write|draft|article|blog|essay)\b/.test(prompt)) domains.push('writing');
killedBy: mutation-kill: profiler all branches detects documents domain
statusReason: expected [ 'general' ] to include 'documents'

[Killed] ConditionalExpression
router/intent-profiler.ts:81:7
   const domains: string[] = [];
   if (/\b(code|function|bug|test|repository|programming)\b/.test(prompt)) domains.push('coding');
   if (/\b(document|pdf|summary|page)\b/.test(prompt)) domains.push('documents');
-  if (/\b(research|citation|source|evidence)\b/.test(prompt)) domains.push('research');
+  if (false) domains.push('research');
   if (/\b(write|draft|article|blog|essay)\b/.test(prompt)) domains.push('writing');
   if (/\b(plan|schedule|task|dependency|goal)\b/.test(prompt)) domains.push('planning');
killedBy: mutation-kill: profiler all branches detects research domain
statusReason: expected [ 'general' ] to include 'research'

[Killed] ConditionalExpression
router/intent-profiler.ts:81:7
   const domains: string[] = [];
   if (/\b(code|function|bug|test|repository|programming)\b/.test(prompt)) domains.push('coding');
   if (/\b(document|pdf|summary|page)\b/.test(prompt)) domains.push('documents');
-  if (/\b(research|citation|source|evidence)\b/.test(prompt)) domains.push('research');
+  if (true) domains.push('research');
   if (/\b(write|draft|article|blog|essay)\b/.test(prompt)) domains.push('writing');
   if (/\b(plan|schedule|task|dependency|goal)\b/.test(prompt)) domains.push('planning');
killedBy: mutation-kill: profiler all branches defaults to general domain
statusReason: expected [ 'research' ] to include 'general'

[Killed] ConditionalExpression
router/intent-profiler.ts:82:7
   if (/\b(code|function|bug|test|repository|programming)\b/.test(prompt)) domains.push('coding');
   if (/\b(document|pdf|summary|page)\b/.test(prompt)) domains.push('documents');
   if (/\b(research|citation|source|evidence)\b/.test(prompt)) domains.push('research');
-  if (/\b(write|draft|article|blog|essay)\b/.test(prompt)) domains.push('writing');
+  if (true) domains.push('writing');
   if (/\b(plan|schedule|task|dependency|goal)\b/.test(prompt)) domains.push('planning');
   if (domains.length === 0) domains.push('general');
killedBy: mutation-kill: profiler all branches defaults to general domain
statusReason: expected [ 'writing' ] to include 'general'

[Killed] ConditionalExpression
router/intent-profiler.ts:82:7
   if (/\b(code|function|bug|test|repository|programming)\b/.test(prompt)) domains.push('coding');
   if (/\b(document|pdf|summary|page)\b/.test(prompt)) domains.push('documents');
   if (/\b(research|citation|source|evidence)\b/.test(prompt)) domains.push('research');
-  if (/\b(write|draft|article|blog|essay)\b/.test(prompt)) domains.push('writing');
+  if (false) domains.push('writing');
   if (/\b(plan|schedule|task|dependency|goal)\b/.test(prompt)) domains.push('planning');
   if (domains.length === 0) domains.push('general');
killedBy: AH-ROUTER-001: intent profiler profiles a writing task
statusReason: expected [ 'general' ] to include 'writing'

[Killed] ConditionalExpression
router/intent-profiler.ts:83:7
   if (/\b(document|pdf|summary|page)\b/.test(prompt)) domains.push('documents');
   if (/\b(research|citation|source|evidence)\b/.test(prompt)) domains.push('research');
   if (/\b(write|draft|article|blog|essay)\b/.test(prompt)) domains.push('writing');
-  if (/\b(plan|schedule|task|dependency|goal)\b/.test(prompt)) domains.push('planning');
+  if (false) domains.push('planning');
   if (domains.length === 0) domains.push('general');
 
killedBy: mutation-kill: profiler all branches detects planning domain
statusReason: expected [ 'general' ] to include 'planning'

[Killed] ConditionalExpression
router/intent-profiler.ts:83:7
   if (/\b(document|pdf|summary|page)\b/.test(prompt)) domains.push('documents');
   if (/\b(research|citation|source|evidence)\b/.test(prompt)) domains.push('research');
   if (/\b(write|draft|article|blog|essay)\b/.test(prompt)) domains.push('writing');
-  if (/\b(plan|schedule|task|dependency|goal)\b/.test(prompt)) domains.push('planning');
+  if (true) domains.push('planning');
   if (domains.length === 0) domains.push('general');
 
killedBy: mutation-kill: profiler all branches defaults to general domain
statusReason: expected [ 'planning' ] to include 'general'

[Killed] EqualityOperator
router/intent-profiler.ts:84:7
   if (/\b(research|citation|source|evidence)\b/.test(prompt)) domains.push('research');
   if (/\b(write|draft|article|blog|essay)\b/.test(prompt)) domains.push('writing');
   if (/\b(plan|schedule|task|dependency|goal)\b/.test(prompt)) domains.push('planning');
-  if (domains.length === 0) domains.push('general');
+  if (domains.length !== 0) domains.push('general');
 
   return {
killedBy: mutation-kill: profiler all branches defaults to general domain
statusReason: expected [] to include 'general'

[Killed] ConditionalExpression
router/intent-profiler.ts:84:7
   if (/\b(research|citation|source|evidence)\b/.test(prompt)) domains.push('research');
   if (/\b(write|draft|article|blog|essay)\b/.test(prompt)) domains.push('writing');
   if (/\b(plan|schedule|task|dependency|goal)\b/.test(prompt)) domains.push('planning');
-  if (domains.length === 0) domains.push('general');
+  if (false) domains.push('general');
 
   return {
killedBy: mutation-kill: profiler all branches defaults to general domain
statusReason: expected [] to include 'general'

[Killed] ObjectLiteral
router/intent-profiler.ts:86:10
   if (/\b(plan|schedule|task|dependency|goal)\b/.test(prompt)) domains.push('planning');
   if (domains.length === 0) domains.push('general');
 
-  return {
-    needs_tools: needsTools,
-    tool_count: toolCount,
-    dependency_count: dependencyCount,
-    effect_risk: effectRisk,
-    requires_interaction: requiresInteraction,
-    requires_file_transaction: requiresFileTransaction,
-    uncertainty,
-    steps_estimated: stepsEstimated,
-    domains,
-  };
+  return {};
 }
 
killedBy: mutation-kill: router all decision paths routes file transaction to plan_execute
statusReason: expected 'direct' to be 'plan_execute' // Object.is equality
