[Killed] BlockStatement
security/secrets-broker.ts:80:43
   private readonly encryptionKey: Buffer;
   private readonly dataDir: string | null;
 
-  constructor(opts: SecretsBrokerOptions) {
-    // Derive a 32-byte key from the provided string
-    this.encryptionKey = createHash('sha256').update(opts.encryptionKey).digest();
-    this.dataDir = opts.dataDir ?? null;
-
-    if (this.dataDir) {
-      this.load();
-    }
-  }
+  constructor(opts: SecretsBrokerOptions) {}
 
   store(name: string, value: string): void {
killedBy: AH-SECRETS-001: secrets broker stores and retrieves a secret
statusReason: The "key" argument must be of type string or an instance of ArrayBuffer, Buffer, TypedArray, DataView, KeyObject, or CryptoKey. Received undefined

[Killed] StringLiteral
security/secrets-broker.ts:82:37
 
   constructor(opts: SecretsBrokerOptions) {
     // Derive a 32-byte key from the provided string
-    this.encryptionKey = createHash('sha256').update(opts.encryptionKey).digest();
+    this.encryptionKey = createHash("").update(opts.encryptionKey).digest();
     this.dataDir = opts.dataDir ?? null;
 
killedBy: AH-SECRETS-001: secrets broker stores and retrieves a secret
statusReason: Digest method not supported

[Killed] LogicalOperator
security/secrets-broker.ts:83:20
   constructor(opts: SecretsBrokerOptions) {
     // Derive a 32-byte key from the provided string
     this.encryptionKey = createHash('sha256').update(opts.encryptionKey).digest();
-    this.dataDir = opts.dataDir ?? null;
+    this.dataDir = opts.dataDir && null;
 
     if (this.dataDir) {
killedBy: AH-SECRETS-001: secrets broker persists to encrypted file and reloads
statusReason: expected null to be 'sk-persisted-123' // Object.is equality

[Killed] ConditionalExpression
security/secrets-broker.ts:85:9
     this.encryptionKey = createHash('sha256').update(opts.encryptionKey).digest();
     this.dataDir = opts.dataDir ?? null;
 
-    if (this.dataDir) {
+    if (false) {
       this.load();
     }
killedBy: AH-SECRETS-001: secrets broker persists to encrypted file and reloads
statusReason: expected null to be 'sk-persisted-123' // Object.is equality

[Killed] BlockStatement
security/secrets-broker.ts:85:23
     this.encryptionKey = createHash('sha256').update(opts.encryptionKey).digest();
     this.dataDir = opts.dataDir ?? null;
 
-    if (this.dataDir) {
-      this.load();
-    }
+    if (this.dataDir) {}
   }
 
killedBy: AH-SECRETS-001: secrets broker persists to encrypted file and reloads
statusReason: expected null to be 'sk-persisted-123' // Object.is equality

[Killed] BlockStatement
security/secrets-broker.ts:90:44
     }
   }
 
-  store(name: string, value: string): void {
-    const iv = randomBytes(12);
-    const cipher = createCipheriv(ALGORITHM, this.encryptionKey, iv);
-    const encrypted = Buffer.concat([
-      cipher.update(value, 'utf8'),
-      cipher.final(),
-    ]);
-    const authTag = cipher.getAuthTag();
-
-    this.secretStore.set(name, {
-      name,
-      encrypted_value: encrypted.toString('base64'),
-      iv: iv.toString('base64'),
-      auth_tag: authTag.toString('base64'),
-      created_at: new Date().toISOString(),
-    });
-  }
+  store(name: string, value: string): void {}
 
   retrieve(name: string): string | null {
killedBy: AH-SECRETS-001: secrets broker stores and retrieves a secret
statusReason: expected null to be 'sk-test-12345' // Object.is equality

[Killed] ArrayDeclaration
security/secrets-broker.ts:93:37
   store(name: string, value: string): void {
     const iv = randomBytes(12);
     const cipher = createCipheriv(ALGORITHM, this.encryptionKey, iv);
-    const encrypted = Buffer.concat([
-      cipher.update(value, 'utf8'),
-      cipher.final(),
-    ]);
+    const encrypted = Buffer.concat([]);
     const authTag = cipher.getAuthTag();
 
killedBy: mutation-kill: secrets broker all paths delete removes secret
statusReason: Invalid state for operation getAuthTag

[Killed] StringLiteral
security/secrets-broker.ts:102:23
     this.secretStore.set(name, {
       name,
       encrypted_value: encrypted.toString('base64'),
-      iv: iv.toString('base64'),
+      iv: iv.toString(""),
       auth_tag: authTag.toString('base64'),
       created_at: new Date().toISOString(),
killedBy: mutation-kill: secrets broker all paths delete removes secret
statusReason: Unknown encoding:

[Killed] BlockStatement
security/secrets-broker.ts:108:41
     });
   }
 
-  retrieve(name: string): string | null {
-    const record = this.secretStore.get(name);
-    if (!record) return null;
-
-    try {
-      const iv = Buffer.from(record.iv, 'base64');
-      const authTag = Buffer.from(record.auth_tag, 'base64');
-      const encrypted = Buffer.from(record.encrypted_value, 'base64');
-      const decipher = createDecipheriv(ALGORITHM, this.encryptionKey, iv);
-      decipher.setAuthTag(authTag);
-      const decrypted = Buffer.concat([
-        decipher.update(encrypted),
-        decipher.final(),
-      ]);
-      return decrypted.toString('utf8');
-    } catch {
-      // Decryption failed (wrong key, corrupted data)
-      return null;
-    }
-  }
+  retrieve(name: string): string | null {}
 
   delete(name: string): void {
killedBy: AH-SECRETS-001: secrets broker stores and retrieves a secret
statusReason: expected undefined to be 'sk-test-12345' // Object.is equality

[Killed] ConditionalExpression
security/secrets-broker.ts:110:9
 
   retrieve(name: string): string | null {
     const record = this.secretStore.get(name);
-    if (!record) return null;
+    if (true) return null;
 
     try {
killedBy: AH-SECRETS-001: secrets broker stores and retrieves a secret
statusReason: expected null to be 'sk-test-12345' // Object.is equality

[Killed] BooleanLiteral
security/secrets-broker.ts:110:9
 
   retrieve(name: string): string | null {
     const record = this.secretStore.get(name);
-    if (!record) return null;
+    if (record) return null;
 
     try {
killedBy: AH-SECRETS-001: secrets broker stores and retrieves a secret
statusReason: expected null to be 'sk-test-12345' // Object.is equality

[Killed] BlockStatement
security/secrets-broker.ts:112:9
     const record = this.secretStore.get(name);
     if (!record) return null;
 
-    try {
-      const iv = Buffer.from(record.iv, 'base64');
-      const authTag = Buffer.from(record.auth_tag, 'base64');
-      const encrypted = Buffer.from(record.encrypted_value, 'base64');
-      const decipher = createDecipheriv(ALGORITHM, this.encryptionKey, iv);
-      decipher.setAuthTag(authTag);
-      const decrypted = Buffer.concat([
-        decipher.update(encrypted),
-        decipher.final(),
-      ]);
-      return decrypted.toString('utf8');
-    } catch {
+    try {} catch {
       // Decryption failed (wrong key, corrupted data)
       return null;
killedBy: AH-SECRETS-001: secrets broker stores and retrieves a secret
statusReason: expected undefined to be 'sk-test-12345' // Object.is equality

[Killed] BlockStatement
security/secrets-broker.ts:123:13
         decipher.final(),
       ]);
       return decrypted.toString('utf8');
-    } catch {
-      // Decryption failed (wrong key, corrupted data)
-      return null;
-    }
+    } catch {}
   }
 
killedBy: AH-SECRETS-001: secrets broker different encryption key cannot decrypt
statusReason: expected undefined to be null

[Killed] BlockStatement
security/secrets-broker.ts:129:30
     }
   }
 
-  delete(name: string): void {
-    this.secretStore.delete(name);
-  }
+  delete(name: string): void {}
 
   list(): string[] {
killedBy: AH-SECRETS-001: secrets broker deletes a secret
statusReason: expected 'sk-test-12345' to be null

[Killed] BlockStatement
security/secrets-broker.ts:133:20
     this.secretStore.delete(name);
   }
 
-  list(): string[] {
-    return [...this.secretStore.keys()];
-  }
+  list(): string[] {}
 
   exchange(
killedBy: AH-SECRETS-001: secrets broker list returns secret names without values
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] BlockStatement
security/secrets-broker.ts:142:25
     ctx: { run_id: string; step_id: string },
   ): ExchangeCredential {
     const value = this.retrieve(secretName);
-    if (value === null) {
-      throw new Error(`Secret '${secretName}' not found`);
-    }
+    if (value === null) {}
 
     const exchangeId = createHash('sha256')
killedBy: coverage: SecretsBroker methods exchange throws for missing secret
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
security/secrets-broker.ts:142:9
     ctx: { run_id: string; step_id: string },
   ): ExchangeCredential {
     const value = this.retrieve(secretName);
-    if (value === null) {
+    if (true) {
       throw new Error(`Secret '${secretName}' not found`);
     }
killedBy: AH-SECRETS-001: secrets broker exchange returns a single-use credential
statusReason: Secret 'api-key' not found

[Killed] StringLiteral
security/secrets-broker.ts:143:23
   ): ExchangeCredential {
     const value = this.retrieve(secretName);
     if (value === null) {
-      throw new Error(`Secret '${secretName}' not found`);
+      throw new Error(``);
     }
 
killedBy: coverage: SecretsBroker methods exchange throws for missing secret
statusReason: expected [Function] to throw error matching /not found/ but got ''

[Survived] StringLiteral
security/secrets-broker.ts:147:15
     }
 
     const exchangeId = createHash('sha256')
-      .update(`${secretName}:${ctx.run_id}:${ctx.step_id}:${Date.now()}:${Math.random()}`)
+      .update(``)
       .digest('hex');
 

[Killed] BooleanLiteral
security/secrets-broker.ts:156:17
       value,
       run_id: ctx.run_id,
       step_id: ctx.step_id,
-      consumed: false,
+      consumed: true,
       created_at: new Date().toISOString(),
     };
killedBy: AH-SECRETS-001: secrets broker exchange returns a single-use credential
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
security/secrets-broker.ts:160:36
       created_at: new Date().toISOString(),
     };
 
-    this.exchanges.set(exchangeId, {
-      credential,
-      consumed: false,
-    });
+    this.exchanges.set(exchangeId, {});
 
     return credential;
killedBy: mutation-kill: secrets broker all paths consumeExchange marks as consumed
statusReason: Cannot set properties of undefined (setting 'consumed')

[Killed] BooleanLiteral
security/secrets-broker.ts:162:17
 
     this.exchanges.set(exchangeId, {
       credential,
-      consumed: false,
+      consumed: true,
     });
 
killedBy: AH-SECRETS-001: secrets broker cannot consume same exchange twice
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
security/secrets-broker.ts:168:48
     return credential;
   }
 
-  consumeExchange(exchangeId: string): boolean {
-    const state = this.exchanges.get(exchangeId);
-    if (!state) return false;
-    if (state.consumed) return false;
-    state.consumed = true;
-    state.credential.consumed = true;
-    return true;
-  }
+  consumeExchange(exchangeId: string): boolean {}
 
   isExchangeConsumed(exchangeId: string): boolean {
killedBy: coverage: SecretsBroker methods consumeExchange returns false for unknown
statusReason: expected undefined to be false // Object.is equality

[Killed] BooleanLiteral
security/secrets-broker.ts:170:9
 
   consumeExchange(exchangeId: string): boolean {
     const state = this.exchanges.get(exchangeId);
-    if (!state) return false;
+    if (state) return false;
     if (state.consumed) return false;
     state.consumed = true;
killedBy: AH-SECRETS-001: secrets broker exchange marks credential as consumed after first use
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
security/secrets-broker.ts:170:24
 
   consumeExchange(exchangeId: string): boolean {
     const state = this.exchanges.get(exchangeId);
-    if (!state) return false;
+    if (!state) return true;
     if (state.consumed) return false;
     state.consumed = true;
killedBy: coverage: SecretsBroker methods consumeExchange returns false for unknown
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
security/secrets-broker.ts:171:32
   consumeExchange(exchangeId: string): boolean {
     const state = this.exchanges.get(exchangeId);
     if (!state) return false;
-    if (state.consumed) return false;
+    if (state.consumed) return true;
     state.consumed = true;
     state.credential.consumed = true;
killedBy: AH-SECRETS-001: secrets broker cannot consume same exchange twice
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
security/secrets-broker.ts:171:9
   consumeExchange(exchangeId: string): boolean {
     const state = this.exchanges.get(exchangeId);
     if (!state) return false;
-    if (state.consumed) return false;
+    if (false) return false;
     state.consumed = true;
     state.credential.consumed = true;
killedBy: AH-SECRETS-001: secrets broker cannot consume same exchange twice
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
security/secrets-broker.ts:172:22
     const state = this.exchanges.get(exchangeId);
     if (!state) return false;
     if (state.consumed) return false;
-    state.consumed = true;
+    state.consumed = false;
     state.credential.consumed = true;
     return true;
killedBy: AH-SECRETS-001: secrets broker exchange marks credential as consumed after first use
statusReason: expected false to be true // Object.is equality

[Survived] BooleanLiteral
security/secrets-broker.ts:173:33
     if (!state) return false;
     if (state.consumed) return false;
     state.consumed = true;
-    state.credential.consumed = true;
+    state.credential.consumed = false;
     return true;
   }

[Killed] BooleanLiteral
security/secrets-broker.ts:174:12
     if (state.consumed) return false;
     state.consumed = true;
     state.credential.consumed = true;
-    return true;
+    return false;
   }
 
killedBy: AH-SECRETS-001: secrets broker cannot consume same exchange twice
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
security/secrets-broker.ts:177:51
     return true;
   }
 
-  isExchangeConsumed(exchangeId: string): boolean {
-    return this.exchanges.get(exchangeId)?.consumed ?? false;
-  }
+  isExchangeConsumed(exchangeId: string): boolean {}
 
   redact(input: unknown): unknown {
killedBy: AH-SECRETS-001: secrets broker exchange marks credential as consumed after first use
statusReason: expected undefined to be true // Object.is equality

[Killed] BooleanLiteral
security/secrets-broker.ts:178:56
   }
 
   isExchangeConsumed(exchangeId: string): boolean {
-    return this.exchanges.get(exchangeId)?.consumed ?? false;
+    return this.exchanges.get(exchangeId)?.consumed ?? true;
   }
 
killedBy: coverage: SecretsBroker methods isExchangeConsumed returns false for unknown
statusReason: expected true to be false // Object.is equality

[Killed] OptionalChaining
security/secrets-broker.ts:178:12
   }
 
   isExchangeConsumed(exchangeId: string): boolean {
-    return this.exchanges.get(exchangeId)?.consumed ?? false;
+    return this.exchanges.get(exchangeId).consumed ?? false;
   }
 
killedBy: coverage: SecretsBroker methods isExchangeConsumed returns false for unknown
statusReason: Cannot read properties of undefined (reading 'consumed')

[Killed] BlockStatement
security/secrets-broker.ts:181:35
     return this.exchanges.get(exchangeId)?.consumed ?? false;
   }
 
-  redact(input: unknown): unknown {
-    if (input === null) return null;
-    if (input === undefined) return undefined;
-    if (typeof input === 'number') return input;
-    if (typeof input === 'boolean') return input;
-    if (typeof input === 'string') return this.redactString(input);
-    if (input instanceof Error) {
-      const redacted = new Error(this.redactString(input.message));
-      redacted.name = input.name;
-      redacted.stack = input.stack ? this.redactString(input.stack) : undefined;
-      return redacted;
-    }
-    if (Array.isArray(input)) {
-      return input.map((item) => this.redact(item));
-    }
-    if (typeof input === 'object') {
-      const result: Record<string, unknown> = {};
-      for (const [key, value] of Object.entries(input as Record<string, unknown>)) {
-        result[key] = this.redact(value);
-      }
-      return result;
-    }
-    return input;
-  }
+  redact(input: unknown): unknown {}
 
   flush(): void {
killedBy: coverage: SecretsBroker methods redact handles all types
statusReason: expected undefined to be null

[Killed] ConditionalExpression
security/secrets-broker.ts:182:9
   }
 
   redact(input: unknown): unknown {
-    if (input === null) return null;
+    if (false) return null;
     if (input === undefined) return undefined;
     if (typeof input === 'number') return input;
killedBy: AH-SECRETS-001: secrets broker redactSecrets handles null and undefined
statusReason: Cannot convert undefined or null to object

[Killed] EqualityOperator
security/secrets-broker.ts:182:9
   }
 
   redact(input: unknown): unknown {
-    if (input === null) return null;
+    if (input !== null) return null;
     if (input === undefined) return undefined;
     if (typeof input === 'number') return input;
killedBy: coverage: SecretsBroker methods redact handles all types
statusReason: Cannot convert undefined or null to object

[Killed] ConditionalExpression
security/secrets-broker.ts:183:9
 
   redact(input: unknown): unknown {
     if (input === null) return null;
-    if (input === undefined) return undefined;
+    if (true) return undefined;
     if (typeof input === 'number') return input;
     if (typeof input === 'boolean') return input;
killedBy: coverage: SecretsBroker methods redact handles all types
statusReason: expected undefined to be 42 // Object.is equality

[Killed] EqualityOperator
security/secrets-broker.ts:183:9
 
   redact(input: unknown): unknown {
     if (input === null) return null;
-    if (input === undefined) return undefined;
+    if (input !== undefined) return undefined;
     if (typeof input === 'number') return input;
     if (typeof input === 'boolean') return input;
killedBy: AH-SECRETS-001: secrets broker redactSecrets removes known secret values from a string
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] EqualityOperator
security/secrets-broker.ts:184:9
   redact(input: unknown): unknown {
     if (input === null) return null;
     if (input === undefined) return undefined;
-    if (typeof input === 'number') return input;
+    if (typeof input !== 'number') return input;
     if (typeof input === 'boolean') return input;
     if (typeof input === 'string') return this.redactString(input);
killedBy: AH-SECRETS-001: secrets broker redactSecrets removes known secret values from a string
statusReason: expected 'Error: failed with key sk-secret-to-r…' not to contain 'sk-secret-to-redact'

[Killed] ConditionalExpression
security/secrets-broker.ts:184:9
   redact(input: unknown): unknown {
     if (input === null) return null;
     if (input === undefined) return undefined;
-    if (typeof input === 'number') return input;
+    if (true) return input;
     if (typeof input === 'boolean') return input;
     if (typeof input === 'string') return this.redactString(input);
killedBy: mutation-kill: secrets broker all paths redact handles nested objects
statusReason: expected '{"a":{"b":"secret"}}' not to contain 'secret'

[Killed] ConditionalExpression
security/secrets-broker.ts:185:9
     if (input === null) return null;
     if (input === undefined) return undefined;
     if (typeof input === 'number') return input;
-    if (typeof input === 'boolean') return input;
+    if (true) return input;
     if (typeof input === 'string') return this.redactString(input);
     if (input instanceof Error) {
killedBy: AH-SECRETS-001: secrets broker redactSecrets removes known secret values from a string
statusReason: expected 'Error: failed with key sk-secret-to-r…' not to contain 'sk-secret-to-redact'

[Killed] EqualityOperator
security/secrets-broker.ts:185:9
     if (input === null) return null;
     if (input === undefined) return undefined;
     if (typeof input === 'number') return input;
-    if (typeof input === 'boolean') return input;
+    if (typeof input !== 'boolean') return input;
     if (typeof input === 'string') return this.redactString(input);
     if (input instanceof Error) {
killedBy: AH-SECRETS-001: secrets broker redactSecrets removes known secret values from a string
statusReason: expected 'Error: failed with key sk-secret-to-r…' not to contain 'sk-secret-to-redact'

[Killed] ConditionalExpression
security/secrets-broker.ts:186:9
     if (input === undefined) return undefined;
     if (typeof input === 'number') return input;
     if (typeof input === 'boolean') return input;
-    if (typeof input === 'string') return this.redactString(input);
+    if (false) return this.redactString(input);
     if (input instanceof Error) {
       const redacted = new Error(this.redactString(input.message));
killedBy: AH-SECRETS-001: secrets broker redactSecrets removes known secret values from a string
statusReason: expected 'Error: failed with key sk-secret-to-r…' not to contain 'sk-secret-to-redact'

[Killed] ConditionalExpression
security/secrets-broker.ts:186:9
     if (input === undefined) return undefined;
     if (typeof input === 'number') return input;
     if (typeof input === 'boolean') return input;
-    if (typeof input === 'string') return this.redactString(input);
+    if (true) return this.redactString(input);
     if (input instanceof Error) {
       const redacted = new Error(this.redactString(input.message));
killedBy: AH-SECRETS-001: secrets broker redactSecrets handles objects recursively
statusReason: result.replace is not a function

[Killed] ConditionalExpression
security/secrets-broker.ts:187:9
     if (typeof input === 'number') return input;
     if (typeof input === 'boolean') return input;
     if (typeof input === 'string') return this.redactString(input);
-    if (input instanceof Error) {
+    if (false) {
       const redacted = new Error(this.redactString(input.message));
       redacted.name = input.name;
killedBy: AH-SECRETS-001: secrets broker redactSecrets handles Error objects
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] BlockStatement
security/secrets-broker.ts:187:33
     if (typeof input === 'number') return input;
     if (typeof input === 'boolean') return input;
     if (typeof input === 'string') return this.redactString(input);
-    if (input instanceof Error) {
-      const redacted = new Error(this.redactString(input.message));
-      redacted.name = input.name;
-      redacted.stack = input.stack ? this.redactString(input.stack) : undefined;
-      return redacted;
-    }
+    if (input instanceof Error) {}
     if (Array.isArray(input)) {
       return input.map((item) => this.redact(item));
killedBy: AH-SECRETS-001: secrets broker redactSecrets handles Error objects
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] ConditionalExpression
security/secrets-broker.ts:193:9
       redacted.stack = input.stack ? this.redactString(input.stack) : undefined;
       return redacted;
     }
-    if (Array.isArray(input)) {
+    if (true) {
       return input.map((item) => this.redact(item));
     }
killedBy: AH-SECRETS-001: secrets broker redactSecrets handles objects recursively
statusReason: input.map is not a function

[Survived] ConditionalExpression
security/secrets-broker.ts:193:9
       redacted.stack = input.stack ? this.redactString(input.stack) : undefined;
       return redacted;
     }
-    if (Array.isArray(input)) {
+    if (false) {
       return input.map((item) => this.redact(item));
     }

[Killed] ArrowFunction
security/secrets-broker.ts:194:24
       return redacted;
     }
     if (Array.isArray(input)) {
-      return input.map((item) => this.redact(item));
+      return input.map(() => undefined);
     }
     if (typeof input === 'object') {
killedBy: AH-SECRETS-001: secrets broker redactSecrets handles arrays
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] BlockStatement
security/secrets-broker.ts:196:36
     if (Array.isArray(input)) {
       return input.map((item) => this.redact(item));
     }
-    if (typeof input === 'object') {
-      const result: Record<string, unknown> = {};
-      for (const [key, value] of Object.entries(input as Record<string, unknown>)) {
-        result[key] = this.redact(value);
-      }
-      return result;
-    }
+    if (typeof input === 'object') {}
     return input;
   }
killedBy: AH-SECRETS-001: secrets broker redactSecrets handles objects recursively
statusReason: expected '{"message":"ok","detail":{"key":"sk-s…' not to contain 'sk-secret-123'

[Killed] EqualityOperator
security/secrets-broker.ts:196:9
     if (Array.isArray(input)) {
       return input.map((item) => this.redact(item));
     }
-    if (typeof input === 'object') {
+    if (typeof input !== 'object') {
       const result: Record<string, unknown> = {};
       for (const [key, value] of Object.entries(input as Record<string, unknown>)) {
killedBy: AH-SECRETS-001: secrets broker redactSecrets handles objects recursively
statusReason: expected '{"message":"ok","detail":{"key":"sk-s…' not to contain 'sk-secret-123'

[Survived] BlockStatement
security/secrets-broker.ts:198:84
     }
     if (typeof input === 'object') {
       const result: Record<string, unknown> = {};
-      for (const [key, value] of Object.entries(input as Record<string, unknown>)) {
-        result[key] = this.redact(value);
-      }
+      for (const [key, value] of Object.entries(input as Record<string, unknown>)) {}
       return result;
     }

[Killed] BlockStatement
security/secrets-broker.ts:206:17
     return input;
   }
 
-  flush(): void {
-    if (!this.dataDir) return;
-    const filePath = join(this.dataDir, 'secrets.enc.json');
-    mkdirSync(dirname(filePath), { recursive: true });
-    const data = JSON.stringify([...this.secretStore.values()]);
-    writeFileSync(filePath, data, 'utf8');
-  }
+  flush(): void {}
 
   getInternalStore(): Map<string, InternalRecord> {
killedBy: AH-SECRETS-001: secrets broker persists to encrypted file and reloads
statusReason: expected null to be 'sk-persisted-123' // Object.is equality

[Killed] BooleanLiteral
security/secrets-broker.ts:207:9
   }
 
   flush(): void {
-    if (!this.dataDir) return;
+    if (this.dataDir) return;
     const filePath = join(this.dataDir, 'secrets.enc.json');
     mkdirSync(dirname(filePath), { recursive: true });
killedBy: AH-SECRETS-001: secrets broker persists to encrypted file and reloads
statusReason: expected null to be 'sk-persisted-123' // Object.is equality

[Killed] ConditionalExpression
security/secrets-broker.ts:207:9
   }
 
   flush(): void {
-    if (!this.dataDir) return;
+    if (true) return;
     const filePath = join(this.dataDir, 'secrets.enc.json');
     mkdirSync(dirname(filePath), { recursive: true });
killedBy: AH-SECRETS-001: secrets broker persists to encrypted file and reloads
statusReason: expected null to be 'sk-persisted-123' // Object.is equality

[Survived] BooleanLiteral
security/secrets-broker.ts:209:47
   flush(): void {
     if (!this.dataDir) return;
     const filePath = join(this.dataDir, 'secrets.enc.json');
-    mkdirSync(dirname(filePath), { recursive: true });
+    mkdirSync(dirname(filePath), { recursive: false });
     const data = JSON.stringify([...this.secretStore.values()]);
     writeFileSync(filePath, data, 'utf8');

[Survived] ObjectLiteral
security/secrets-broker.ts:209:34
   flush(): void {
     if (!this.dataDir) return;
     const filePath = join(this.dataDir, 'secrets.enc.json');
-    mkdirSync(dirname(filePath), { recursive: true });
+    mkdirSync(dirname(filePath), {});
     const data = JSON.stringify([...this.secretStore.values()]);
     writeFileSync(filePath, data, 'utf8');

[Killed] ArrayDeclaration
security/secrets-broker.ts:210:33
     if (!this.dataDir) return;
     const filePath = join(this.dataDir, 'secrets.enc.json');
     mkdirSync(dirname(filePath), { recursive: true });
-    const data = JSON.stringify([...this.secretStore.values()]);
+    const data = JSON.stringify([]);
     writeFileSync(filePath, data, 'utf8');
   }
killedBy: AH-SECRETS-001: secrets broker persists to encrypted file and reloads
statusReason: expected null to be 'sk-persisted-123' // Object.is equality

[Survived] StringLiteral
security/secrets-broker.ts:211:35
     const filePath = join(this.dataDir, 'secrets.enc.json');
     mkdirSync(dirname(filePath), { recursive: true });
     const data = JSON.stringify([...this.secretStore.values()]);
-    writeFileSync(filePath, data, 'utf8');
+    writeFileSync(filePath, data, "");
   }
 
