[Killed] BlockStatement
security/secrets-broker.ts:214:51
     writeFileSync(filePath, data, 'utf8');
   }
 
-  getInternalStore(): Map<string, InternalRecord> {
-    return new Map(this.secretStore);
-  }
+  getInternalStore(): Map<string, InternalRecord> {}
 
   // ---------------------------------------------------------------------------
killedBy: AH-SECRETS-001: secrets broker stored secret is encrypted (not plaintext in memory)
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] BlockStatement
security/secrets-broker.ts:222:43
   // Private methods
   // ---------------------------------------------------------------------------
 
-  private redactString(s: string): string {
-    let result = s;
-    for (const name of this.secretStore.keys()) {
-      const value = this.retrieve(name);
-      if (value && value.length > 0) {
-        // Escape regex special characters in the secret value
-        const escaped = value.replace(/[.*+?^${}()|[\]\\]/g, '\\$&');
-        result = result.replace(new RegExp(escaped, 'g'), '[REDACTED]');
-      }
-    }
-    return result;
-  }
+  private redactString(s: string): string {}
 
   private load(): void {
killedBy: AH-SECRETS-001: secrets broker redactSecrets removes known secret values from a string
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] BlockStatement
security/secrets-broker.ts:224:49
 
   private redactString(s: string): string {
     let result = s;
-    for (const name of this.secretStore.keys()) {
-      const value = this.retrieve(name);
-      if (value && value.length > 0) {
-        // Escape regex special characters in the secret value
-        const escaped = value.replace(/[.*+?^${}()|[\]\\]/g, '\\$&');
-        result = result.replace(new RegExp(escaped, 'g'), '[REDACTED]');
-      }
-    }
+    for (const name of this.secretStore.keys()) {}
     return result;
   }
killedBy: AH-SECRETS-001: secrets broker redactSecrets removes known secret values from a string
statusReason: expected 'Error: failed with key sk-secret-to-r…' not to contain 'sk-secret-to-redact'

[Killed] ConditionalExpression
security/secrets-broker.ts:226:11
     let result = s;
     for (const name of this.secretStore.keys()) {
       const value = this.retrieve(name);
-      if (value && value.length > 0) {
+      if (false) {
         // Escape regex special characters in the secret value
         const escaped = value.replace(/[.*+?^${}()|[\]\\]/g, '\\$&');
killedBy: AH-SECRETS-001: secrets broker redactSecrets removes known secret values from a string
statusReason: expected 'Error: failed with key sk-secret-to-r…' not to contain 'sk-secret-to-redact'

[Killed] BlockStatement
security/secrets-broker.ts:226:38
     let result = s;
     for (const name of this.secretStore.keys()) {
       const value = this.retrieve(name);
-      if (value && value.length > 0) {
-        // Escape regex special characters in the secret value
-        const escaped = value.replace(/[.*+?^${}()|[\]\\]/g, '\\$&');
-        result = result.replace(new RegExp(escaped, 'g'), '[REDACTED]');
-      }
+      if (value && value.length > 0) {}
     }
     return result;
killedBy: AH-SECRETS-001: secrets broker redactSecrets removes known secret values from a string
statusReason: expected 'Error: failed with key sk-secret-to-r…' not to contain 'sk-secret-to-redact'

[Killed] Regex
security/secrets-broker.ts:228:39
       const value = this.retrieve(name);
       if (value && value.length > 0) {
         // Escape regex special characters in the secret value
-        const escaped = value.replace(/[.*+?^${}()|[\]\\]/g, '\\$&');
+        const escaped = value.replace(/[^.*+?^${}()|[\]\\]/g, '\\$&');
         result = result.replace(new RegExp(escaped, 'g'), '[REDACTED]');
       }
killedBy: AH-SECRETS-001: secrets broker redactSecrets removes known secret values from a string
statusReason: expected 'Error: failed with key sk-secret-to-r…' not to contain 'sk-secret-to-redact'

[Killed] StringLiteral
security/secrets-broker.ts:229:59
       if (value && value.length > 0) {
         // Escape regex special characters in the secret value
         const escaped = value.replace(/[.*+?^${}()|[\]\\]/g, '\\$&');
-        result = result.replace(new RegExp(escaped, 'g'), '[REDACTED]');
+        result = result.replace(new RegExp(escaped, 'g'), "");
       }
     }
killedBy: AH-SECRETS-001: secrets broker redactSecrets removes known secret values from a string
statusReason: expected 'Error: failed with key  in request' to contain '[REDACTED]'

[Killed] BlockStatement
security/secrets-broker.ts:235:24
     return result;
   }
 
-  private load(): void {
-    if (!this.dataDir) return;
-    const filePath = join(this.dataDir, 'secrets.enc.json');
-    if (!existsSync(filePath)) return;
-
-    try {
-      const data = readFileSync(filePath, 'utf8');
-      const records: InternalRecord[] = JSON.parse(data);
-      for (const record of records) {
-        this.secretStore.set(record.name, record);
-      }
-    } catch {
-      // Corrupted or unreadable file - start fresh
-    }
-  }
+  private load(): void {}
 }
 
killedBy: AH-SECRETS-001: secrets broker persists to encrypted file and reloads
statusReason: expected null to be 'sk-persisted-123' // Object.is equality

[Killed] ConditionalExpression
security/secrets-broker.ts:236:9
   }
 
   private load(): void {
-    if (!this.dataDir) return;
+    if (true) return;
     const filePath = join(this.dataDir, 'secrets.enc.json');
     if (!existsSync(filePath)) return;
killedBy: AH-SECRETS-001: secrets broker persists to encrypted file and reloads
statusReason: expected null to be 'sk-persisted-123' // Object.is equality

[Killed] BooleanLiteral
security/secrets-broker.ts:236:9
   }
 
   private load(): void {
-    if (!this.dataDir) return;
+    if (this.dataDir) return;
     const filePath = join(this.dataDir, 'secrets.enc.json');
     if (!existsSync(filePath)) return;
killedBy: AH-SECRETS-001: secrets broker persists to encrypted file and reloads
statusReason: expected null to be 'sk-persisted-123' // Object.is equality

[Killed] ConditionalExpression
security/secrets-broker.ts:238:9
   private load(): void {
     if (!this.dataDir) return;
     const filePath = join(this.dataDir, 'secrets.enc.json');
-    if (!existsSync(filePath)) return;
+    if (true) return;
 
     try {
killedBy: AH-SECRETS-001: secrets broker persists to encrypted file and reloads
statusReason: expected null to be 'sk-persisted-123' // Object.is equality

[Killed] BooleanLiteral
security/secrets-broker.ts:238:9
   private load(): void {
     if (!this.dataDir) return;
     const filePath = join(this.dataDir, 'secrets.enc.json');
-    if (!existsSync(filePath)) return;
+    if (existsSync(filePath)) return;
 
     try {
killedBy: AH-SECRETS-001: secrets broker persists to encrypted file and reloads
statusReason: expected null to be 'sk-persisted-123' // Object.is equality

[Killed] BlockStatement
security/secrets-broker.ts:240:9
     const filePath = join(this.dataDir, 'secrets.enc.json');
     if (!existsSync(filePath)) return;
 
-    try {
-      const data = readFileSync(filePath, 'utf8');
-      const records: InternalRecord[] = JSON.parse(data);
-      for (const record of records) {
-        this.secretStore.set(record.name, record);
-      }
-    } catch {
+    try {} catch {
       // Corrupted or unreadable file - start fresh
     }
killedBy: AH-SECRETS-001: secrets broker persists to encrypted file and reloads
statusReason: expected null to be 'sk-persisted-123' // Object.is equality

[Killed] BlockStatement
security/secrets-broker.ts:243:37
     try {
       const data = readFileSync(filePath, 'utf8');
       const records: InternalRecord[] = JSON.parse(data);
-      for (const record of records) {
-        this.secretStore.set(record.name, record);
-      }
+      for (const record of records) {}
     } catch {
       // Corrupted or unreadable file - start fresh
killedBy: AH-SECRETS-001: secrets broker persists to encrypted file and reloads
statusReason: expected null to be 'sk-persisted-123' // Object.is equality
