[Killed] BooleanLiteral
router/static-router.ts:45:46
   opts: RouterOptions = {},
 ): RoutingResult {
   const features = profileIntent(input);
-  const policyAllows = opts.policy_allows ?? true;
+  const policyAllows = opts.policy_allows ?? false;
   const frozenSnapshot = true;
 
killedBy: mutation-kill: router all decision paths routes simple greeting to direct
statusReason: expected 'deny' to be 'direct' // Object.is equality

[Killed] LogicalOperator
router/static-router.ts:45:24
   opts: RouterOptions = {},
 ): RoutingResult {
   const features = profileIntent(input);
-  const policyAllows = opts.policy_allows ?? true;
+  const policyAllows = opts.policy_allows && true;
   const frozenSnapshot = true;
 
killedBy: mutation-kill: router all decision paths routes simple greeting to direct
statusReason: expected 'deny' to be 'direct' // Object.is equality

[Killed] BooleanLiteral
router/static-router.ts:46:26
 ): RoutingResult {
   const features = profileIntent(input);
   const policyAllows = opts.policy_allows ?? true;
-  const frozenSnapshot = true;
+  const frozenSnapshot = false;
 
   // Deny if policy doesn't allow
killedBy: AH-ROUTER-001: static router routes simple no-tool prompt to direct
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
router/static-router.ts:49:7
   const frozenSnapshot = true;
 
   // Deny if policy doesn't allow
-  if (!policyAllows) {
+  if (true) {
     return {
       strategy: 'deny',
killedBy: mutation-kill: router all decision paths routes simple greeting to direct
statusReason: expected 'deny' to be 'direct' // Object.is equality

[Killed] ConditionalExpression
router/static-router.ts:49:7
   const frozenSnapshot = true;
 
   // Deny if policy doesn't allow
-  if (!policyAllows) {
+  if (false) {
     return {
       strategy: 'deny',
killedBy: AH-ROUTER-001: static router denies when policy does not allow
statusReason: expected 'direct' to be 'deny' // Object.is equality

[Killed] ObjectLiteral
router/static-router.ts:50:12
 
   // Deny if policy doesn't allow
   if (!policyAllows) {
-    return {
-      strategy: 'deny',
-      reason: { code: 'POLICY_DENIED', message: 'Policy does not allow this request' },
-      features,
-      model_hint: 'none',
-      frozen_snapshot: frozenSnapshot,
-    };
+    return {};
   }
 
killedBy: mutation-kill: router all decision paths denies when policy does not allow
statusReason: expected undefined to be 'deny' // Object.is equality

[Killed] ObjectLiteral
router/static-router.ts:52:15
   if (!policyAllows) {
     return {
       strategy: 'deny',
-      reason: { code: 'POLICY_DENIED', message: 'Policy does not allow this request' },
+      reason: {},
       features,
       model_hint: 'none',
killedBy: mutation-kill: router all decision paths denies when policy does not allow
statusReason: expected undefined to be 'POLICY_DENIED' // Object.is equality

[Killed] ConditionalExpression
router/static-router.ts:60:7
   }
 
   // Deny high-risk unauthorized
-  if (features.effect_risk === 'high' && features.uncertainty > 0) {
+  if (true) {
     return {
       strategy: 'deny',
killedBy: AH-ROUTER-001: static router routes simple no-tool prompt to direct
statusReason: expected 'deny' to be 'direct' // Object.is equality

[Killed] ConditionalExpression
router/static-router.ts:60:7
   }
 
   // Deny high-risk unauthorized
-  if (features.effect_risk === 'high' && features.uncertainty > 0) {
+  if (true && features.uncertainty > 0) {
     return {
       strategy: 'deny',
killedBy: precision: static-router exact decisions multi-dependency -> plan_execute + MULTI_STEP_OR_TRANSACTIONAL
statusReason: expected 'deny' to be 'plan_execute' // Object.is equality

[Killed] StringLiteral
router/static-router.ts:63:23
   if (features.effect_risk === 'high' && features.uncertainty > 0) {
     return {
       strategy: 'deny',
-      reason: { code: 'HIGH_RISK_UNCERTAIN', message: 'High risk with high uncertainty denied' },
+      reason: { code: "", message: 'High risk with high uncertainty denied' },
       features,
       model_hint: 'none',
killedBy: AH-ROUTER-001: static router denies high-risk uncertain tasks
statusReason: expected '' to be 'HIGH_RISK_UNCERTAIN' // Object.is equality

[Killed] StringLiteral
router/static-router.ts:65:19
       strategy: 'deny',
       reason: { code: 'HIGH_RISK_UNCERTAIN', message: 'High risk with high uncertainty denied' },
       features,
-      model_hint: 'none',
+      model_hint: "",
       frozen_snapshot: frozenSnapshot,
     };
killedBy: precision: static-router exact decisions high risk uncertain -> deny + HIGH_RISK_UNCERTAIN
statusReason: expected '' to be 'none' // Object.is equality

[Killed] BlockStatement
router/static-router.ts:71:112
   }
 
   // Plan+Execute: multiple dependent steps or transactional file changes
-  if (features.requires_file_transaction || (features.dependency_count >= 2) || features.steps_estimated >= 3) {
-    return {
-      strategy: 'plan_execute',
-      reason: {
-        code: 'MULTI_STEP_OR_TRANSACTIONAL',
-        message: `Selected plan_execute: ${features.requires_file_transaction ? 'file transaction' : `${features.dependency_count} dependencies`}, ${features.steps_estimated} estimated steps`,
-      },
-      features,
-      model_hint: 'scripted_test',
-      frozen_snapshot: frozenSnapshot,
-    };
-  }
+  if (features.requires_file_transaction || (features.dependency_count >= 2) || features.steps_estimated >= 3) {}
 
   // ReAct: next action depends on a tool observation
killedBy: precision: static-router exact decisions file transaction -> plan_execute + MULTI_STEP_OR_TRANSACTIONAL
statusReason: expected 'react' to be 'plan_execute' // Object.is equality

[Killed] EqualityOperator
router/static-router.ts:71:46
   }
 
   // Plan+Execute: multiple dependent steps or transactional file changes
-  if (features.requires_file_transaction || (features.dependency_count >= 2) || features.steps_estimated >= 3) {
+  if (features.requires_file_transaction || (features.dependency_count < 2) || features.steps_estimated >= 3) {
     return {
       strategy: 'plan_execute',
killedBy: precision: static-router exact decisions simple greeting -> direct + SINGLE_STEP_NO_TOOLS
statusReason: expected 'plan_execute' to be 'direct' // Object.is equality

[Killed] StringLiteral
router/static-router.ts:73:17
   // Plan+Execute: multiple dependent steps or transactional file changes
   if (features.requires_file_transaction || (features.dependency_count >= 2) || features.steps_estimated >= 3) {
     return {
-      strategy: 'plan_execute',
+      strategy: "",
       reason: {
         code: 'MULTI_STEP_OR_TRANSACTIONAL',
killedBy: precision: static-router exact decisions file transaction -> plan_execute + MULTI_STEP_OR_TRANSACTIONAL
statusReason: expected '' to be 'plan_execute' // Object.is equality

[Killed] ObjectLiteral
router/static-router.ts:74:15
   if (features.requires_file_transaction || (features.dependency_count >= 2) || features.steps_estimated >= 3) {
     return {
       strategy: 'plan_execute',
-      reason: {
-        code: 'MULTI_STEP_OR_TRANSACTIONAL',
-        message: `Selected plan_execute: ${features.requires_file_transaction ? 'file transaction' : `${features.dependency_count} dependencies`}, ${features.steps_estimated} estimated steps`,
-      },
+      reason: {},
       features,
       model_hint: 'scripted_test',
killedBy: precision: static-router exact decisions file transaction -> plan_execute + MULTI_STEP_OR_TRANSACTIONAL
statusReason: expected undefined to be 'MULTI_STEP_OR_TRANSACTIONAL' // Object.is equality

[Killed] StringLiteral
router/static-router.ts:75:15
     return {
       strategy: 'plan_execute',
       reason: {
-        code: 'MULTI_STEP_OR_TRANSACTIONAL',
+        code: "",
         message: `Selected plan_execute: ${features.requires_file_transaction ? 'file transaction' : `${features.dependency_count} dependencies`}, ${features.steps_estimated} estimated steps`,
       },
killedBy: precision: static-router exact decisions file transaction -> plan_execute + MULTI_STEP_OR_TRANSACTIONAL
statusReason: expected '' to be 'MULTI_STEP_OR_TRANSACTIONAL' // Object.is equality

[Survived] StringLiteral
router/static-router.ts:76:18
       strategy: 'plan_execute',
       reason: {
         code: 'MULTI_STEP_OR_TRANSACTIONAL',
-        message: `Selected plan_execute: ${features.requires_file_transaction ? 'file transaction' : `${features.dependency_count} dependencies`}, ${features.steps_estimated} estimated steps`,
+        message: ``,
       },
       features,

[Killed] ConditionalExpression
router/static-router.ts:85:7
   }
 
   // ReAct: next action depends on a tool observation
-  if (features.needs_tools && features.tool_count >= 1 && features.requires_interaction) {
+  if (true) {
     return {
       strategy: 'react',
killedBy: precision: static-router exact decisions simple greeting -> direct + SINGLE_STEP_NO_TOOLS
statusReason: expected 'react' to be 'direct' // Object.is equality

[Killed] LogicalOperator
router/static-router.ts:85:7
   }
 
   // ReAct: next action depends on a tool observation
-  if (features.needs_tools && features.tool_count >= 1 && features.requires_interaction) {
+  if (features.needs_tools && features.tool_count >= 1 || features.requires_interaction) {
     return {
       strategy: 'react',
killedBy: precision: static-router exact decisions uncertain tool use -> react + OBSERVATION_DEPENDENT
statusReason: expected 'TOOL_OBSERVATION_DEPENDENT' to be 'OBSERVATION_DEPENDENT' // Object.is equality

[NoCoverage] ObjectLiteral
router/static-router.ts:86:12
 
   // ReAct: next action depends on a tool observation
   if (features.needs_tools && features.tool_count >= 1 && features.requires_interaction) {
-    return {
-      strategy: 'react',
-      reason: {
-        code: 'TOOL_OBSERVATION_DEPENDENT',
-        message: `Selected react: needs ${features.tool_count} tool(s) with interaction`,
-      },
-      features,
-      model_hint: 'scripted_test',
-      frozen_snapshot: frozenSnapshot,
-    };
+    return {};
   }
 

[NoCoverage] ObjectLiteral
router/static-router.ts:88:15
   if (features.needs_tools && features.tool_count >= 1 && features.requires_interaction) {
     return {
       strategy: 'react',
-      reason: {
-        code: 'TOOL_OBSERVATION_DEPENDENT',
-        message: `Selected react: needs ${features.tool_count} tool(s) with interaction`,
-      },
+      reason: {},
       features,
       model_hint: 'scripted_test',

[Killed] ConditionalExpression
router/static-router.ts:99:7
   }
 
   // ReAct: needs tools but step depends on observation (even without explicit interaction)
-  if (features.needs_tools && features.uncertainty > 0) {
+  if (false) {
     return {
       strategy: 'react',
killedBy: precision: static-router exact decisions uncertain tool use -> react + OBSERVATION_DEPENDENT
statusReason: expected 'TOOL_NEEDED' to be 'OBSERVATION_DEPENDENT' // Object.is equality

[Killed] LogicalOperator
router/static-router.ts:99:7
   }
 
   // ReAct: needs tools but step depends on observation (even without explicit interaction)
-  if (features.needs_tools && features.uncertainty > 0) {
+  if (features.needs_tools || features.uncertainty > 0) {
     return {
       strategy: 'react',
killedBy: precision: static-router exact decisions tool needed without uncertainty -> react + TOOL_NEEDED
statusReason: expected 'OBSERVATION_DEPENDENT' to be 'TOOL_NEEDED' // Object.is equality

[Killed] ObjectLiteral
router/static-router.ts:100:12
 
   // ReAct: needs tools but step depends on observation (even without explicit interaction)
   if (features.needs_tools && features.uncertainty > 0) {
-    return {
-      strategy: 'react',
-      reason: {
-        code: 'OBSERVATION_DEPENDENT',
-        message: `Selected react: tool use with uncertainty ${features.uncertainty}`,
-      },
-      features,
-      model_hint: 'scripted_test',
-      frozen_snapshot: frozenSnapshot,
-    };
+    return {};
   }
 
killedBy: precision: static-router exact decisions uncertain tool use -> react + OBSERVATION_DEPENDENT
statusReason: expected undefined to be 'react' // Object.is equality

[Killed] ConditionalExpression
router/static-router.ts:113:7
   }
 
   // Direct: no tools + low risk + one step
-  if (!features.needs_tools && features.effect_risk !== 'high' && features.steps_estimated <= 1) {
+  if (true) {
     return {
       strategy: 'direct',
killedBy: precision: static-router exact decisions tool needed without uncertainty -> react + TOOL_NEEDED
statusReason: expected 'direct' to be 'react' // Object.is equality

[Killed] ConditionalExpression
router/static-router.ts:113:7
   }
 
   // Direct: no tools + low risk + one step
-  if (!features.needs_tools && features.effect_risk !== 'high' && features.steps_estimated <= 1) {
+  if (false) {
     return {
       strategy: 'direct',
killedBy: precision: static-router exact decisions simple greeting -> direct + SINGLE_STEP_NO_TOOLS
statusReason: expected 'DEFAULT_DIRECT' to be 'SINGLE_STEP_NO_TOOLS' // Object.is equality

[Killed] BlockStatement
router/static-router.ts:127:29
   }
 
   // Default: if needs tools but no dependencies, use ReAct
-  if (features.needs_tools) {
-    return {
-      strategy: 'react',
-      reason: {
-        code: 'TOOL_NEEDED',
-        message: `Selected react: tool needed (${features.tool_count} tool(s))`,
-      },
-      features,
-      model_hint: 'scripted_test',
-      frozen_snapshot: frozenSnapshot,
-    };
-  }
+  if (features.needs_tools) {}
 
   // Fallback: direct for simple tasks
killedBy: precision: static-router exact decisions tool needed without uncertainty -> react + TOOL_NEEDED
statusReason: expected 'direct' to be 'react' // Object.is equality

[Killed] ConditionalExpression
router/static-router.ts:127:7
   }
 
   // Default: if needs tools but no dependencies, use ReAct
-  if (features.needs_tools) {
+  if (false) {
     return {
       strategy: 'react',
killedBy: precision: static-router exact decisions tool needed without uncertainty -> react + TOOL_NEEDED
statusReason: expected 'direct' to be 'react' // Object.is equality

[NoCoverage] ObjectLiteral
router/static-router.ts:143:13
   // Fallback: direct for simple tasks
   return {
     strategy: 'direct',
-    reason: {
-      code: 'DEFAULT_DIRECT',
-      message: 'Selected direct: fallback for simple task',
-    },
+    reason: {},
     features,
     model_hint: 'scripted_test',

[NoCoverage] StringLiteral
router/static-router.ts:148:17
       message: 'Selected direct: fallback for simple task',
     },
     features,
-    model_hint: 'scripted_test',
+    model_hint: "",
     frozen_snapshot: frozenSnapshot,
   };
