[Killed] BlockStatement
runtime/retry.ts:28:116
   idempotencyKey?: string;
 }
 
-export function createRetryableError(message: string, retryable: boolean, idempotencyKey?: string): RetryableError {
-  const err = new Error(message) as RetryableError;
-  err.retryable = retryable;
-  err.idempotencyKey = idempotencyKey;
-  err.name = 'RetryableError';
-  return err;
-}
+export function createRetryableError(message: string, retryable: boolean, idempotencyKey?: string): RetryableError {}
 
 export function isRetryable(err: unknown): boolean {
killedBy: AH-CAPMAP-020: retry with bounded backoff retries on retryable error and succeeds
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
runtime/retry.ts:36:52
   return err;
 }
 
-export function isRetryable(err: unknown): boolean {
-  if (err instanceof Error && 'retryable' in err) {
-    return (err as RetryableError).retryable;
-  }
-  return false;
-}
+export function isRetryable(err: unknown): boolean {}
 
 export function hasIdempotencyKey(err: unknown): boolean {
killedBy: AH-CAPMAP-020: retry with bounded backoff retries on retryable error and succeeds
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
runtime/retry.ts:37:51
 }
 
 export function isRetryable(err: unknown): boolean {
-  if (err instanceof Error && 'retryable' in err) {
-    return (err as RetryableError).retryable;
-  }
+  if (err instanceof Error && 'retryable' in err) {}
   return false;
 }
killedBy: AH-CAPMAP-020: retry with bounded backoff retries on retryable error and succeeds
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
runtime/retry.ts:37:7
 }
 
 export function isRetryable(err: unknown): boolean {
-  if (err instanceof Error && 'retryable' in err) {
+  if (err instanceof Error || 'retryable' in err) {
     return (err as RetryableError).retryable;
   }
killedBy: AH-CAPMAP-020: retry with bounded backoff isRetryable detects retryable errors
statusReason: expected undefined to be false // Object.is equality

[Killed] BlockStatement
runtime/retry.ts:43:58
   return false;
 }
 
-export function hasIdempotencyKey(err: unknown): boolean {
-  if (err instanceof Error && 'idempotencyKey' in err) {
-    return (err as RetryableError).idempotencyKey !== undefined;
-  }
-  return false;
-}
+export function hasIdempotencyKey(err: unknown): boolean {}
 
 export async function withRetry<T>(
killedBy: mutation-kill: retry all paths retries with idempotency key
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
runtime/retry.ts:44:56
 }
 
 export function hasIdempotencyKey(err: unknown): boolean {
-  if (err instanceof Error && 'idempotencyKey' in err) {
-    return (err as RetryableError).idempotencyKey !== undefined;
-  }
+  if (err instanceof Error && 'idempotencyKey' in err) {}
   return false;
 }
killedBy: AH-CAPMAP-020: retry with bounded backoff retries on retryable error and succeeds
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
runtime/retry.ts:44:7
 }
 
 export function hasIdempotencyKey(err: unknown): boolean {
-  if (err instanceof Error && 'idempotencyKey' in err) {
+  if (false) {
     return (err as RetryableError).idempotencyKey !== undefined;
   }
killedBy: AH-CAPMAP-020: retry with bounded backoff retries on retryable error and succeeds
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
runtime/retry.ts:45:12
 
 export function hasIdempotencyKey(err: unknown): boolean {
   if (err instanceof Error && 'idempotencyKey' in err) {
-    return (err as RetryableError).idempotencyKey !== undefined;
+    return false;
   }
   return false;
killedBy: mutation-kill: retry all paths retries with idempotency key
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
runtime/retry.ts:45:12
 
 export function hasIdempotencyKey(err: unknown): boolean {
   if (err instanceof Error && 'idempotencyKey' in err) {
-    return (err as RetryableError).idempotencyKey !== undefined;
+    return (err as RetryableError).idempotencyKey === undefined;
   }
   return false;
killedBy: AH-CAPMAP-020: retry with bounded backoff retries on retryable error and succeeds
statusReason: expected false to be true // Object.is equality

[Killed] UpdateOperator
runtime/retry.ts:60:5
   let lastError: Error | undefined;
 
   for (let attempt = 0; attempt <= maxRetries; attempt++) {
-    attempts++;
+    attempts--;
     try {
       const result = await fn();
killedBy: mutation-kill: retry all paths does not retry non-retryable
statusReason: expected -1 to be 1 // Object.is equality

[Killed] BlockStatement
runtime/retry.ts:61:9
 
   for (let attempt = 0; attempt <= maxRetries; attempt++) {
     attempts++;
-    try {
-      const result = await fn();
-      return { success: true, result, attempts, totalDelayMs };
-    } catch (err) {
+    try {} catch (err) {
       lastError = err instanceof Error ? err : new Error(String(err));
 
killedBy: mutation-kill: retry all paths does not retry non-retryable
statusReason: expected 4 to be 1 // Object.is equality

[Killed] BooleanLiteral
runtime/retry.ts:63:25
     attempts++;
     try {
       const result = await fn();
-      return { success: true, result, attempts, totalDelayMs };
+      return { success: false, result, attempts, totalDelayMs };
     } catch (err) {
       lastError = err instanceof Error ? err : new Error(String(err));
killedBy: mutation-kill: retry all paths retries with idempotency key
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
runtime/retry.ts:64:19
     try {
       const result = await fn();
       return { success: true, result, attempts, totalDelayMs };
-    } catch (err) {
-      lastError = err instanceof Error ? err : new Error(String(err));
-
-      if (!isRetryable(err) || attempt === maxRetries) {
-        return { success: false, error: lastError, attempts, totalDelayMs };
-      }
-
-      // Check idempotency for effects
-      if (!hasIdempotencyKey(err)) {
-        // Non-idempotent effects cannot be retried
-        return { success: false, error: lastError, attempts, totalDelayMs };
-      }
-
-      // Calculate delay with jitter
-      const exponentialDelay = Math.min(maxDelayMs, baseDelayMs * Math.pow(2, attempt));
-      const jitter = exponentialDelay * jitterFactor * Math.random();
-      const delay = Math.round(exponentialDelay + jitter);
-      totalDelayMs += delay;
-
-      // Sleep
-      await new Promise((resolve) => setTimeout(resolve, delay));
-    }
+    } catch (err) {}
   }
 
killedBy: mutation-kill: retry all paths does not retry non-retryable
statusReason: expected 4 to be 1 // Object.is equality

[Killed] BooleanLiteral
runtime/retry.ts:67:11
     } catch (err) {
       lastError = err instanceof Error ? err : new Error(String(err));
 
-      if (!isRetryable(err) || attempt === maxRetries) {
+      if (isRetryable(err) || attempt === maxRetries) {
         return { success: false, error: lastError, attempts, totalDelayMs };
       }
killedBy: AH-CAPMAP-020: retry with bounded backoff retries on retryable error and succeeds
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
runtime/retry.ts:67:32
     } catch (err) {
       lastError = err instanceof Error ? err : new Error(String(err));
 
-      if (!isRetryable(err) || attempt === maxRetries) {
+      if (!isRetryable(err) || attempt !== maxRetries) {
         return { success: false, error: lastError, attempts, totalDelayMs };
       }
killedBy: AH-CAPMAP-020: retry with bounded backoff retries on retryable error and succeeds
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
runtime/retry.ts:68:27
       lastError = err instanceof Error ? err : new Error(String(err));
 
       if (!isRetryable(err) || attempt === maxRetries) {
-        return { success: false, error: lastError, attempts, totalDelayMs };
+        return { success: true, error: lastError, attempts, totalDelayMs };
       }
 
killedBy: AH-CAPMAP-020: retry with bounded backoff does not retry non-retryable error
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
runtime/retry.ts:68:16
       lastError = err instanceof Error ? err : new Error(String(err));
 
       if (!isRetryable(err) || attempt === maxRetries) {
-        return { success: false, error: lastError, attempts, totalDelayMs };
+        return {};
       }
 
killedBy: AH-CAPMAP-020: retry with bounded backoff does not retry non-retryable error
statusReason: expected undefined to be false // Object.is equality

[Killed] ConditionalExpression
runtime/retry.ts:72:11
       }
 
       // Check idempotency for effects
-      if (!hasIdempotencyKey(err)) {
+      if (true) {
         // Non-idempotent effects cannot be retried
         return { success: false, error: lastError, attempts, totalDelayMs };
killedBy: AH-CAPMAP-020: retry with bounded backoff retries on retryable error and succeeds
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
runtime/retry.ts:72:11
       }
 
       // Check idempotency for effects
-      if (!hasIdempotencyKey(err)) {
+      if (false) {
         // Non-idempotent effects cannot be retried
         return { success: false, error: lastError, attempts, totalDelayMs };
killedBy: AH-CAPMAP-020: retry with bounded backoff does not retry retryable error without idempotency key
statusReason: expected 4 to be 1 // Object.is equality

[Killed] BooleanLiteral
runtime/retry.ts:74:27
       // Check idempotency for effects
       if (!hasIdempotencyKey(err)) {
         // Non-idempotent effects cannot be retried
-        return { success: false, error: lastError, attempts, totalDelayMs };
+        return { success: true, error: lastError, attempts, totalDelayMs };
       }
 
killedBy: AH-CAPMAP-020: retry with bounded backoff does not retry retryable error without idempotency key
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
runtime/retry.ts:74:16
       // Check idempotency for effects
       if (!hasIdempotencyKey(err)) {
         // Non-idempotent effects cannot be retried
-        return { success: false, error: lastError, attempts, totalDelayMs };
+        return {};
       }
 
killedBy: AH-CAPMAP-020: retry with bounded backoff does not retry retryable error without idempotency key
statusReason: expected undefined to be false // Object.is equality

[Survived] ArithmeticOperator
runtime/retry.ts:78:53
       }
 
       // Calculate delay with jitter
-      const exponentialDelay = Math.min(maxDelayMs, baseDelayMs * Math.pow(2, attempt));
+      const exponentialDelay = Math.min(maxDelayMs, baseDelayMs / Math.pow(2, attempt));
       const jitter = exponentialDelay * jitterFactor * Math.random();
       const delay = Math.round(exponentialDelay + jitter);

[Survived] MethodExpression
runtime/retry.ts:78:32
       }
 
       // Calculate delay with jitter
-      const exponentialDelay = Math.min(maxDelayMs, baseDelayMs * Math.pow(2, attempt));
+      const exponentialDelay = Math.max(maxDelayMs, baseDelayMs * Math.pow(2, attempt));
       const jitter = exponentialDelay * jitterFactor * Math.random();
       const delay = Math.round(exponentialDelay + jitter);

[Survived] ArithmeticOperator
runtime/retry.ts:79:22
 
       // Calculate delay with jitter
       const exponentialDelay = Math.min(maxDelayMs, baseDelayMs * Math.pow(2, attempt));
-      const jitter = exponentialDelay * jitterFactor * Math.random();
+      const jitter = exponentialDelay / jitterFactor * Math.random();
       const delay = Math.round(exponentialDelay + jitter);
       totalDelayMs += delay;

[Survived] ArithmeticOperator
runtime/retry.ts:79:22
 
       // Calculate delay with jitter
       const exponentialDelay = Math.min(maxDelayMs, baseDelayMs * Math.pow(2, attempt));
-      const jitter = exponentialDelay * jitterFactor * Math.random();
+      const jitter = exponentialDelay * jitterFactor / Math.random();
       const delay = Math.round(exponentialDelay + jitter);
       totalDelayMs += delay;

[Survived] ArithmeticOperator
runtime/retry.ts:80:32
       // Calculate delay with jitter
       const exponentialDelay = Math.min(maxDelayMs, baseDelayMs * Math.pow(2, attempt));
       const jitter = exponentialDelay * jitterFactor * Math.random();
-      const delay = Math.round(exponentialDelay + jitter);
+      const delay = Math.round(exponentialDelay - jitter);
       totalDelayMs += delay;
 

[Survived] AssignmentOperator
runtime/retry.ts:81:7
       const exponentialDelay = Math.min(maxDelayMs, baseDelayMs * Math.pow(2, attempt));
       const jitter = exponentialDelay * jitterFactor * Math.random();
       const delay = Math.round(exponentialDelay + jitter);
-      totalDelayMs += delay;
+      totalDelayMs -= delay;
 
       // Sleep

[Killed] ArrowFunction
runtime/retry.ts:84:25
       totalDelayMs += delay;
 
       // Sleep
-      await new Promise((resolve) => setTimeout(resolve, delay));
+      await new Promise(() => undefined);
     }
   }
killedBy: AH-CAPMAP-020: retry with bounded backoff retries on retryable error and succeeds
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[NoCoverage] BooleanLiteral
runtime/retry.ts:88:21
     }
   }
 
-  return { success: false, error: lastError, attempts, totalDelayMs };
+  return { success: true, error: lastError, attempts, totalDelayMs };
 }
 

[Killed] BlockStatement
runtime/retry.ts:96:11
   baseDelayMs: number,
   maxDelayMs: number,
   jitterFactor: number,
-): number {
-  const exponentialDelay = Math.min(maxDelayMs, baseDelayMs * Math.pow(2, attempt));
-  const jitter = exponentialDelay * jitterFactor * Math.random();
-  return Math.round(exponentialDelay + jitter);
-}
+): number {}
 
killedBy: AH-CAPMAP-020: retry with bounded backoff calculateBackoff produces bounded delays
statusReason: expected undefined to be 10 // Object.is equality

[Killed] ArithmeticOperator
runtime/retry.ts:97:49
   maxDelayMs: number,
   jitterFactor: number,
 ): number {
-  const exponentialDelay = Math.min(maxDelayMs, baseDelayMs * Math.pow(2, attempt));
+  const exponentialDelay = Math.min(maxDelayMs, baseDelayMs / Math.pow(2, attempt));
   const jitter = exponentialDelay * jitterFactor * Math.random();
   return Math.round(exponentialDelay + jitter);
killedBy: coverage: retry methods calculateBackoff respects max delay
statusReason: expected +0 to be 50 // Object.is equality

[Killed] MethodExpression
runtime/retry.ts:97:28
   maxDelayMs: number,
   jitterFactor: number,
 ): number {
-  const exponentialDelay = Math.min(maxDelayMs, baseDelayMs * Math.pow(2, attempt));
+  const exponentialDelay = Math.max(maxDelayMs, baseDelayMs * Math.pow(2, attempt));
   const jitter = exponentialDelay * jitterFactor * Math.random();
   return Math.round(exponentialDelay + jitter);
killedBy: AH-CAPMAP-020: retry with bounded backoff calculateBackoff produces bounded delays
statusReason: expected 100 to be 10 // Object.is equality

[Survived] ArithmeticOperator
runtime/retry.ts:99:21
 ): number {
   const exponentialDelay = Math.min(maxDelayMs, baseDelayMs * Math.pow(2, attempt));
   const jitter = exponentialDelay * jitterFactor * Math.random();
-  return Math.round(exponentialDelay + jitter);
+  return Math.round(exponentialDelay - jitter);
 }
 
