[Killed] BlockStatement
session/durable-session.ts:72:30
   private readonly state = new Map<string, unknown>();
   private corruptCount = 0;
 
-  constructor(runId: string) {
-    this.append({
-      type: 'run_created',
-      run_id: runId,
-      data: { run_id: runId },
-    });
-  }
+  constructor(runId: string) {}
 
   append(input: Omit<SessionEvent, 'seq' | 'timestamp' | 'prev_hash' | 'event_hash'>): SessionEvent {
killedBy: AH-SESSION-001: durable session events creates a run_created event on construction
statusReason: expected +0 to be 1 // Object.is equality

[Survived] ObjectLiteral
session/durable-session.ts:76:13
     this.append({
       type: 'run_created',
       run_id: runId,
-      data: { run_id: runId },
+      data: {},
     });
   }

[Killed] BlockStatement
session/durable-session.ts:80:101
     });
   }
 
-  append(input: Omit<SessionEvent, 'seq' | 'timestamp' | 'prev_hash' | 'event_hash'>): SessionEvent {
-    const seq = ++this.seqCounter;
-    const timestamp = new Date().toISOString();
-    const prevHash = this.lastHash;
-
-    const event: SessionEvent = {
-      ...input,
-      seq,
-      timestamp,
-      prev_hash: prevHash,
-      event_hash: '',
-    };
-
-    event.event_hash = this.hashEvent(event);
-    this.events.push(event);
-    this.lastHash = event.event_hash;
-
-    // Update state
-    this.applyEvent(event);
-
-    return event;
-  }
+  append(input: Omit<SessionEvent, 'seq' | 'timestamp' | 'prev_hash' | 'event_hash'>): SessionEvent {}
 
   snapshot(version?: number): SessionSnapshot {
killedBy: AH-SESSION-001: durable session events creates a run_created event on construction
statusReason: expected +0 to be 1 // Object.is equality

[Killed] UpdateOperator
session/durable-session.ts:81:17
   }
 
   append(input: Omit<SessionEvent, 'seq' | 'timestamp' | 'prev_hash' | 'event_hash'>): SessionEvent {
-    const seq = ++this.seqCounter;
+    const seq = --this.seqCounter;
     const timestamp = new Date().toISOString();
     const prevHash = this.lastHash;
killedBy: AH-SESSION-001: durable session events appends events with sequential sequence numbers
statusReason: expected -3 to be 3 // Object.is equality

[Killed] BlockStatement
session/durable-session.ts:103:47
     return event;
   }
 
-  snapshot(version?: number): SessionSnapshot {
-    const ver = version ?? this.snapshots.length + 1;
-    const snap: SessionSnapshot = {
-      version: ver,
-      run_id: this.events[0]?.run_id ?? '',
-      created_at: new Date().toISOString(),
-      last_seq: this.seqCounter,
-      state: Object.fromEntries(this.state),
-      hash: '',
-    };
-    snap.hash = this.hashSnapshot(snap);
-    this.snapshots.push(snap);
-
-    this.append({
-      type: 'snapshot_created',
-      run_id: snap.run_id,
-      data: { version: ver, last_seq: snap.last_seq },
-    });
-
-    return snap;
-  }
+  snapshot(version?: number): SessionSnapshot {}
 
   getSnapshot(version: number): SessionSnapshot | undefined {
killedBy: AH-SESSION-001: snapshots creates a versioned snapshot
statusReason: Cannot read properties of undefined (reading 'version')

[Killed] LogicalOperator
session/durable-session.ts:104:17
   }
 
   snapshot(version?: number): SessionSnapshot {
-    const ver = version ?? this.snapshots.length + 1;
+    const ver = version && this.snapshots.length + 1;
     const snap: SessionSnapshot = {
       version: ver,
killedBy: AH-SESSION-001: snapshots creates a versioned snapshot
statusReason: expected undefined to be 1 // Object.is equality

[Killed] ArithmeticOperator
session/durable-session.ts:104:28
   }
 
   snapshot(version?: number): SessionSnapshot {
-    const ver = version ?? this.snapshots.length + 1;
+    const ver = version ?? this.snapshots.length - 1;
     const snap: SessionSnapshot = {
       version: ver,
killedBy: AH-SESSION-001: snapshots creates a versioned snapshot
statusReason: expected -1 to be 1 // Object.is equality

[Survived] LogicalOperator
session/durable-session.ts:107:15
     const ver = version ?? this.snapshots.length + 1;
     const snap: SessionSnapshot = {
       version: ver,
-      run_id: this.events[0]?.run_id ?? '',
+      run_id: this.events[0]?.run_id && '',
       created_at: new Date().toISOString(),
       last_seq: this.seqCounter,

[Survived] OptionalChaining
session/durable-session.ts:107:15
     const ver = version ?? this.snapshots.length + 1;
     const snap: SessionSnapshot = {
       version: ver,
-      run_id: this.events[0]?.run_id ?? '',
+      run_id: this.events[0].run_id ?? '',
       created_at: new Date().toISOString(),
       last_seq: this.seqCounter,

[Killed] BlockStatement
session/durable-session.ts:125:61
     return snap;
   }
 
-  getSnapshot(version: number): SessionSnapshot | undefined {
-    return this.snapshots.find((s) => s.version === version);
-  }
+  getSnapshot(version: number): SessionSnapshot | undefined {}
 
   getLatestSnapshot(): SessionSnapshot | undefined {
killedBy: AH-SESSION-001: snapshots can retrieve snapshot by version
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
session/durable-session.ts:126:39
   }
 
   getSnapshot(version: number): SessionSnapshot | undefined {
-    return this.snapshots.find((s) => s.version === version);
+    return this.snapshots.find((s) => true);
   }
 
killedBy: coverage: DurableSession methods snapshotCount and getSnapshot
statusReason: expected { version: 1, run_id: 'run-001', …(4) } to be undefined

[Killed] EqualityOperator
session/durable-session.ts:126:39
   }
 
   getSnapshot(version: number): SessionSnapshot | undefined {
-    return this.snapshots.find((s) => s.version === version);
+    return this.snapshots.find((s) => s.version !== version);
   }
 
killedBy: AH-SESSION-001: snapshots can retrieve snapshot by version
statusReason: expected 2 to be 1 // Object.is equality

[Killed] BlockStatement
session/durable-session.ts:129:52
     return this.snapshots.find((s) => s.version === version);
   }
 
-  getLatestSnapshot(): SessionSnapshot | undefined {
-    return this.snapshots[this.snapshots.length - 1];
-  }
+  getLatestSnapshot(): SessionSnapshot | undefined {}
 
   restore(fromSeq?: number): RestoreResult {
killedBy: AH-SESSION-001: snapshots snapshot version increments
statusReason: expected undefined to be 2 // Object.is equality

[Killed] ArithmeticOperator
session/durable-session.ts:130:27
   }
 
   getLatestSnapshot(): SessionSnapshot | undefined {
-    return this.snapshots[this.snapshots.length - 1];
+    return this.snapshots[this.snapshots.length + 1];
   }
 
killedBy: AH-SESSION-001: snapshots snapshot version increments
statusReason: expected undefined to be 2 // Object.is equality

[Killed] LogicalOperator
session/durable-session.ts:134:22
   }
 
   restore(fromSeq?: number): RestoreResult {
-    const startSeq = fromSeq ?? 0;
+    const startSeq = fromSeq && 0;
     let replayed = 0;
 
killedBy: AH-SESSION-001: restore restore from snapshot replays only post-snapshot events
statusReason: expected 5 to be 2 // Object.is equality

[Survived] BlockStatement
session/durable-session.ts:142:32
     this.corruptCount = 0;
 
     // If restoring from a snapshot, apply snapshot state first
-    if (fromSeq !== undefined) {
-      const snap = this.snapshots.filter((s) => s.last_seq <= fromSeq).pop();
-      if (snap) {
-        for (const [key, value] of Object.entries(snap.state)) {
-          this.state.set(key, value);
-        }
-      }
-    }
+    if (fromSeq !== undefined) {}
 
     // Replay events from startSeq

[Survived] ConditionalExpression
session/durable-session.ts:142:9
     this.corruptCount = 0;
 
     // If restoring from a snapshot, apply snapshot state first
-    if (fromSeq !== undefined) {
+    if (true) {
       const snap = this.snapshots.filter((s) => s.last_seq <= fromSeq).pop();
       if (snap) {

[Survived] EqualityOperator
session/durable-session.ts:143:49
 
     // If restoring from a snapshot, apply snapshot state first
     if (fromSeq !== undefined) {
-      const snap = this.snapshots.filter((s) => s.last_seq <= fromSeq).pop();
+      const snap = this.snapshots.filter((s) => s.last_seq < fromSeq).pop();
       if (snap) {
         for (const [key, value] of Object.entries(snap.state)) {

[Survived] ConditionalExpression
session/durable-session.ts:143:49
 
     // If restoring from a snapshot, apply snapshot state first
     if (fromSeq !== undefined) {
-      const snap = this.snapshots.filter((s) => s.last_seq <= fromSeq).pop();
+      const snap = this.snapshots.filter((s) => false).pop();
       if (snap) {
         for (const [key, value] of Object.entries(snap.state)) {

[Killed] ConditionalExpression
session/durable-session.ts:144:11
     // If restoring from a snapshot, apply snapshot state first
     if (fromSeq !== undefined) {
       const snap = this.snapshots.filter((s) => s.last_seq <= fromSeq).pop();
-      if (snap) {
+      if (true) {
         for (const [key, value] of Object.entries(snap.state)) {
           this.state.set(key, value);
killedBy: AH-SESSION-001: restore restore replays events deterministically
statusReason: Cannot read properties of undefined (reading 'state')

[Survived] ConditionalExpression
session/durable-session.ts:144:11
     // If restoring from a snapshot, apply snapshot state first
     if (fromSeq !== undefined) {
       const snap = this.snapshots.filter((s) => s.last_seq <= fromSeq).pop();
-      if (snap) {
+      if (false) {
         for (const [key, value] of Object.entries(snap.state)) {
           this.state.set(key, value);

[Survived] BlockStatement
session/durable-session.ts:145:64
     if (fromSeq !== undefined) {
       const snap = this.snapshots.filter((s) => s.last_seq <= fromSeq).pop();
       if (snap) {
-        for (const [key, value] of Object.entries(snap.state)) {
-          this.state.set(key, value);
-        }
+        for (const [key, value] of Object.entries(snap.state)) {}
       }
     }

[Killed] BlockStatement
session/durable-session.ts:152:38
     }
 
     // Replay events from startSeq
-    for (const event of this.events) {
-      if (event.seq <= startSeq) continue;
-
-      // Verify event hash chain
-      const expectedHash = this.hashEvent(event);
-      if (event.event_hash !== expectedHash) {
-        this.corruptCount++;
-        continue;
-      }
-
-      // Verify prev_hash chain
-      if (event.seq > 1 && replayed > 0) {
-        const prevEvent = this.events[event.seq - 2];
-        if (prevEvent && event.prev_hash !== prevEvent.event_hash) {
-          this.corruptCount++;
-          continue;
-        }
-      }
-
-      this.applyEvent(event);
-      replayed++;
-    }
+    for (const event of this.events) {}
 
     return {
killedBy: AH-SESSION-001: restore restore replays events deterministically
statusReason: expected +0 to be 5 // Object.is equality

[Killed] EqualityOperator
session/durable-session.ts:153:11
 
     // Replay events from startSeq
     for (const event of this.events) {
-      if (event.seq <= startSeq) continue;
+      if (event.seq < startSeq) continue;
 
       // Verify event hash chain
killedBy: AH-SESSION-001: crash restore snapshot + restore works for long running session
statusReason: expected 7 to be 6 // Object.is equality

[Killed] ConditionalExpression
session/durable-session.ts:153:11
 
     // Replay events from startSeq
     for (const event of this.events) {
-      if (event.seq <= startSeq) continue;
+      if (false) continue;
 
       // Verify event hash chain
killedBy: AH-SESSION-001: restore restore from snapshot replays only post-snapshot events
statusReason: expected 5 to be 2 // Object.is equality

[Killed] ConditionalExpression
session/durable-session.ts:157:11
 
       // Verify event hash chain
       const expectedHash = this.hashEvent(event);
-      if (event.event_hash !== expectedHash) {
+      if (true) {
         this.corruptCount++;
         continue;
killedBy: AH-SESSION-001: crash restore restore produces same state as before crash
statusReason: expected undefined to deeply equal [ 'read_file', 'write_file' ]

[Killed] EqualityOperator
session/durable-session.ts:157:11
 
       // Verify event hash chain
       const expectedHash = this.hashEvent(event);
-      if (event.event_hash !== expectedHash) {
+      if (event.event_hash === expectedHash) {
         this.corruptCount++;
         continue;
killedBy: AH-SESSION-001: crash restore restore produces same state as before crash
statusReason: expected undefined to deeply equal [ 'read_file', 'write_file' ]

[NoCoverage] UpdateOperator
session/durable-session.ts:158:9
       // Verify event hash chain
       const expectedHash = this.hashEvent(event);
       if (event.event_hash !== expectedHash) {
-        this.corruptCount++;
+        this.corruptCount--;
         continue;
       }

[Survived] ConditionalExpression
session/durable-session.ts:163:28
       }
 
       // Verify prev_hash chain
-      if (event.seq > 1 && replayed > 0) {
+      if (event.seq > 1 && true) {
         const prevEvent = this.events[event.seq - 2];
         if (prevEvent && event.prev_hash !== prevEvent.event_hash) {

[Survived] LogicalOperator
session/durable-session.ts:163:11
       }
 
       // Verify prev_hash chain
-      if (event.seq > 1 && replayed > 0) {
+      if (event.seq > 1 || replayed > 0) {
         const prevEvent = this.events[event.seq - 2];
         if (prevEvent && event.prev_hash !== prevEvent.event_hash) {

[Killed] ArithmeticOperator
session/durable-session.ts:164:39
 
       // Verify prev_hash chain
       if (event.seq > 1 && replayed > 0) {
-        const prevEvent = this.events[event.seq - 2];
+        const prevEvent = this.events[event.seq + 2];
         if (prevEvent && event.prev_hash !== prevEvent.event_hash) {
           this.corruptCount++;
killedBy: AH-SESSION-001: restore restore replays events deterministically
statusReason: expected 4 to be 5 // Object.is equality

[Killed] ConditionalExpression
session/durable-session.ts:165:13
       // Verify prev_hash chain
       if (event.seq > 1 && replayed > 0) {
         const prevEvent = this.events[event.seq - 2];
-        if (prevEvent && event.prev_hash !== prevEvent.event_hash) {
+        if (true) {
           this.corruptCount++;
           continue;
killedBy: AH-SESSION-001: crash restore restore produces same state as before crash
statusReason: expected undefined to deeply equal [ 'read_file', 'write_file' ]

[Killed] LogicalOperator
session/durable-session.ts:165:13
       // Verify prev_hash chain
       if (event.seq > 1 && replayed > 0) {
         const prevEvent = this.events[event.seq - 2];
-        if (prevEvent && event.prev_hash !== prevEvent.event_hash) {
+        if (prevEvent || event.prev_hash !== prevEvent.event_hash) {
           this.corruptCount++;
           continue;
killedBy: AH-SESSION-001: restore restore replays events deterministically
statusReason: expected 1 to be 5 // Object.is equality

[NoCoverage] UpdateOperator
session/durable-session.ts:166:11
       if (event.seq > 1 && replayed > 0) {
         const prevEvent = this.events[event.seq - 2];
         if (prevEvent && event.prev_hash !== prevEvent.event_hash) {
-          this.corruptCount++;
+          this.corruptCount--;
           continue;
         }

[Killed] UpdateOperator
session/durable-session.ts:172:7
       }
 
       this.applyEvent(event);
-      replayed++;
+      replayed--;
     }
 
killedBy: AH-SESSION-001: restore restore replays events deterministically
statusReason: expected -5 to be 5 // Object.is equality

[Killed] ObjectLiteral
session/durable-session.ts:175:12
       replayed++;
     }
 
-    return {
-      restored: true,
-      events_replayed: replayed,
-      last_seq: this.seqCounter,
-      state: Object.fromEntries(this.state),
-      corrupt_events: this.corruptCount,
-    };
+    return {};
   }
 
killedBy: AH-SESSION-001: crash restore restore produces same state as before crash
statusReason: Cannot read properties of undefined (reading 'executed_actions')

[Killed] BooleanLiteral
session/durable-session.ts:176:17
     }
 
     return {
-      restored: true,
+      restored: false,
       events_replayed: replayed,
       last_seq: this.seqCounter,
killedBy: AH-SESSION-001: restore restore replays events deterministically
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
session/durable-session.ts:184:40
     };
   }
 
-  getEvents(): readonly SessionEvent[] {
-    return [...this.events];
-  }
+  getEvents(): readonly SessionEvent[] {}
 
   getEventsByType(type: EventType): SessionEvent[] {
killedBy: precision: RuntimeLoop exact session events direct run produces exact event sequence
statusReason: events is not iterable

[Killed] ArrayDeclaration
session/durable-session.ts:185:12
   }
 
   getEvents(): readonly SessionEvent[] {
-    return [...this.events];
+    return [];
   }
 
killedBy: AH-SESSION-001: durable session events creates a run_created event on construction
statusReason: Cannot read properties of undefined (reading 'type')

[Killed] BlockStatement
session/durable-session.ts:188:52
     return [...this.events];
   }
 
-  getEventsByType(type: EventType): SessionEvent[] {
-    return this.events.filter((e) => e.type === type);
-  }
+  getEventsByType(type: EventType): SessionEvent[] {}
 
   getEventsByRun(runId: string): SessionEvent[] {
killedBy: precision: RuntimeLoop exact session events denied tool produces action_denied event with exact reason
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
session/durable-session.ts:189:38
   }
 
   getEventsByType(type: EventType): SessionEvent[] {
-    return this.events.filter((e) => e.type === type);
+    return this.events.filter((e) => true);
   }
 
killedBy: precision: RuntimeLoop exact session events denied tool produces action_denied event with exact reason
statusReason: expected undefined to be 'policy_denied' // Object.is equality

[Killed] ArrowFunction
session/durable-session.ts:189:31
   }
 
   getEventsByType(type: EventType): SessionEvent[] {
-    return this.events.filter((e) => e.type === type);
+    return this.events.filter(() => undefined);
   }
 
killedBy: precision: RuntimeLoop exact session events denied tool produces action_denied event with exact reason
statusReason: expected 0 to be greater than or equal to 1

[Killed] BlockStatement
session/durable-session.ts:192:49
     return this.events.filter((e) => e.type === type);
   }
 
-  getEventsByRun(runId: string): SessionEvent[] {
-    return this.events.filter((e) => e.run_id === runId);
-  }
+  getEventsByRun(runId: string): SessionEvent[] {}
 
   get lastSeq(): number {
killedBy: coverage: DurableSession methods getEventsByRun filters by run_id
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] MethodExpression
session/durable-session.ts:193:12
   }
 
   getEventsByRun(runId: string): SessionEvent[] {
-    return this.events.filter((e) => e.run_id === runId);
+    return this.events;
   }
 
killedBy: coverage: DurableSession methods getEventsByRun filters by run_id
statusReason: expected 2 to be +0 // Object.is equality

[Killed] EqualityOperator
session/durable-session.ts:193:38
   }
 
   getEventsByRun(runId: string): SessionEvent[] {
-    return this.events.filter((e) => e.run_id === runId);
+    return this.events.filter((e) => e.run_id !== runId);
   }
 
killedBy: coverage: DurableSession methods getEventsByRun filters by run_id
statusReason: expected +0 to be 2 // Object.is equality

[Killed] BlockStatement
session/durable-session.ts:196:25
     return this.events.filter((e) => e.run_id === runId);
   }
 
-  get lastSeq(): number {
-    return this.seqCounter;
-  }
+  get lastSeq(): number {}
 
   get eventCount(): number {
killedBy: AH-SESSION-001: durable session events appends events with sequential sequence numbers
statusReason: expected undefined to be 3 // Object.is equality

[Killed] BlockStatement
session/durable-session.ts:200:28
     return this.seqCounter;
   }
 
-  get eventCount(): number {
-    return this.events.length;
-  }
+  get eventCount(): number {}
 
   get snapshotCount(): number {
killedBy: AH-SESSION-001: durable session events creates a run_created event on construction
statusReason: expected undefined to be 1 // Object.is equality

[Killed] BlockStatement
session/durable-session.ts:204:31
     return this.events.length;
   }
 
-  get snapshotCount(): number {
-    return this.snapshots.length;
-  }
+  get snapshotCount(): number {}
 
   getState(key: string): unknown {
killedBy: coverage: DurableSession methods snapshotCount and getSnapshot
statusReason: expected undefined to be +0 // Object.is equality

[Killed] BlockStatement
session/durable-session.ts:208:34
     return this.snapshots.length;
   }
 
-  getState(key: string): unknown {
-    return this.state.get(key);
-  }
+  getState(key: string): unknown {}
 
   setState(key: string, value: unknown): void {
killedBy: AH-SESSION-001: durable session events updates state from events
statusReason: expected undefined to be 'running' // Object.is equality

[Killed] BlockStatement
session/durable-session.ts:212:47
     return this.state.get(key);
   }
 
-  setState(key: string, value: unknown): void {
-    this.state.set(key, value);
-  }
+  setState(key: string, value: unknown): void {}
 
   verifyIntegrity(): { valid: boolean; broken_chain_at: number | null } {
killedBy: coverage: DurableSession methods setState and getState
statusReason: expected undefined to be 'value' // Object.is equality

[Killed] BlockStatement
session/durable-session.ts:216:73
     this.state.set(key, value);
   }
 
-  verifyIntegrity(): { valid: boolean; broken_chain_at: number | null } {
-    for (let i = 1; i < this.events.length; i++) {
-      if (this.events[i].prev_hash !== this.events[i - 1].event_hash) {
-        return { valid: false, broken_chain_at: this.events[i].seq };
-      }
-    }
-    return { valid: true, broken_chain_at: null };
-  }
+  verifyIntegrity(): { valid: boolean; broken_chain_at: number | null } {}
 
   // ---------------------------------------------------------------------------
killedBy: coverage: DurableSession methods verifyIntegrity returns valid
statusReason: Cannot read properties of undefined (reading 'valid')

[Killed] EqualityOperator
session/durable-session.ts:217:21
   }
 
   verifyIntegrity(): { valid: boolean; broken_chain_at: number | null } {
-    for (let i = 1; i < this.events.length; i++) {
+    for (let i = 1; i <= this.events.length; i++) {
       if (this.events[i].prev_hash !== this.events[i - 1].event_hash) {
         return { valid: false, broken_chain_at: this.events[i].seq };
killedBy: coverage: DurableSession methods verifyIntegrity returns valid
statusReason: Cannot read properties of undefined (reading 'prev_hash')

[Killed] UpdateOperator
session/durable-session.ts:217:45
   }
 
   verifyIntegrity(): { valid: boolean; broken_chain_at: number | null } {
-    for (let i = 1; i < this.events.length; i++) {
+    for (let i = 1; i < this.events.length; i--) {
       if (this.events[i].prev_hash !== this.events[i - 1].event_hash) {
         return { valid: false, broken_chain_at: this.events[i].seq };
killedBy: coverage: DurableSession methods verifyIntegrity returns valid
statusReason: Cannot read properties of undefined (reading 'event_hash')

[Killed] ConditionalExpression
session/durable-session.ts:218:11
 
   verifyIntegrity(): { valid: boolean; broken_chain_at: number | null } {
     for (let i = 1; i < this.events.length; i++) {
-      if (this.events[i].prev_hash !== this.events[i - 1].event_hash) {
+      if (true) {
         return { valid: false, broken_chain_at: this.events[i].seq };
       }
killedBy: AH-SESSION-001: durable session events verifyIntegrity returns valid for untampered chain
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
session/durable-session.ts:218:11
 
   verifyIntegrity(): { valid: boolean; broken_chain_at: number | null } {
     for (let i = 1; i < this.events.length; i++) {
-      if (this.events[i].prev_hash !== this.events[i - 1].event_hash) {
+      if (this.events[i].prev_hash === this.events[i - 1].event_hash) {
         return { valid: false, broken_chain_at: this.events[i].seq };
       }
killedBy: AH-SESSION-001: durable session events verifyIntegrity returns valid for untampered chain
statusReason: expected false to be true // Object.is equality

[NoCoverage] BooleanLiteral
session/durable-session.ts:219:25
   verifyIntegrity(): { valid: boolean; broken_chain_at: number | null } {
     for (let i = 1; i < this.events.length; i++) {
       if (this.events[i].prev_hash !== this.events[i - 1].event_hash) {
-        return { valid: false, broken_chain_at: this.events[i].seq };
+        return { valid: true, broken_chain_at: this.events[i].seq };
       }
     }

[Killed] BooleanLiteral
session/durable-session.ts:222:21
         return { valid: false, broken_chain_at: this.events[i].seq };
       }
     }
-    return { valid: true, broken_chain_at: null };
+    return { valid: false, broken_chain_at: null };
   }
 
killedBy: AH-SESSION-001: durable session events verifyIntegrity returns valid for untampered chain
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
session/durable-session.ts:231:7
 
   private applyEvent(event: SessionEvent): void {
     switch (event.type) {
-      case 'run_created':
-        this.state.set('run_id', event.run_id);
-        this.state.set('status', 'created');
-        break;
+      case 'run_created':
       case 'run_started':
         this.state.set('status', 'running');
killedBy: precision: RuntimeLoop additional branches run_id from options is used
statusReason: expected undefined to be 'custom-run-001' // Object.is equality

[Killed] StringLiteral
session/durable-session.ts:232:24
   private applyEvent(event: SessionEvent): void {
     switch (event.type) {
       case 'run_created':
-        this.state.set('run_id', event.run_id);
+        this.state.set("", event.run_id);
         this.state.set('status', 'created');
         break;
killedBy: precision: RuntimeLoop additional branches run_id from options is used
statusReason: expected undefined to be 'custom-run-001' // Object.is equality

[Killed] StringLiteral
session/durable-session.ts:233:34
     switch (event.type) {
       case 'run_created':
         this.state.set('run_id', event.run_id);
-        this.state.set('status', 'created');
+        this.state.set('status', "");
         break;
       case 'run_started':
killedBy: mutation-kill: session all event types snapshot_created does not modify state
statusReason: expected '' to be 'created' // Object.is equality

[Killed] ConditionalExpression
session/durable-session.ts:235:7
         this.state.set('run_id', event.run_id);
         this.state.set('status', 'created');
         break;
-      case 'run_started':
-        this.state.set('status', 'running');
-        break;
+      case 'run_started':
       case 'run_completed':
         this.state.set('status', 'completed');
killedBy: AH-SESSION-001: durable session events updates state from events
statusReason: expected 'completed' to be 'running' // Object.is equality

[Killed] StringLiteral
session/durable-session.ts:235:12
         this.state.set('run_id', event.run_id);
         this.state.set('status', 'created');
         break;
-      case 'run_started':
+      case "":
         this.state.set('status', 'running');
         break;
killedBy: AH-UI-001: eight UI state adapters settings adapter redacts secrets
statusReason: expected 'loading' to be 'ready' // Object.is equality

[Killed] StringLiteral
session/durable-session.ts:236:24
         this.state.set('status', 'created');
         break;
       case 'run_started':
-        this.state.set('status', 'running');
+        this.state.set("", 'running');
         break;
       case 'run_completed':
killedBy: AH-SESSION-001: durable session events updates state from events
statusReason: expected 'created' to be 'running' // Object.is equality

[Killed] ConditionalExpression
session/durable-session.ts:238:7
       case 'run_started':
         this.state.set('status', 'running');
         break;
-      case 'run_completed':
-        this.state.set('status', 'completed');
-        break;
+      case 'run_completed':
       case 'run_failed':
         this.state.set('status', 'failed');
killedBy: AH-SESSION-001: durable session events updates state from events
statusReason: expected 'failed' to be 'completed' // Object.is equality

[Killed] ConditionalExpression
session/durable-session.ts:241:7
       case 'run_completed':
         this.state.set('status', 'completed');
         break;
-      case 'run_failed':
-        this.state.set('status', 'failed');
-        break;
+      case 'run_failed':
       case 'run_cancelled':
         this.state.set('status', 'cancelled');
killedBy: AH-UI-001: eight UI state adapters approval adapter shows error for failed run
statusReason: expected 'cancelled' to be 'error' // Object.is equality

[Killed] StringLiteral
session/durable-session.ts:241:12
       case 'run_completed':
         this.state.set('status', 'completed');
         break;
-      case 'run_failed':
+      case "":
         this.state.set('status', 'failed');
         break;
killedBy: coverage: UI adapters all states onboarding: error state for failed session
statusReason: expected 'loading' to be 'error' // Object.is equality
