[Killed] ConditionalExpression
session/durable-session.ts:244:7
       case 'run_failed':
         this.state.set('status', 'failed');
         break;
-      case 'run_cancelled':
-        this.state.set('status', 'cancelled');
-        break;
+      case 'run_cancelled':
       case 'step_created':
         this.state.set(`step:${event.step_id}:status`, 'created');
killedBy: AH-UI-001: eight UI state adapters task adapter handles cancelled state
statusReason: expected 'loading' to be 'cancelled' // Object.is equality

[Killed] ConditionalExpression
session/durable-session.ts:247:7
       case 'run_cancelled':
         this.state.set('status', 'cancelled');
         break;
-      case 'step_created':
-        this.state.set(`step:${event.step_id}:status`, 'created');
-        break;
+      case 'step_created':
       case 'step_started':
         this.state.set(`step:${event.step_id}:status`, 'running');
killedBy: mutation-kill: session all event types step_created sets step status
statusReason: expected 'running' to be 'created' // Object.is equality

[Killed] StringLiteral
session/durable-session.ts:247:12
       case 'run_cancelled':
         this.state.set('status', 'cancelled');
         break;
-      case 'step_created':
+      case "":
         this.state.set(`step:${event.step_id}:status`, 'created');
         break;
killedBy: mutation-kill: session all event types step_created sets step status
statusReason: expected undefined to be 'created' // Object.is equality

[Killed] ConditionalExpression
session/durable-session.ts:250:7
       case 'step_created':
         this.state.set(`step:${event.step_id}:status`, 'created');
         break;
-      case 'step_started':
-        this.state.set(`step:${event.step_id}:status`, 'running');
-        break;
+      case 'step_started':
       case 'step_completed':
         this.state.set(`step:${event.step_id}:status`, 'completed');
killedBy: mutation-kill: session all event types step_started sets running
statusReason: expected 'completed' to be 'running' // Object.is equality

[Killed] ConditionalExpression
session/durable-session.ts:253:7
       case 'step_started':
         this.state.set(`step:${event.step_id}:status`, 'running');
         break;
-      case 'step_completed':
-        this.state.set(`step:${event.step_id}:status`, 'completed');
-        break;
+      case 'step_completed':
       case 'step_failed':
         this.state.set(`step:${event.step_id}:status`, 'failed');
killedBy: mutation-kill: session all event types step_completed sets completed
statusReason: expected 'failed' to be 'completed' // Object.is equality

[Killed] ConditionalExpression
session/durable-session.ts:256:7
       case 'step_completed':
         this.state.set(`step:${event.step_id}:status`, 'completed');
         break;
-      case 'step_failed':
-        this.state.set(`step:${event.step_id}:status`, 'failed');
-        break;
+      case 'step_failed':
       case 'action_executed': {
         // Track executed actions for replay detection
killedBy: mutation-kill: session all event types step_failed sets failed
statusReason: expected 'created' to be 'failed' // Object.is equality

[Killed] StringLiteral
session/durable-session.ts:256:12
       case 'step_completed':
         this.state.set(`step:${event.step_id}:status`, 'completed');
         break;
-      case 'step_failed':
+      case "":
         this.state.set(`step:${event.step_id}:status`, 'failed');
         break;
killedBy: mutation-kill: session all event types step_failed sets failed
statusReason: expected 'created' to be 'failed' // Object.is equality

[Killed] StringLiteral
session/durable-session.ts:257:24
         this.state.set(`step:${event.step_id}:status`, 'completed');
         break;
       case 'step_failed':
-        this.state.set(`step:${event.step_id}:status`, 'failed');
+        this.state.set(``, 'failed');
         break;
       case 'action_executed': {
killedBy: mutation-kill: session all event types step_failed sets failed
statusReason: expected 'created' to be 'failed' // Object.is equality

[Killed] ConditionalExpression
session/durable-session.ts:259:7
       case 'step_failed':
         this.state.set(`step:${event.step_id}:status`, 'failed');
         break;
-      case 'action_executed': {
-        // Track executed actions for replay detection
-        const executed = (this.state.get('executed_actions') as string[]) ?? [];
-        executed.push(event.data.tool_name as string);
-        this.state.set('executed_actions', executed);
-        break;
-      }
+      case 'action_executed':
       default:
         // Other event types don't modify state directly
killedBy: mutation-kill: session all event types action_executed tracks executed actions
statusReason: expected undefined to deeply equal [ 'read_file', 'write_file' ]

[Killed] BlockStatement
session/durable-session.ts:259:31
       case 'step_failed':
         this.state.set(`step:${event.step_id}:status`, 'failed');
         break;
-      case 'action_executed': {
-        // Track executed actions for replay detection
-        const executed = (this.state.get('executed_actions') as string[]) ?? [];
-        executed.push(event.data.tool_name as string);
-        this.state.set('executed_actions', executed);
-        break;
-      }
+      case 'action_executed': {}
       default:
         // Other event types don't modify state directly
killedBy: mutation-kill: session all event types action_executed tracks executed actions
statusReason: expected undefined to deeply equal [ 'read_file', 'write_file' ]

[Killed] LogicalOperator
session/durable-session.ts:261:26
         break;
       case 'action_executed': {
         // Track executed actions for replay detection
-        const executed = (this.state.get('executed_actions') as string[]) ?? [];
+        const executed = this.state.get('executed_actions') as string[] && [];
         executed.push(event.data.tool_name as string);
         this.state.set('executed_actions', executed);
killedBy: mutation-kill: notifications all event types action_executed -> info tool
statusReason: Cannot read properties of undefined (reading 'push')

[Survived] ConditionalExpression
session/durable-session.ts:266:7
         this.state.set('executed_actions', executed);
         break;
       }
-      default:
-        // Other event types don't modify state directly
-        break;
+      default:
     }
   }

[Survived] BlockStatement
session/durable-session.ts:272:50
     }
   }
 
-  private hashEvent(event: SessionEvent): string {
-    const payload = JSON.stringify({
-      seq: event.seq,
-      type: event.type,
-      run_id: event.run_id,
-      step_id: event.step_id ?? null,
-      attempt_id: event.attempt_id ?? null,
-      data: event.data,
-      prev_hash: event.prev_hash,
-    });
-    return createHash('sha256').update(payload).digest('hex');
-  }
+  private hashEvent(event: SessionEvent): string {}
 
   private hashSnapshot(snap: SessionSnapshot): string {

[Survived] LogicalOperator
session/durable-session.ts:277:16
       seq: event.seq,
       type: event.type,
       run_id: event.run_id,
-      step_id: event.step_id ?? null,
+      step_id: event.step_id && null,
       attempt_id: event.attempt_id ?? null,
       data: event.data,

[Survived] LogicalOperator
session/durable-session.ts:278:19
       type: event.type,
       run_id: event.run_id,
       step_id: event.step_id ?? null,
-      attempt_id: event.attempt_id ?? null,
+      attempt_id: event.attempt_id && null,
       data: event.data,
       prev_hash: event.prev_hash,

[Killed] StringLiteral
session/durable-session.ts:282:23
       data: event.data,
       prev_hash: event.prev_hash,
     });
-    return createHash('sha256').update(payload).digest('hex');
+    return createHash("").update(payload).digest('hex');
   }
 
killedBy: precision: RuntimeLoop exact session events direct run produces exact event sequence
statusReason: Digest method not supported

[Killed] BlockStatement
session/durable-session.ts:285:55
     return createHash('sha256').update(payload).digest('hex');
   }
 
-  private hashSnapshot(snap: SessionSnapshot): string {
-    const payload = JSON.stringify({
-      version: snap.version,
-      run_id: snap.run_id,
-      last_seq: snap.last_seq,
-      state: snap.state,
-    });
-    return createHash('sha256').update(payload).digest('hex');
-  }
+  private hashSnapshot(snap: SessionSnapshot): string {}
 }
 
killedBy: AH-SESSION-001: snapshots creates a versioned snapshot
statusReason: expected undefined to be truthy

[Survived] StringLiteral
session/durable-session.ts:292:56
       last_seq: snap.last_seq,
       state: snap.state,
     });
-    return createHash('sha256').update(payload).digest('hex');
+    return createHash('sha256').update(payload).digest("");
   }
 }
