[Killed] BlockStatement
tools/ask-user.ts:17:61
 
 export type AskUserHandler = (question: string, options?: string[]) => Promise<string | null>;
 
-export function createAskUserTool(handler?: AskUserHandler) {
-  return {
-    name: 'ask_user',
-    async execute(input: AskUserInput, signal?: AbortSignal): Promise<AskUserResult> {
-      if (signal?.aborted) {
-        return { question: input.question, answer: null, cancelled: true, timed_out: false };
-      }
-      if (!handler) {
-        return { question: input.question, answer: null, cancelled: false, timed_out: true };
-      }
-      try {
-        const answer = await handler(input.question, input.options);
-        return { question: input.question, answer, cancelled: false, timed_out: false };
-      } catch {
-        return { question: input.question, answer: null, cancelled: false, timed_out: true };
-      }
-    },
-  };
-}
+export function createAskUserTool(handler?: AskUserHandler) {}
 
killedBy: AH-TOOLS-001: all nine tools through VFS/Sandbox ask_user creates cancellable prompt
statusReason: Cannot read properties of undefined (reading 'execute')

[Survived] StringLiteral
tools/ask-user.ts:19:11
 
 export function createAskUserTool(handler?: AskUserHandler) {
   return {
-    name: 'ask_user',
+    name: "",
     async execute(input: AskUserInput, signal?: AbortSignal): Promise<AskUserResult> {
       if (signal?.aborted) {

[Killed] BlockStatement
tools/ask-user.ts:20:86
 export function createAskUserTool(handler?: AskUserHandler) {
   return {
     name: 'ask_user',
-    async execute(input: AskUserInput, signal?: AbortSignal): Promise<AskUserResult> {
-      if (signal?.aborted) {
-        return { question: input.question, answer: null, cancelled: true, timed_out: false };
-      }
-      if (!handler) {
-        return { question: input.question, answer: null, cancelled: false, timed_out: true };
-      }
-      try {
-        const answer = await handler(input.question, input.options);
-        return { question: input.question, answer, cancelled: false, timed_out: false };
-      } catch {
-        return { question: input.question, answer: null, cancelled: false, timed_out: true };
-      }
-    },
+    async execute(input: AskUserInput, signal?: AbortSignal): Promise<AskUserResult> {},
   };
 }
killedBy: AH-TOOLS-001: all nine tools through VFS/Sandbox ask_user creates cancellable prompt
statusReason: Cannot read properties of undefined (reading 'answer')

[Killed] ConditionalExpression
tools/ask-user.ts:21:11
   return {
     name: 'ask_user',
     async execute(input: AskUserInput, signal?: AbortSignal): Promise<AskUserResult> {
-      if (signal?.aborted) {
+      if (true) {
         return { question: input.question, answer: null, cancelled: true, timed_out: false };
       }
killedBy: AH-TOOLS-001: all nine tools through VFS/Sandbox ask_user creates cancellable prompt
statusReason: expected null to be 'user answer' // Object.is equality

[Killed] OptionalChaining
tools/ask-user.ts:21:11
   return {
     name: 'ask_user',
     async execute(input: AskUserInput, signal?: AbortSignal): Promise<AskUserResult> {
-      if (signal?.aborted) {
+      if (signal.aborted) {
         return { question: input.question, answer: null, cancelled: true, timed_out: false };
       }
killedBy: AH-TOOLS-001: all nine tools through VFS/Sandbox ask_user creates cancellable prompt
statusReason: Cannot read properties of undefined (reading 'aborted')

[Killed] BooleanLiteral
tools/ask-user.ts:22:69
     name: 'ask_user',
     async execute(input: AskUserInput, signal?: AbortSignal): Promise<AskUserResult> {
       if (signal?.aborted) {
-        return { question: input.question, answer: null, cancelled: true, timed_out: false };
+        return { question: input.question, answer: null, cancelled: false, timed_out: false };
       }
       if (!handler) {
killedBy: coverage: tools edge cases askUser with cancellation
statusReason: expected false to be true // Object.is equality

[Survived] BooleanLiteral
tools/ask-user.ts:22:86
     name: 'ask_user',
     async execute(input: AskUserInput, signal?: AbortSignal): Promise<AskUserResult> {
       if (signal?.aborted) {
-        return { question: input.question, answer: null, cancelled: true, timed_out: false };
+        return { question: input.question, answer: null, cancelled: true, timed_out: true };
       }
       if (!handler) {

[Killed] BooleanLiteral
tools/ask-user.ts:24:11
       if (signal?.aborted) {
         return { question: input.question, answer: null, cancelled: true, timed_out: false };
       }
-      if (!handler) {
+      if (handler) {
         return { question: input.question, answer: null, cancelled: false, timed_out: true };
       }
killedBy: AH-TOOLS-001: all nine tools through VFS/Sandbox ask_user creates cancellable prompt
statusReason: expected null to be 'user answer' // Object.is equality

[Killed] ConditionalExpression
tools/ask-user.ts:24:11
       if (signal?.aborted) {
         return { question: input.question, answer: null, cancelled: true, timed_out: false };
       }
-      if (!handler) {
+      if (true) {
         return { question: input.question, answer: null, cancelled: false, timed_out: true };
       }
killedBy: AH-TOOLS-001: all nine tools through VFS/Sandbox ask_user creates cancellable prompt
statusReason: expected null to be 'user answer' // Object.is equality

[Killed] BooleanLiteral
tools/ask-user.ts:25:87
         return { question: input.question, answer: null, cancelled: true, timed_out: false };
       }
       if (!handler) {
-        return { question: input.question, answer: null, cancelled: false, timed_out: true };
+        return { question: input.question, answer: null, cancelled: false, timed_out: false };
       }
       try {
killedBy: AH-TOOLS-001: all nine tools through VFS/Sandbox ask_user times out without handler
statusReason: expected false to be true // Object.is equality

[Survived] BooleanLiteral
tools/ask-user.ts:25:69
         return { question: input.question, answer: null, cancelled: true, timed_out: false };
       }
       if (!handler) {
-        return { question: input.question, answer: null, cancelled: false, timed_out: true };
+        return { question: input.question, answer: null, cancelled: true, timed_out: true };
       }
       try {

[Killed] BlockStatement
tools/ask-user.ts:27:11
       if (!handler) {
         return { question: input.question, answer: null, cancelled: false, timed_out: true };
       }
-      try {
-        const answer = await handler(input.question, input.options);
-        return { question: input.question, answer, cancelled: false, timed_out: false };
-      } catch {
+      try {} catch {
         return { question: input.question, answer: null, cancelled: false, timed_out: true };
       }
killedBy: AH-TOOLS-001: all nine tools through VFS/Sandbox ask_user creates cancellable prompt
statusReason: Cannot read properties of undefined (reading 'answer')

[Killed] BooleanLiteral
tools/ask-user.ts:29:63
       }
       try {
         const answer = await handler(input.question, input.options);
-        return { question: input.question, answer, cancelled: false, timed_out: false };
+        return { question: input.question, answer, cancelled: true, timed_out: false };
       } catch {
         return { question: input.question, answer: null, cancelled: false, timed_out: true };
killedBy: AH-TOOLS-001: all nine tools through VFS/Sandbox ask_user creates cancellable prompt
statusReason: expected true to be false // Object.is equality

[Survived] BooleanLiteral
tools/ask-user.ts:29:81
       }
       try {
         const answer = await handler(input.question, input.options);
-        return { question: input.question, answer, cancelled: false, timed_out: false };
+        return { question: input.question, answer, cancelled: false, timed_out: true };
       } catch {
         return { question: input.question, answer: null, cancelled: false, timed_out: true };

[NoCoverage] BlockStatement
tools/ask-user.ts:30:15
       try {
         const answer = await handler(input.question, input.options);
         return { question: input.question, answer, cancelled: false, timed_out: false };
-      } catch {
-        return { question: input.question, answer: null, cancelled: false, timed_out: true };
-      }
+      } catch {}
     },
   };

[NoCoverage] BooleanLiteral
tools/ask-user.ts:31:69
         const answer = await handler(input.question, input.options);
         return { question: input.question, answer, cancelled: false, timed_out: false };
       } catch {
-        return { question: input.question, answer: null, cancelled: false, timed_out: true };
+        return { question: input.question, answer: null, cancelled: true, timed_out: true };
       }
     },

[NoCoverage] BooleanLiteral
tools/ask-user.ts:31:87
         const answer = await handler(input.question, input.options);
         return { question: input.question, answer, cancelled: false, timed_out: false };
       } catch {
-        return { question: input.question, answer: null, cancelled: false, timed_out: true };
+        return { question: input.question, answer: null, cancelled: false, timed_out: false };
       }
     },
