[Killed] BlockStatement
verification/eval-runner.ts:39:40
 export class EvalRunner {
   private readonly fixtures: EvalFixture[] = [];
 
-  register(fixture: EvalFixture): void {
-    this.fixtures.push(fixture);
-  }
+  register(fixture: EvalFixture): void {}
 
   async runAll(): Promise<EvalSummary> {
killedBy: AH-EVAL-001: eval runner registers and runs fixtures
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
verification/eval-runner.ts:43:40
     this.fixtures.push(fixture);
   }
 
-  async runAll(): Promise<EvalSummary> {
-    const results: EvalSummary['results'] = [];
-    let passed = 0;
-
-    for (const fixture of this.fixtures) {
-      try {
-        const result = await fixture.run();
-        if (result.passed) {
-          passed++;
-          results.push({ id: fixture.id, name: fixture.name, passed: true });
-        } else {
-          results.push({ id: fixture.id, name: fixture.name, passed: false, error: result.error ?? 'assertion failed' });
-        }
-      } catch (err) {
-        results.push({ id: fixture.id, name: fixture.name, passed: false, error: err instanceof Error ? err.message : String(err) });
-      }
-    }
-
-    const digest = createHash('sha256').update(JSON.stringify(results)).digest('hex');
-    return { total: this.fixtures.length, passed, failed: this.fixtures.length - passed, results, digest };
-  }
+  async runAll(): Promise<EvalSummary> {}
 
   count(): number {
killedBy: AH-EVAL-001: eval runner registers and runs fixtures
statusReason: Cannot read properties of undefined (reading 'total')

[Killed] BlockStatement
verification/eval-runner.ts:47:42
     const results: EvalSummary['results'] = [];
     let passed = 0;
 
-    for (const fixture of this.fixtures) {
-      try {
-        const result = await fixture.run();
-        if (result.passed) {
-          passed++;
-          results.push({ id: fixture.id, name: fixture.name, passed: true });
-        } else {
-          results.push({ id: fixture.id, name: fixture.name, passed: false, error: result.error ?? 'assertion failed' });
-        }
-      } catch (err) {
-        results.push({ id: fixture.id, name: fixture.name, passed: false, error: err instanceof Error ? err.message : String(err) });
-      }
-    }
+    for (const fixture of this.fixtures) {}
 
     const digest = createHash('sha256').update(JSON.stringify(results)).digest('hex');
killedBy: AH-EVAL-001: eval runner registers and runs fixtures
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
verification/eval-runner.ts:48:11
     let passed = 0;
 
     for (const fixture of this.fixtures) {
-      try {
-        const result = await fixture.run();
-        if (result.passed) {
-          passed++;
-          results.push({ id: fixture.id, name: fixture.name, passed: true });
-        } else {
-          results.push({ id: fixture.id, name: fixture.name, passed: false, error: result.error ?? 'assertion failed' });
-        }
-      } catch (err) {
+      try {} catch (err) {
         results.push({ id: fixture.id, name: fixture.name, passed: false, error: err instanceof Error ? err.message : String(err) });
       }
killedBy: AH-EVAL-001: eval runner registers and runs fixtures
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
verification/eval-runner.ts:50:13
     for (const fixture of this.fixtures) {
       try {
         const result = await fixture.run();
-        if (result.passed) {
+        if (true) {
           passed++;
           results.push({ id: fixture.id, name: fixture.name, passed: true });
killedBy: mutation-kill: evidence and eval eval runner counts failures
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
verification/eval-runner.ts:50:13
     for (const fixture of this.fixtures) {
       try {
         const result = await fixture.run();
-        if (result.passed) {
+        if (false) {
           passed++;
           results.push({ id: fixture.id, name: fixture.name, passed: true });
killedBy: AH-EVAL-001: eval runner registers and runs fixtures
statusReason: expected +0 to be 1 // Object.is equality

[Killed] UpdateOperator
verification/eval-runner.ts:51:11
       try {
         const result = await fixture.run();
         if (result.passed) {
-          passed++;
+          passed--;
           results.push({ id: fixture.id, name: fixture.name, passed: true });
         } else {
killedBy: AH-EVAL-001: eval runner registers and runs fixtures
statusReason: expected -1 to be 1 // Object.is equality

[Survived] BooleanLiteral
verification/eval-runner.ts:52:70
         const result = await fixture.run();
         if (result.passed) {
           passed++;
-          results.push({ id: fixture.id, name: fixture.name, passed: true });
+          results.push({ id: fixture.id, name: fixture.name, passed: false });
         } else {
           results.push({ id: fixture.id, name: fixture.name, passed: false, error: result.error ?? 'assertion failed' });

[Survived] BlockStatement
verification/eval-runner.ts:53:16
         if (result.passed) {
           passed++;
           results.push({ id: fixture.id, name: fixture.name, passed: true });
-        } else {
-          results.push({ id: fixture.id, name: fixture.name, passed: false, error: result.error ?? 'assertion failed' });
-        }
+        } else {}
       } catch (err) {
         results.push({ id: fixture.id, name: fixture.name, passed: false, error: err instanceof Error ? err.message : String(err) });

[Survived] LogicalOperator
verification/eval-runner.ts:54:84
           passed++;
           results.push({ id: fixture.id, name: fixture.name, passed: true });
         } else {
-          results.push({ id: fixture.id, name: fixture.name, passed: false, error: result.error ?? 'assertion failed' });
+          results.push({ id: fixture.id, name: fixture.name, passed: false, error: result.error && 'assertion failed' });
         }
       } catch (err) {

[Survived] BooleanLiteral
verification/eval-runner.ts:54:70
           passed++;
           results.push({ id: fixture.id, name: fixture.name, passed: true });
         } else {
-          results.push({ id: fixture.id, name: fixture.name, passed: false, error: result.error ?? 'assertion failed' });
+          results.push({ id: fixture.id, name: fixture.name, passed: true, error: result.error ?? 'assertion failed' });
         }
       } catch (err) {

[Killed] BlockStatement
verification/eval-runner.ts:56:21
         } else {
           results.push({ id: fixture.id, name: fixture.name, passed: false, error: result.error ?? 'assertion failed' });
         }
-      } catch (err) {
-        results.push({ id: fixture.id, name: fixture.name, passed: false, error: err instanceof Error ? err.message : String(err) });
-      }
+      } catch (err) {}
     }
 
killedBy: AH-EVAL-001: eval runner handles fixture errors
statusReason: Cannot read properties of undefined (reading 'error')

[Survived] BooleanLiteral
verification/eval-runner.ts:57:68
           results.push({ id: fixture.id, name: fixture.name, passed: false, error: result.error ?? 'assertion failed' });
         }
       } catch (err) {
-        results.push({ id: fixture.id, name: fixture.name, passed: false, error: err instanceof Error ? err.message : String(err) });
+        results.push({ id: fixture.id, name: fixture.name, passed: true, error: err instanceof Error ? err.message : String(err) });
       }
     }

[Killed] ObjectLiteral
verification/eval-runner.ts:57:22
           results.push({ id: fixture.id, name: fixture.name, passed: false, error: result.error ?? 'assertion failed' });
         }
       } catch (err) {
-        results.push({ id: fixture.id, name: fixture.name, passed: false, error: err instanceof Error ? err.message : String(err) });
+        results.push({});
       }
     }
killedBy: AH-EVAL-001: eval runner handles fixture errors
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] ArithmeticOperator
verification/eval-runner.ts:62:59
     }
 
     const digest = createHash('sha256').update(JSON.stringify(results)).digest('hex');
-    return { total: this.fixtures.length, passed, failed: this.fixtures.length - passed, results, digest };
+    return { total: this.fixtures.length, passed, failed: this.fixtures.length + passed, results, digest };
   }
 
killedBy: AH-EVAL-001: eval runner counts failures correctly
statusReason: expected 3 to be 1 // Object.is equality

[NoCoverage] BlockStatement
verification/eval-runner.ts:65:19
     return { total: this.fixtures.length, passed, failed: this.fixtures.length - passed, results, digest };
   }
 
-  count(): number {
-    return this.fixtures.length;
-  }
+  count(): number {}
 }
 
