[Killed] BlockStatement
verification/evidence.ts:25:151
   record_hash: string;
 }
 
-export function createEvidence(data: Omit<EvidenceRecord, 'id' | 'timestamp' | 'prev_hash' | 'record_hash'> & { prev_hash?: string }): EvidenceRecord {
-  const timestamp = new Date().toISOString();
-  const prevHash = data.prev_hash ?? '';
-  const id = createHash('sha256').update(`${data.run_id}:${timestamp}`).digest('hex').slice(0, 16);
-  const record: EvidenceRecord = { ...data, id, timestamp, prev_hash: prevHash, record_hash: '' };
-  record.record_hash = hashRecord(record);
-  return record;
-}
+export function createEvidence(data: Omit<EvidenceRecord, 'id' | 'timestamp' | 'prev_hash' | 'record_hash'> & { prev_hash?: string }): EvidenceRecord {}
 
 export function hashRecord(record: EvidenceRecord): string {
killedBy: AH-VERTICAL-002: verticals through real RuntimeLoop coding: routes to plan_execute and executes tool calls through loop
statusReason: Cannot read properties of undefined (reading 'record_hash')

[Killed] LogicalOperator
verification/evidence.ts:27:20
 
 export function createEvidence(data: Omit<EvidenceRecord, 'id' | 'timestamp' | 'prev_hash' | 'record_hash'> & { prev_hash?: string }): EvidenceRecord {
   const timestamp = new Date().toISOString();
-  const prevHash = data.prev_hash ?? '';
+  const prevHash = data.prev_hash && '';
   const id = createHash('sha256').update(`${data.run_id}:${timestamp}`).digest('hex').slice(0, 16);
   const record: EvidenceRecord = { ...data, id, timestamp, prev_hash: prevHash, record_hash: '' };
killedBy: AH-EVIDENCE-001: evidence generation verifyChain detects broken chain
statusReason: expected false to be true // Object.is equality

[Survived] StringLiteral
verification/evidence.ts:27:38
 
 export function createEvidence(data: Omit<EvidenceRecord, 'id' | 'timestamp' | 'prev_hash' | 'record_hash'> & { prev_hash?: string }): EvidenceRecord {
   const timestamp = new Date().toISOString();
-  const prevHash = data.prev_hash ?? '';
+  const prevHash = data.prev_hash ?? "Stryker was here!";
   const id = createHash('sha256').update(`${data.run_id}:${timestamp}`).digest('hex').slice(0, 16);
   const record: EvidenceRecord = { ...data, id, timestamp, prev_hash: prevHash, record_hash: '' };

[Survived] MethodExpression
verification/evidence.ts:28:14
 export function createEvidence(data: Omit<EvidenceRecord, 'id' | 'timestamp' | 'prev_hash' | 'record_hash'> & { prev_hash?: string }): EvidenceRecord {
   const timestamp = new Date().toISOString();
   const prevHash = data.prev_hash ?? '';
-  const id = createHash('sha256').update(`${data.run_id}:${timestamp}`).digest('hex').slice(0, 16);
+  const id = createHash('sha256').update(`${data.run_id}:${timestamp}`).digest('hex');
   const record: EvidenceRecord = { ...data, id, timestamp, prev_hash: prevHash, record_hash: '' };
   record.record_hash = hashRecord(record);

[Killed] BlockStatement
verification/evidence.ts:34:60
   return record;
 }
 
-export function hashRecord(record: EvidenceRecord): string {
-  const payload = JSON.stringify({
-    id: record.id, run_id: record.run_id, strategy: record.strategy,
-    result_digest: record.result_digest, timestamp: record.timestamp, prev_hash: record.prev_hash,
-  });
-  return createHash('sha256').update(payload).digest('hex');
-}
+export function hashRecord(record: EvidenceRecord): string {}
 
 export function verifyRecord(record: EvidenceRecord): boolean {
killedBy: AH-VERTICAL-002: verticals through real RuntimeLoop coding: routes to plan_execute and executes tool calls through loop
statusReason: expected undefined to be truthy

[Killed] ObjectLiteral
verification/evidence.ts:35:34
 }
 
 export function hashRecord(record: EvidenceRecord): string {
-  const payload = JSON.stringify({
-    id: record.id, run_id: record.run_id, strategy: record.strategy,
-    result_digest: record.result_digest, timestamp: record.timestamp, prev_hash: record.prev_hash,
-  });
+  const payload = JSON.stringify({});
   return createHash('sha256').update(payload).digest('hex');
 }
killedBy: AH-EVIDENCE-001: evidence generation verifyChain detects broken chain
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
verification/evidence.ts:42:63
   return createHash('sha256').update(payload).digest('hex');
 }
 
-export function verifyRecord(record: EvidenceRecord): boolean {
-  return record.record_hash === hashRecord(record);
-}
+export function verifyRecord(record: EvidenceRecord): boolean {}
 
 export function verifyChain(records: EvidenceRecord[]): { valid: boolean; broken_at: number | null } {
killedBy: AH-EVIDENCE-001: evidence generation verifyRecord returns true for untampered record
statusReason: expected undefined to be true // Object.is equality

[Killed] EqualityOperator
verification/evidence.ts:43:10
 }
 
 export function verifyRecord(record: EvidenceRecord): boolean {
-  return record.record_hash === hashRecord(record);
+  return record.record_hash !== hashRecord(record);
 }
 
killedBy: AH-EVIDENCE-001: evidence generation verifyRecord returns true for untampered record
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
verification/evidence.ts:43:10
 }
 
 export function verifyRecord(record: EvidenceRecord): boolean {
-  return record.record_hash === hashRecord(record);
+  return true;
 }
 
killedBy: mutation-kill: evidence and eval verifyRecord returns false for tampered
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
verification/evidence.ts:46:102
   return record.record_hash === hashRecord(record);
 }
 
-export function verifyChain(records: EvidenceRecord[]): { valid: boolean; broken_at: number | null } {
-  for (let i = 1; i < records.length; i++) {
-    if (records[i].prev_hash !== records[i - 1].record_hash) return { valid: false, broken_at: i };
-    if (!verifyRecord(records[i])) return { valid: false, broken_at: i };
-  }
-  return { valid: true, broken_at: null };
-}
+export function verifyChain(records: EvidenceRecord[]): { valid: boolean; broken_at: number | null } {}
 
 export function redactSecrets(text: string, secrets: string[]): string {
killedBy: AH-EVIDENCE-001: evidence generation verifyChain detects broken chain
statusReason: Cannot read properties of undefined (reading 'valid')

[Killed] UpdateOperator
verification/evidence.ts:47:39
 }
 
 export function verifyChain(records: EvidenceRecord[]): { valid: boolean; broken_at: number | null } {
-  for (let i = 1; i < records.length; i++) {
+  for (let i = 1; i < records.length; i--) {
     if (records[i].prev_hash !== records[i - 1].record_hash) return { valid: false, broken_at: i };
     if (!verifyRecord(records[i])) return { valid: false, broken_at: i };
killedBy: AH-EVIDENCE-001: evidence generation verifyChain detects broken chain
statusReason: Cannot read properties of undefined (reading 'record_hash')

[Killed] EqualityOperator
verification/evidence.ts:47:19
 }
 
 export function verifyChain(records: EvidenceRecord[]): { valid: boolean; broken_at: number | null } {
-  for (let i = 1; i < records.length; i++) {
+  for (let i = 1; i <= records.length; i++) {
     if (records[i].prev_hash !== records[i - 1].record_hash) return { valid: false, broken_at: i };
     if (!verifyRecord(records[i])) return { valid: false, broken_at: i };
killedBy: AH-EVIDENCE-001: evidence generation verifyChain detects broken chain
statusReason: Cannot read properties of undefined (reading 'prev_hash')

[Killed] ArithmeticOperator
verification/evidence.ts:48:42
 
 export function verifyChain(records: EvidenceRecord[]): { valid: boolean; broken_at: number | null } {
   for (let i = 1; i < records.length; i++) {
-    if (records[i].prev_hash !== records[i - 1].record_hash) return { valid: false, broken_at: i };
+    if (records[i].prev_hash !== records[i + 1].record_hash) return { valid: false, broken_at: i };
     if (!verifyRecord(records[i])) return { valid: false, broken_at: i };
   }
killedBy: AH-EVIDENCE-001: evidence generation verifyChain detects broken chain
statusReason: Cannot read properties of undefined (reading 'record_hash')

[Killed] ConditionalExpression
verification/evidence.ts:48:9
 
 export function verifyChain(records: EvidenceRecord[]): { valid: boolean; broken_at: number | null } {
   for (let i = 1; i < records.length; i++) {
-    if (records[i].prev_hash !== records[i - 1].record_hash) return { valid: false, broken_at: i };
+    if (true) return { valid: false, broken_at: i };
     if (!verifyRecord(records[i])) return { valid: false, broken_at: i };
   }
killedBy: AH-EVIDENCE-001: evidence generation verifyChain detects broken chain
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
verification/evidence.ts:49:9
 export function verifyChain(records: EvidenceRecord[]): { valid: boolean; broken_at: number | null } {
   for (let i = 1; i < records.length; i++) {
     if (records[i].prev_hash !== records[i - 1].record_hash) return { valid: false, broken_at: i };
-    if (!verifyRecord(records[i])) return { valid: false, broken_at: i };
+    if (verifyRecord(records[i])) return { valid: false, broken_at: i };
   }
   return { valid: true, broken_at: null };
killedBy: AH-EVIDENCE-001: evidence generation verifyChain detects broken chain
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
verification/evidence.ts:49:9
 export function verifyChain(records: EvidenceRecord[]): { valid: boolean; broken_at: number | null } {
   for (let i = 1; i < records.length; i++) {
     if (records[i].prev_hash !== records[i - 1].record_hash) return { valid: false, broken_at: i };
-    if (!verifyRecord(records[i])) return { valid: false, broken_at: i };
+    if (false) return { valid: false, broken_at: i };
   }
   return { valid: true, broken_at: null };
killedBy: AH-EVIDENCE-001: evidence generation verifyChain detects broken chain
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
verification/evidence.ts:51:19
     if (records[i].prev_hash !== records[i - 1].record_hash) return { valid: false, broken_at: i };
     if (!verifyRecord(records[i])) return { valid: false, broken_at: i };
   }
-  return { valid: true, broken_at: null };
+  return { valid: false, broken_at: null };
 }
 
killedBy: AH-EVIDENCE-001: evidence generation verifyChain detects broken chain
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
verification/evidence.ts:51:10
     if (records[i].prev_hash !== records[i - 1].record_hash) return { valid: false, broken_at: i };
     if (!verifyRecord(records[i])) return { valid: false, broken_at: i };
   }
-  return { valid: true, broken_at: null };
+  return {};
 }
 
killedBy: AH-EVIDENCE-001: evidence generation verifyChain detects broken chain
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
verification/evidence.ts:54:72
   return { valid: true, broken_at: null };
 }
 
-export function redactSecrets(text: string, secrets: string[]): string {
-  let result = text;
-  for (const secret of secrets) {
-    if (secret.length > 0) {
-      const escaped = secret.replace(/[.*+?^${}()|[\]\\]/g, '\\$&');
-      result = result.replace(new RegExp(escaped, 'g'), '[REDACTED]');
-    }
-  }
-  return result;
-}
+export function redactSecrets(text: string, secrets: string[]): string {}
 
killedBy: AH-EVIDENCE-001: evidence generation redactSecrets removes known secret values
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] BlockStatement
verification/evidence.ts:56:33
 
 export function redactSecrets(text: string, secrets: string[]): string {
   let result = text;
-  for (const secret of secrets) {
-    if (secret.length > 0) {
-      const escaped = secret.replace(/[.*+?^${}()|[\]\\]/g, '\\$&');
-      result = result.replace(new RegExp(escaped, 'g'), '[REDACTED]');
-    }
-  }
+  for (const secret of secrets) {}
   return result;
 }
killedBy: AH-EVIDENCE-001: evidence generation redactSecrets removes known secret values
statusReason: expected 'error with key sk-secret-123' not to contain 'sk-secret-123'

[Killed] BlockStatement
verification/evidence.ts:57:28
 export function redactSecrets(text: string, secrets: string[]): string {
   let result = text;
   for (const secret of secrets) {
-    if (secret.length > 0) {
-      const escaped = secret.replace(/[.*+?^${}()|[\]\\]/g, '\\$&');
-      result = result.replace(new RegExp(escaped, 'g'), '[REDACTED]');
-    }
+    if (secret.length > 0) {}
   }
   return result;
killedBy: AH-EVIDENCE-001: evidence generation redactSecrets removes known secret values
statusReason: expected 'error with key sk-secret-123' not to contain 'sk-secret-123'

[Killed] ConditionalExpression
verification/evidence.ts:57:9
 export function redactSecrets(text: string, secrets: string[]): string {
   let result = text;
   for (const secret of secrets) {
-    if (secret.length > 0) {
+    if (false) {
       const escaped = secret.replace(/[.*+?^${}()|[\]\\]/g, '\\$&');
       result = result.replace(new RegExp(escaped, 'g'), '[REDACTED]');
killedBy: AH-EVIDENCE-001: evidence generation redactSecrets removes known secret values
statusReason: expected 'error with key sk-secret-123' not to contain 'sk-secret-123'

[Killed] Regex
verification/evidence.ts:58:38
   let result = text;
   for (const secret of secrets) {
     if (secret.length > 0) {
-      const escaped = secret.replace(/[.*+?^${}()|[\]\\]/g, '\\$&');
+      const escaped = secret.replace(/[^.*+?^${}()|[\]\\]/g, '\\$&');
       result = result.replace(new RegExp(escaped, 'g'), '[REDACTED]');
     }
killedBy: AH-EVIDENCE-001: evidence generation redactSecrets removes known secret values
statusReason: expected 'error with key sk-secret-123' not to contain 'sk-secret-123'
