[Killed] BlockStatement
writing/ah_writing_vertical_001.ts:18:112
   passed: boolean;
 }
 
-export function runWritingVertical(vfs: VirtualFilesystem, input: WritingVerticalInput): WritingVerticalResult {
-  const draft = `# Draft\n\nBased on brief: ${input.brief}\n\n${input.style_guide ? `Style: ${input.style_guide}` : ''}`;
-  const rubricScore = draft.length > 20 ? 0.8 : 0.5;
-  const revised = rubricScore < 0.75;
-  const finalDraft = revised ? `${draft}\n\n[Revised for quality]` : draft;
-  writeFile(vfs, { path: input.output_path, content: finalDraft });
-  return { draft: finalDraft, rubric_score: rubricScore, revised, passed: rubricScore >= 0.7 };
-}
+export function runWritingVertical(vfs: VirtualFilesystem, input: WritingVerticalInput): WritingVerticalResult {}
 
killedBy: precision: writing vertical exact output produces draft with correct content
statusReason: Cannot read properties of undefined (reading 'draft')

[Survived] StringLiteral
writing/ah_writing_vertical_001.ts:19:117
 }
 
 export function runWritingVertical(vfs: VirtualFilesystem, input: WritingVerticalInput): WritingVerticalResult {
-  const draft = `# Draft\n\nBased on brief: ${input.brief}\n\n${input.style_guide ? `Style: ${input.style_guide}` : ''}`;
+  const draft = `# Draft\n\nBased on brief: ${input.brief}\n\n${input.style_guide ? `Style: ${input.style_guide}` : "Stryker was here!"}`;
   const rubricScore = draft.length > 20 ? 0.8 : 0.5;
   const revised = rubricScore < 0.75;

[Killed] EqualityOperator
writing/ah_writing_vertical_001.ts:20:23
 
 export function runWritingVertical(vfs: VirtualFilesystem, input: WritingVerticalInput): WritingVerticalResult {
   const draft = `# Draft\n\nBased on brief: ${input.brief}\n\n${input.style_guide ? `Style: ${input.style_guide}` : ''}`;
-  const rubricScore = draft.length > 20 ? 0.8 : 0.5;
+  const rubricScore = draft.length <= 20 ? 0.8 : 0.5;
   const revised = rubricScore < 0.75;
   const finalDraft = revised ? `${draft}\n\n[Revised for quality]` : draft;
killedBy: precision: writing vertical exact output produces draft with correct content
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
writing/ah_writing_vertical_001.ts:20:23
 
 export function runWritingVertical(vfs: VirtualFilesystem, input: WritingVerticalInput): WritingVerticalResult {
   const draft = `# Draft\n\nBased on brief: ${input.brief}\n\n${input.style_guide ? `Style: ${input.style_guide}` : ''}`;
-  const rubricScore = draft.length > 20 ? 0.8 : 0.5;
+  const rubricScore = false ? 0.8 : 0.5;
   const revised = rubricScore < 0.75;
   const finalDraft = revised ? `${draft}\n\n[Revised for quality]` : draft;
killedBy: precision: writing vertical exact output produces draft with correct content
statusReason: expected false to be true // Object.is equality

[Survived] ConditionalExpression
writing/ah_writing_vertical_001.ts:21:19
 export function runWritingVertical(vfs: VirtualFilesystem, input: WritingVerticalInput): WritingVerticalResult {
   const draft = `# Draft\n\nBased on brief: ${input.brief}\n\n${input.style_guide ? `Style: ${input.style_guide}` : ''}`;
   const rubricScore = draft.length > 20 ? 0.8 : 0.5;
-  const revised = rubricScore < 0.75;
+  const revised = true;
   const finalDraft = revised ? `${draft}\n\n[Revised for quality]` : draft;
   writeFile(vfs, { path: input.output_path, content: finalDraft });

[Survived] ConditionalExpression
writing/ah_writing_vertical_001.ts:21:19
 export function runWritingVertical(vfs: VirtualFilesystem, input: WritingVerticalInput): WritingVerticalResult {
   const draft = `# Draft\n\nBased on brief: ${input.brief}\n\n${input.style_guide ? `Style: ${input.style_guide}` : ''}`;
   const rubricScore = draft.length > 20 ? 0.8 : 0.5;
-  const revised = rubricScore < 0.75;
+  const revised = false;
   const finalDraft = revised ? `${draft}\n\n[Revised for quality]` : draft;
   writeFile(vfs, { path: input.output_path, content: finalDraft });

[Killed] ConditionalExpression
writing/ah_writing_vertical_001.ts:24:75
   const revised = rubricScore < 0.75;
   const finalDraft = revised ? `${draft}\n\n[Revised for quality]` : draft;
   writeFile(vfs, { path: input.output_path, content: finalDraft });
-  return { draft: finalDraft, rubric_score: rubricScore, revised, passed: rubricScore >= 0.7 };
+  return { draft: finalDraft, rubric_score: rubricScore, revised, passed: false };
 }
 
killedBy: precision: writing vertical exact output produces draft with correct content
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
writing/ah_writing_vertical_001.ts:24:75
   const revised = rubricScore < 0.75;
   const finalDraft = revised ? `${draft}\n\n[Revised for quality]` : draft;
   writeFile(vfs, { path: input.output_path, content: finalDraft });
-  return { draft: finalDraft, rubric_score: rubricScore, revised, passed: rubricScore >= 0.7 };
+  return { draft: finalDraft, rubric_score: rubricScore, revised, passed: rubricScore < 0.7 };
 }
 
killedBy: precision: writing vertical exact output produces draft with correct content
statusReason: expected false to be true // Object.is equality
