[Killed] ArrowFunction
planning/ah_planning_vertical_001.ts:18:45
 }
 
 export function runPlanningVertical(input: PlanningVerticalInput): PlanningVerticalResult {
-  const steps: PlanStep[] = input.tasks.map((t) => ({
-    id: t.id,
-    tool_name: 'create_artifact',
-    arguments: { name: t.name },
-    dependencies: t.dependencies,
-  }));
+  const steps: PlanStep[] = input.tasks.map(() => undefined);
 
   // Detect cycles
killedBy: AH-VERTICALS: six product verticals planning: constructs valid DAG
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] BooleanLiteral
planning/ah_planning_vertical_001.ts:28:20
   // Detect cycles
   const visited = new Set<string>();
   const stack = new Set<string>();
-  let cycleFound = false;
+  let cycleFound = true;
 
   const dfs = (id: string) => {
killedBy: AH-VERTICALS: six product verticals planning: constructs valid DAG
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
planning/ah_planning_vertical_001.ts:30:31
   const stack = new Set<string>();
   let cycleFound = false;
 
-  const dfs = (id: string) => {
-    if (stack.has(id)) { cycleFound = true; return; }
-    if (visited.has(id)) return;
-    visited.add(id);
-    stack.add(id);
-    const step = steps.find((s) => s.id === id);
-    if (step) for (const dep of step.dependencies) dfs(dep);
-    stack.delete(id);
-  };
+  const dfs = (id: string) => {};
 
   for (const step of steps) dfs(step.id);
killedBy: AH-VERTICALS: six product verticals planning: rejects cyclic dependency
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
planning/ah_planning_vertical_001.ts:31:39
   let cycleFound = false;
 
   const dfs = (id: string) => {
-    if (stack.has(id)) { cycleFound = true; return; }
+    if (stack.has(id)) { cycleFound = false; return; }
     if (visited.has(id)) return;
     visited.add(id);
killedBy: AH-VERTICALS: six product verticals planning: rejects cyclic dependency
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
planning/ah_planning_vertical_001.ts:31:9
   let cycleFound = false;
 
   const dfs = (id: string) => {
-    if (stack.has(id)) { cycleFound = true; return; }
+    if (false) { cycleFound = true; return; }
     if (visited.has(id)) return;
     visited.add(id);
killedBy: AH-VERTICALS: six product verticals planning: rejects cyclic dependency
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
planning/ah_planning_vertical_001.ts:32:9
 
   const dfs = (id: string) => {
     if (stack.has(id)) { cycleFound = true; return; }
-    if (visited.has(id)) return;
+    if (true) return;
     visited.add(id);
     stack.add(id);
killedBy: AH-VERTICALS: six product verticals planning: rejects cyclic dependency
statusReason: expected true to be false // Object.is equality

[Survived] ConditionalExpression
planning/ah_planning_vertical_001.ts:32:9
 
   const dfs = (id: string) => {
     if (stack.has(id)) { cycleFound = true; return; }
-    if (visited.has(id)) return;
+    if (false) return;
     visited.add(id);
     stack.add(id);

[Killed] ConditionalExpression
planning/ah_planning_vertical_001.ts:35:36
     if (visited.has(id)) return;
     visited.add(id);
     stack.add(id);
-    const step = steps.find((s) => s.id === id);
+    const step = steps.find((s) => false);
     if (step) for (const dep of step.dependencies) dfs(dep);
     stack.delete(id);
killedBy: AH-VERTICALS: six product verticals planning: rejects cyclic dependency
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
planning/ah_planning_vertical_001.ts:35:36
     if (visited.has(id)) return;
     visited.add(id);
     stack.add(id);
-    const step = steps.find((s) => s.id === id);
+    const step = steps.find((s) => s.id !== id);
     if (step) for (const dep of step.dependencies) dfs(dep);
     stack.delete(id);
killedBy: AH-VERTICALS: six product verticals planning: constructs valid DAG
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
planning/ah_planning_vertical_001.ts:36:9
     visited.add(id);
     stack.add(id);
     const step = steps.find((s) => s.id === id);
-    if (step) for (const dep of step.dependencies) dfs(dep);
+    if (false) for (const dep of step.dependencies) dfs(dep);
     stack.delete(id);
   };
killedBy: AH-VERTICALS: six product verticals planning: rejects cyclic dependency
statusReason: expected true to be false // Object.is equality

[Survived] ConditionalExpression
planning/ah_planning_vertical_001.ts:36:9
     visited.add(id);
     stack.add(id);
     const step = steps.find((s) => s.id === id);
-    if (step) for (const dep of step.dependencies) dfs(dep);
+    if (true) for (const dep of step.dependencies) dfs(dep);
     stack.delete(id);
   };

[Survived] ArrayDeclaration
planning/ah_planning_vertical_001.ts:42:30
 
   for (const step of steps) dfs(step.id);
 
-  const rejected: string[] = [];
+  const rejected: string[] = ["Stryker was here"];
   if (cycleFound) {
     return { plan: [], valid: false, cycle_detected: true, rejected_tasks: steps.map((s) => s.id) };

[Killed] BlockStatement
planning/ah_planning_vertical_001.ts:43:19
   for (const step of steps) dfs(step.id);
 
   const rejected: string[] = [];
-  if (cycleFound) {
-    return { plan: [], valid: false, cycle_detected: true, rejected_tasks: steps.map((s) => s.id) };
-  }
+  if (cycleFound) {}
 
   return { plan: steps, valid: true, cycle_detected: false, rejected_tasks: rejected };
killedBy: AH-VERTICALS: six product verticals planning: rejects cyclic dependency
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
planning/ah_planning_vertical_001.ts:43:7
   for (const step of steps) dfs(step.id);
 
   const rejected: string[] = [];
-  if (cycleFound) {
+  if (false) {
     return { plan: [], valid: false, cycle_detected: true, rejected_tasks: steps.map((s) => s.id) };
   }
killedBy: AH-VERTICALS: six product verticals planning: rejects cyclic dependency
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
planning/ah_planning_vertical_001.ts:44:31
 
   const rejected: string[] = [];
   if (cycleFound) {
-    return { plan: [], valid: false, cycle_detected: true, rejected_tasks: steps.map((s) => s.id) };
+    return { plan: [], valid: true, cycle_detected: true, rejected_tasks: steps.map((s) => s.id) };
   }
 
killedBy: AH-VERTICALS: six product verticals planning: rejects cyclic dependency
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
planning/ah_planning_vertical_001.ts:44:54
 
   const rejected: string[] = [];
   if (cycleFound) {
-    return { plan: [], valid: false, cycle_detected: true, rejected_tasks: steps.map((s) => s.id) };
+    return { plan: [], valid: false, cycle_detected: false, rejected_tasks: steps.map((s) => s.id) };
   }
 
killedBy: AH-VERTICALS: six product verticals planning: rejects cyclic dependency
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
planning/ah_planning_vertical_001.ts:47:54
     return { plan: [], valid: false, cycle_detected: true, rejected_tasks: steps.map((s) => s.id) };
   }
 
-  return { plan: steps, valid: true, cycle_detected: false, rejected_tasks: rejected };
+  return { plan: steps, valid: true, cycle_detected: true, rejected_tasks: rejected };
 }
 
killedBy: AH-VERTICALS: six product verticals planning: constructs valid DAG
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
planning/ah_planning_vertical_001.ts:47:32
     return { plan: [], valid: false, cycle_detected: true, rejected_tasks: steps.map((s) => s.id) };
   }
 
-  return { plan: steps, valid: true, cycle_detected: false, rejected_tasks: rejected };
+  return { plan: steps, valid: false, cycle_detected: false, rejected_tasks: rejected };
 }
 
killedBy: AH-VERTICALS: six product verticals planning: constructs valid DAG
statusReason: expected false to be true // Object.is equality
