[Killed] ConditionalExpression
runtime/direct.ts:23:9
     const response: ParsedResponse = model.complete(req);
 
     // Strategy violation: model requested tools in direct mode
-    if (response.tool_calls && response.tool_calls.length > 0) {
+    if (true) {
       return {
         strategy: 'direct',
killedBy: precision: DirectStrategy exact behavior exactly 1 model call, 0 tool calls, completed
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] EqualityOperator
runtime/direct.ts:23:32
     const response: ParsedResponse = model.complete(req);
 
     // Strategy violation: model requested tools in direct mode
-    if (response.tool_calls && response.tool_calls.length > 0) {
+    if (response.tool_calls && response.tool_calls.length <= 0) {
       return {
         strategy: 'direct',
killedBy: precision: DirectStrategy exact behavior tool call in response -> error + strategy_violation in denied_actions
statusReason: expected 'completed' to be 'error' // Object.is equality

[Killed] ObjectLiteral
runtime/direct.ts:24:14
 
     // Strategy violation: model requested tools in direct mode
     if (response.tool_calls && response.tool_calls.length > 0) {
-      return {
-        strategy: 'direct',
-        output: '',
-        tool_calls_made: 0,
-        iterations: 1,
-        model_calls: 1,
-        stop_reason: 'error',
-        observations: [],
-        denied_actions: [`strategy_violation: model requested ${response.tool_calls.length} tool call(s) in direct mode`],
-      };
+      return {};
     }
 
killedBy: precision: DirectStrategy exact behavior tool call in response -> error + strategy_violation in denied_actions
statusReason: expected undefined to be 'error' // Object.is equality

[Killed] StringLiteral
runtime/direct.ts:26:17
     if (response.tool_calls && response.tool_calls.length > 0) {
       return {
         strategy: 'direct',
-        output: '',
+        output: "Stryker was here!",
         tool_calls_made: 0,
         iterations: 1,
killedBy: precision: DirectStrategy exact behavior tool call in response -> error + strategy_violation in denied_actions
statusReason: expected 'Stryker was here!' to be '' // Object.is equality

[Killed] StringLiteral
runtime/direct.ts:30:22
         tool_calls_made: 0,
         iterations: 1,
         model_calls: 1,
-        stop_reason: 'error',
+        stop_reason: "",
         observations: [],
         denied_actions: [`strategy_violation: model requested ${response.tool_calls.length} tool call(s) in direct mode`],
killedBy: precision: DirectStrategy exact behavior tool call in response -> error + strategy_violation in denied_actions
statusReason: expected '' to be 'error' // Object.is equality

[Survived] ArrayDeclaration
runtime/direct.ts:31:23
         iterations: 1,
         model_calls: 1,
         stop_reason: 'error',
-        observations: [],
+        observations: ["Stryker was here"],
         denied_actions: [`strategy_violation: model requested ${response.tool_calls.length} tool call(s) in direct mode`],
       };

[Killed] ArrayDeclaration
runtime/direct.ts:44:23
       model_calls: 1,
       stop_reason: 'completed',
       observations: [],
-      denied_actions: [],
+      denied_actions: ["Stryker was here"],
     };
   }
killedBy: precision: DirectStrategy exact behavior exactly 1 model call, 0 tool calls, completed
statusReason: expected [ 'Stryker was here' ] to deeply equal []
