[Killed] BlockStatement
runtime/loop-helpers.ts:10:47
 import type { Policy } from '../security/policy-engine.js';
 import { createHash } from 'node:crypto';
 
-export function defaultReadRisk(): EffectRisk {
-  return {
-    locality: 'local',
-    operation: 'read',
-    reversibility: 'guaranteed',
-    data_egress: 'none',
-    network_access: false,
-    credential_access: false,
-    blast_radius: 'self',
-    financial_impact_usd_micros: 0,
-    human_impact: 'none',
-    external_visibility: 'none',
-    regulatory_sensitivity: 'none',
-  };
-}
+export function defaultReadRisk(): EffectRisk {}
 
 export function defaultWriteRisk(): EffectRisk {
killedBy: precision: loop-helpers exact risk read_file -> read operation, guaranteed reversibility
statusReason: Cannot read properties of undefined (reading 'operation')

[Killed] StringLiteral
runtime/loop-helpers.ts:13:16
 export function defaultReadRisk(): EffectRisk {
   return {
     locality: 'local',
-    operation: 'read',
+    operation: "",
     reversibility: 'guaranteed',
     data_egress: 'none',
killedBy: precision: loop-helpers exact risk read_file -> read operation, guaranteed reversibility
statusReason: expected '' to be 'read' // Object.is equality

[Killed] StringLiteral
runtime/loop-helpers.ts:14:20
   return {
     locality: 'local',
     operation: 'read',
-    reversibility: 'guaranteed',
+    reversibility: "",
     data_egress: 'none',
     network_access: false,
killedBy: precision: loop-helpers exact risk read_file -> read operation, guaranteed reversibility
statusReason: expected '' to be 'guaranteed' // Object.is equality

[Survived] BooleanLiteral
runtime/loop-helpers.ts:16:21
     operation: 'read',
     reversibility: 'guaranteed',
     data_egress: 'none',
-    network_access: false,
+    network_access: true,
     credential_access: false,
     blast_radius: 'self',

[Survived] BooleanLiteral
runtime/loop-helpers.ts:17:24
     reversibility: 'guaranteed',
     data_egress: 'none',
     network_access: false,
-    credential_access: false,
+    credential_access: true,
     blast_radius: 'self',
     financial_impact_usd_micros: 0,

[Killed] BlockStatement
runtime/loop-helpers.ts:26:48
   };
 }
 
-export function defaultWriteRisk(): EffectRisk {
-  return { ...defaultReadRisk(), operation: 'write' };
-}
+export function defaultWriteRisk(): EffectRisk {}
 
 export function riskForTool(toolName: string): EffectRisk {
killedBy: precision: loop-helpers exact risk write_file -> write operation
statusReason: Cannot read properties of undefined (reading 'operation')

[Killed] StringLiteral
runtime/loop-helpers.ts:27:45
 }
 
 export function defaultWriteRisk(): EffectRisk {
-  return { ...defaultReadRisk(), operation: 'write' };
+  return { ...defaultReadRisk(), operation: "" };
 }
 
killedBy: precision: loop-helpers exact risk write_file -> write operation
statusReason: expected '' to be 'write' // Object.is equality

[Killed] BlockStatement
runtime/loop-helpers.ts:30:59
   return { ...defaultReadRisk(), operation: 'write' };
 }
 
-export function riskForTool(toolName: string): EffectRisk {
-  if (toolName.includes('write') || toolName.includes('edit') || toolName.includes('create')) {
-    return defaultWriteRisk();
-  }
-  if (toolName.includes('execute') || toolName.includes('command')) {
-    return { ...defaultReadRisk(), operation: 'execute', reversibility: 'best_effort' };
-  }
-  if (toolName.includes('delete') || toolName.includes('remove')) {
-    return { ...defaultReadRisk(), operation: 'delete', reversibility: 'none' };
-  }
-  return defaultReadRisk();
-}
+export function riskForTool(toolName: string): EffectRisk {}
 
 export function computeManifestHash(toolName: string, args: Record<string, unknown>): string {
killedBy: precision: loop-helpers exact risk read_file -> read operation, guaranteed reversibility
statusReason: Cannot read properties of undefined (reading 'operation')

[Killed] ConditionalExpression
runtime/loop-helpers.ts:31:7
 }
 
 export function riskForTool(toolName: string): EffectRisk {
-  if (toolName.includes('write') || toolName.includes('edit') || toolName.includes('create')) {
+  if (false) {
     return defaultWriteRisk();
   }
killedBy: precision: loop-helpers exact risk write_file -> write operation
statusReason: expected 'read' to be 'write' // Object.is equality

[Killed] ConditionalExpression
runtime/loop-helpers.ts:31:7
 }
 
 export function riskForTool(toolName: string): EffectRisk {
-  if (toolName.includes('write') || toolName.includes('edit') || toolName.includes('create')) {
+  if (false || toolName.includes('create')) {
     return defaultWriteRisk();
   }
killedBy: precision: loop-helpers exact risk write_file -> write operation
statusReason: expected 'read' to be 'write' // Object.is equality

[Killed] ConditionalExpression
runtime/loop-helpers.ts:34:7
   if (toolName.includes('write') || toolName.includes('edit') || toolName.includes('create')) {
     return defaultWriteRisk();
   }
-  if (toolName.includes('execute') || toolName.includes('command')) {
+  if (true) {
     return { ...defaultReadRisk(), operation: 'execute', reversibility: 'best_effort' };
   }
killedBy: precision: loop-helpers exact risk read_file -> read operation, guaranteed reversibility
statusReason: expected 'execute' to be 'read' // Object.is equality

[Killed] ConditionalExpression
runtime/loop-helpers.ts:34:7
   if (toolName.includes('write') || toolName.includes('edit') || toolName.includes('create')) {
     return defaultWriteRisk();
   }
-  if (toolName.includes('execute') || toolName.includes('command')) {
+  if (false) {
     return { ...defaultReadRisk(), operation: 'execute', reversibility: 'best_effort' };
   }
killedBy: precision: loop-helpers exact risk execute_command -> execute operation, best_effort reversibility
statusReason: expected 'read' to be 'execute' // Object.is equality

[Killed] StringLiteral
runtime/loop-helpers.ts:35:73
     return defaultWriteRisk();
   }
   if (toolName.includes('execute') || toolName.includes('command')) {
-    return { ...defaultReadRisk(), operation: 'execute', reversibility: 'best_effort' };
+    return { ...defaultReadRisk(), operation: 'execute', reversibility: "" };
   }
   if (toolName.includes('delete') || toolName.includes('remove')) {
killedBy: precision: loop-helpers exact risk execute_command -> execute operation, best_effort reversibility
statusReason: expected '' to be 'best_effort' // Object.is equality

[Killed] ConditionalExpression
runtime/loop-helpers.ts:37:7
   if (toolName.includes('execute') || toolName.includes('command')) {
     return { ...defaultReadRisk(), operation: 'execute', reversibility: 'best_effort' };
   }
-  if (toolName.includes('delete') || toolName.includes('remove')) {
+  if (true) {
     return { ...defaultReadRisk(), operation: 'delete', reversibility: 'none' };
   }
killedBy: precision: loop-helpers exact risk read_file -> read operation, guaranteed reversibility
statusReason: expected 'delete' to be 'read' // Object.is equality

[Killed] BlockStatement
runtime/loop-helpers.ts:37:67
   if (toolName.includes('execute') || toolName.includes('command')) {
     return { ...defaultReadRisk(), operation: 'execute', reversibility: 'best_effort' };
   }
-  if (toolName.includes('delete') || toolName.includes('remove')) {
-    return { ...defaultReadRisk(), operation: 'delete', reversibility: 'none' };
-  }
+  if (toolName.includes('delete') || toolName.includes('remove')) {}
   return defaultReadRisk();
 }
killedBy: precision: loop-helpers exact risk delete_file -> delete operation, none reversibility
statusReason: expected 'read' to be 'delete' // Object.is equality

[Killed] StringLiteral
runtime/loop-helpers.ts:38:72
     return { ...defaultReadRisk(), operation: 'execute', reversibility: 'best_effort' };
   }
   if (toolName.includes('delete') || toolName.includes('remove')) {
-    return { ...defaultReadRisk(), operation: 'delete', reversibility: 'none' };
+    return { ...defaultReadRisk(), operation: 'delete', reversibility: "" };
   }
   return defaultReadRisk();
killedBy: precision: loop-helpers exact risk delete_file -> delete operation, none reversibility
statusReason: expected '' to be 'none' // Object.is equality

[Killed] BlockStatement
runtime/loop-helpers.ts:43:94
   return defaultReadRisk();
 }
 
-export function computeManifestHash(toolName: string, args: Record<string, unknown>): string {
-  return createHash('sha256').update(JSON.stringify({ toolName, args })).digest('hex');
-}
+export function computeManifestHash(toolName: string, args: Record<string, unknown>): string {}
 
 export function createDefaultPolicy(): Policy {
killedBy: precision: loop-helpers exact risk computeManifestHash is deterministic and 64 hex chars
statusReason: .toMatch() expects to receive a string, but got undefined

[Killed] StringLiteral
runtime/loop-helpers.ts:44:81
 }
 
 export function computeManifestHash(toolName: string, args: Record<string, unknown>): string {
-  return createHash('sha256').update(JSON.stringify({ toolName, args })).digest('hex');
+  return createHash('sha256').update(JSON.stringify({ toolName, args })).digest("");
 }
 
killedBy: precision: loop-helpers exact risk computeManifestHash is deterministic and 64 hex chars
statusReason: expected Buffer[ 9, 89, 180, 43, 209, 26, …(-123) ] to be Buffer[ 9, 89, 180, 43, 209, 26, …(-123) ] // Object.is equality

If it should pass with deep equality, replace "toBe" with "toStrictEqual"

Expected: Buffer[ 9, 89, 180, 43, 209, 26, …(-123) ]
Received: serializes to the same string

[Killed] ObjectLiteral
runtime/loop-helpers.ts:44:53
 }
 
 export function computeManifestHash(toolName: string, args: Record<string, unknown>): string {
-  return createHash('sha256').update(JSON.stringify({ toolName, args })).digest('hex');
+  return createHash('sha256').update(JSON.stringify({})).digest('hex');
 }
 
killedBy: precision: loop-helpers exact risk computeManifestHash differs for different inputs
statusReason: expected '44136fa355b3678a1146ad16f7e8649e94fb4…' not to be '44136fa355b3678a1146ad16f7e8649e94fb4…' // Object.is equality

[Killed] BlockStatement
runtime/loop-helpers.ts:47:47
   return createHash('sha256').update(JSON.stringify({ toolName, args })).digest('hex');
 }
 
-export function createDefaultPolicy(): Policy {
-  return {
-    rules: [
-      { tool: 'read_file', allow: true },
-      { tool: 'write_file', allow: true },
-      { tool: 'edit_file', allow: true },
-      { tool: 'search_files', allow: true },
-      { tool: 'list_directory', allow: true },
-      { tool: 'create_artifact', allow: true },
-      { tool: 'execute_command', allow: true },
-      { tool: 'parse_document', allow: true },
-      { tool: 'ask_user', allow: true },
-      { tool: 'direct_response', allow: true },
-    ],
-    default_decision: 'deny',
-  };
-}
+export function createDefaultPolicy(): Policy {}
 
killedBy: precision: loop-helpers exact risk createDefaultPolicy has exactly 10 allow rules + deny default
statusReason: Cannot read properties of undefined (reading 'default_decision')

[Killed] BooleanLiteral
runtime/loop-helpers.ts:50:35
 export function createDefaultPolicy(): Policy {
   return {
     rules: [
-      { tool: 'read_file', allow: true },
+      { tool: 'read_file', allow: false },
       { tool: 'write_file', allow: true },
       { tool: 'edit_file', allow: true },
killedBy: precision: loop-helpers exact risk createDefaultPolicy has exactly 10 allow rules + deny default
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
runtime/loop-helpers.ts:50:15
 export function createDefaultPolicy(): Policy {
   return {
     rules: [
-      { tool: 'read_file', allow: true },
+      { tool: "", allow: true },
       { tool: 'write_file', allow: true },
       { tool: 'edit_file', allow: true },
killedBy: precision: loop-helpers exact risk createDefaultPolicy has exactly 10 allow rules + deny default
statusReason: expected [ '', 'write_file', 'edit_file', …(7) ] to include 'read_file'

[Killed] BooleanLiteral
runtime/loop-helpers.ts:51:36
   return {
     rules: [
       { tool: 'read_file', allow: true },
-      { tool: 'write_file', allow: true },
+      { tool: 'write_file', allow: false },
       { tool: 'edit_file', allow: true },
       { tool: 'search_files', allow: true },
killedBy: precision: loop-helpers exact risk createDefaultPolicy has exactly 10 allow rules + deny default
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
runtime/loop-helpers.ts:51:7
   return {
     rules: [
       { tool: 'read_file', allow: true },
-      { tool: 'write_file', allow: true },
+      {},
       { tool: 'edit_file', allow: true },
       { tool: 'search_files', allow: true },
killedBy: precision: loop-helpers exact risk createDefaultPolicy has exactly 10 allow rules + deny default
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
runtime/loop-helpers.ts:52:35
     rules: [
       { tool: 'read_file', allow: true },
       { tool: 'write_file', allow: true },
-      { tool: 'edit_file', allow: true },
+      { tool: 'edit_file', allow: false },
       { tool: 'search_files', allow: true },
       { tool: 'list_directory', allow: true },
killedBy: precision: loop-helpers exact risk createDefaultPolicy has exactly 10 allow rules + deny default
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
runtime/loop-helpers.ts:52:7
     rules: [
       { tool: 'read_file', allow: true },
       { tool: 'write_file', allow: true },
-      { tool: 'edit_file', allow: true },
+      {},
       { tool: 'search_files', allow: true },
       { tool: 'list_directory', allow: true },
killedBy: precision: loop-helpers exact risk createDefaultPolicy has exactly 10 allow rules + deny default
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
runtime/loop-helpers.ts:53:38
       { tool: 'read_file', allow: true },
       { tool: 'write_file', allow: true },
       { tool: 'edit_file', allow: true },
-      { tool: 'search_files', allow: true },
+      { tool: 'search_files', allow: false },
       { tool: 'list_directory', allow: true },
       { tool: 'create_artifact', allow: true },
killedBy: precision: loop-helpers exact risk createDefaultPolicy has exactly 10 allow rules + deny default
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
runtime/loop-helpers.ts:53:7
       { tool: 'read_file', allow: true },
       { tool: 'write_file', allow: true },
       { tool: 'edit_file', allow: true },
-      { tool: 'search_files', allow: true },
+      {},
       { tool: 'list_directory', allow: true },
       { tool: 'create_artifact', allow: true },
killedBy: precision: loop-helpers exact risk createDefaultPolicy has exactly 10 allow rules + deny default
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
runtime/loop-helpers.ts:54:40
       { tool: 'write_file', allow: true },
       { tool: 'edit_file', allow: true },
       { tool: 'search_files', allow: true },
-      { tool: 'list_directory', allow: true },
+      { tool: 'list_directory', allow: false },
       { tool: 'create_artifact', allow: true },
       { tool: 'execute_command', allow: true },
killedBy: precision: loop-helpers exact risk createDefaultPolicy has exactly 10 allow rules + deny default
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
runtime/loop-helpers.ts:55:41
       { tool: 'edit_file', allow: true },
       { tool: 'search_files', allow: true },
       { tool: 'list_directory', allow: true },
-      { tool: 'create_artifact', allow: true },
+      { tool: 'create_artifact', allow: false },
       { tool: 'execute_command', allow: true },
       { tool: 'parse_document', allow: true },
killedBy: precision: loop-helpers exact risk createDefaultPolicy has exactly 10 allow rules + deny default
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
runtime/loop-helpers.ts:55:7
       { tool: 'edit_file', allow: true },
       { tool: 'search_files', allow: true },
       { tool: 'list_directory', allow: true },
-      { tool: 'create_artifact', allow: true },
+      {},
       { tool: 'execute_command', allow: true },
       { tool: 'parse_document', allow: true },
killedBy: precision: loop-helpers exact risk createDefaultPolicy has exactly 10 allow rules + deny default
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
runtime/loop-helpers.ts:56:41
       { tool: 'search_files', allow: true },
       { tool: 'list_directory', allow: true },
       { tool: 'create_artifact', allow: true },
-      { tool: 'execute_command', allow: true },
+      { tool: 'execute_command', allow: false },
       { tool: 'parse_document', allow: true },
       { tool: 'ask_user', allow: true },
killedBy: precision: loop-helpers exact risk createDefaultPolicy has exactly 10 allow rules + deny default
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
runtime/loop-helpers.ts:56:15
       { tool: 'search_files', allow: true },
       { tool: 'list_directory', allow: true },
       { tool: 'create_artifact', allow: true },
-      { tool: 'execute_command', allow: true },
+      { tool: "", allow: true },
       { tool: 'parse_document', allow: true },
       { tool: 'ask_user', allow: true },
killedBy: precision: loop-helpers exact risk createDefaultPolicy has exactly 10 allow rules + deny default
statusReason: expected [ 'read_file', 'write_file', …(8) ] to include 'execute_command'

[Killed] BooleanLiteral
runtime/loop-helpers.ts:57:40
       { tool: 'list_directory', allow: true },
       { tool: 'create_artifact', allow: true },
       { tool: 'execute_command', allow: true },
-      { tool: 'parse_document', allow: true },
+      { tool: 'parse_document', allow: false },
       { tool: 'ask_user', allow: true },
       { tool: 'direct_response', allow: true },
killedBy: precision: loop-helpers exact risk createDefaultPolicy has exactly 10 allow rules + deny default
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
runtime/loop-helpers.ts:57:15
       { tool: 'list_directory', allow: true },
       { tool: 'create_artifact', allow: true },
       { tool: 'execute_command', allow: true },
-      { tool: 'parse_document', allow: true },
+      { tool: "", allow: true },
       { tool: 'ask_user', allow: true },
       { tool: 'direct_response', allow: true },
killedBy: precision: loop-helpers exact risk createDefaultPolicy has exactly 10 allow rules + deny default
statusReason: expected [ 'read_file', 'write_file', …(8) ] to include 'parse_document'

[Killed] BooleanLiteral
runtime/loop-helpers.ts:58:34
       { tool: 'create_artifact', allow: true },
       { tool: 'execute_command', allow: true },
       { tool: 'parse_document', allow: true },
-      { tool: 'ask_user', allow: true },
+      { tool: 'ask_user', allow: false },
       { tool: 'direct_response', allow: true },
     ],
killedBy: precision: loop-helpers exact risk createDefaultPolicy has exactly 10 allow rules + deny default
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
runtime/loop-helpers.ts:59:41
       { tool: 'execute_command', allow: true },
       { tool: 'parse_document', allow: true },
       { tool: 'ask_user', allow: true },
-      { tool: 'direct_response', allow: true },
+      { tool: 'direct_response', allow: false },
     ],
     default_decision: 'deny',
killedBy: precision: loop-helpers exact risk createDefaultPolicy has exactly 10 allow rules + deny default
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
runtime/loop-helpers.ts:59:15
       { tool: 'execute_command', allow: true },
       { tool: 'parse_document', allow: true },
       { tool: 'ask_user', allow: true },
-      { tool: 'direct_response', allow: true },
+      { tool: "", allow: true },
     ],
     default_decision: 'deny',
killedBy: precision: loop-helpers exact risk createDefaultPolicy has exactly 10 allow rules + deny default
statusReason: expected [ 'read_file', 'write_file', …(8) ] to include 'direct_response'
