[Killed] ArrayDeclaration
runtime/notifications.ts:25:52
 }
 
 export class NotificationQueue {
-  private readonly notifications: Notification[] = [];
+  private readonly notifications: Notification[] = ["Stryker was here"];
   private seqCounter = 0;
 
killedBy: precision: exact notification message strings run_created message is exact
statusReason: expected undefined to be 'Run run-abc created' // Object.is equality

[Killed] BlockStatement
runtime/notifications.ts:28:55
   private readonly notifications: Notification[] = [];
   private seqCounter = 0;
 
-  fromEvent(event: SessionEvent): Notification | null {
-    const mapping = this.mapEventToNotification(event);
-    if (!mapping) return null;
-
-    const notification: Notification = {
-      id: `notif-${++this.seqCounter}`,
-      level: mapping.level,
-      category: mapping.category,
-      message: mapping.message,
-      run_id: event.run_id,
-      step_id: event.step_id,
-      timestamp: event.timestamp,
-      source_event_seq: event.seq,
-    };
-
-    this.notifications.push(notification);
-    return notification;
-  }
+  fromEvent(event: SessionEvent): Notification | null {}
 
   fromEvents(events: readonly SessionEvent[]): Notification[] {
killedBy: precision: RuntimeLoop additional branches notifications generated from session events
statusReason: expected 0 to be greater than 0

[Killed] ConditionalExpression
runtime/notifications.ts:30:9
 
   fromEvent(event: SessionEvent): Notification | null {
     const mapping = this.mapEventToNotification(event);
-    if (!mapping) return null;
+    if (true) return null;
 
     const notification: Notification = {
killedBy: precision: RuntimeLoop additional branches notifications generated from session events
statusReason: expected 0 to be greater than 0

[Killed] ConditionalExpression
runtime/notifications.ts:30:9
 
   fromEvent(event: SessionEvent): Notification | null {
     const mapping = this.mapEventToNotification(event);
-    if (!mapping) return null;
+    if (false) return null;
 
     const notification: Notification = {
killedBy: precision: RuntimeLoop exact session events direct run produces exact event sequence
statusReason: Cannot read properties of null (reading 'level')

[Killed] ObjectLiteral
runtime/notifications.ts:32:40
     const mapping = this.mapEventToNotification(event);
     if (!mapping) return null;
 
-    const notification: Notification = {
-      id: `notif-${++this.seqCounter}`,
-      level: mapping.level,
-      category: mapping.category,
-      message: mapping.message,
-      run_id: event.run_id,
-      step_id: event.step_id,
-      timestamp: event.timestamp,
-      source_event_seq: event.seq,
-    };
+    const notification: Notification = {};
 
     this.notifications.push(notification);
killedBy: precision: notifications getByLevel and getByCategory exact results getByLevel returns exact count for each level
statusReason: expected +0 to be 2 // Object.is equality

[Killed] UpdateOperator
runtime/notifications.ts:33:20
     if (!mapping) return null;
 
     const notification: Notification = {
-      id: `notif-${++this.seqCounter}`,
+      id: `notif-${--this.seqCounter}`,
       level: mapping.level,
       category: mapping.category,
killedBy: precision: exact notification message strings notification id increments sequentially
statusReason: expected 'notif--1' to be 'notif-1' // Object.is equality

[Killed] BlockStatement
runtime/notifications.ts:47:63
     return notification;
   }
 
-  fromEvents(events: readonly SessionEvent[]): Notification[] {
-    const results: Notification[] = [];
-    for (const event of events) {
-      const notif = this.fromEvent(event);
-      if (notif) results.push(notif);
-    }
-    return results;
-  }
+  fromEvents(events: readonly SessionEvent[]): Notification[] {}
 
   get all(): readonly Notification[] {
killedBy: AH-RUNTIME-001: runtime loop generates notifications from events
statusReason: expected 0 to be greater than 0

[Killed] BlockStatement
runtime/notifications.ts:49:33
 
   fromEvents(events: readonly SessionEvent[]): Notification[] {
     const results: Notification[] = [];
-    for (const event of events) {
-      const notif = this.fromEvent(event);
-      if (notif) results.push(notif);
-    }
+    for (const event of events) {}
     return results;
   }
killedBy: precision: RuntimeLoop additional branches notifications generated from session events
statusReason: expected 0 to be greater than 0

[Survived] ConditionalExpression
runtime/notifications.ts:51:11
     const results: Notification[] = [];
     for (const event of events) {
       const notif = this.fromEvent(event);
-      if (notif) results.push(notif);
+      if (true) results.push(notif);
     }
     return results;

[Survived] ConditionalExpression
runtime/notifications.ts:51:11
     const results: Notification[] = [];
     for (const event of events) {
       const notif = this.fromEvent(event);
-      if (notif) results.push(notif);
+      if (false) results.push(notif);
     }
     return results;

[Killed] BlockStatement
runtime/notifications.ts:56:38
     return results;
   }
 
-  get all(): readonly Notification[] {
-    return [...this.notifications];
-  }
+  get all(): readonly Notification[] {}
 
   get count(): number {
killedBy: precision: exact notification message strings run_created message is exact
statusReason: Cannot read properties of undefined (reading '0')

[Killed] BlockStatement
runtime/notifications.ts:60:23
     return [...this.notifications];
   }
 
-  get count(): number {
-    return this.notifications.length;
-  }
+  get count(): number {}
 
   getByLevel(level: NotificationLevel): Notification[] {
killedBy: precision: RuntimeLoop additional branches notifications generated from session events
statusReason: actual value must be number or bigint, received "undefined"

[Killed] BlockStatement
runtime/notifications.ts:64:56
     return this.notifications.length;
   }
 
-  getByLevel(level: NotificationLevel): Notification[] {
-    return this.notifications.filter((n) => n.level === level);
-  }
+  getByLevel(level: NotificationLevel): Notification[] {}
 
   getByCategory(category: NotificationCategory): Notification[] {
killedBy: precision: notifications getByLevel and getByCategory exact results getByLevel returns exact count for each level
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
runtime/notifications.ts:65:45
   }
 
   getByLevel(level: NotificationLevel): Notification[] {
-    return this.notifications.filter((n) => n.level === level);
+    return this.notifications.filter((n) => false);
   }
 
killedBy: precision: notifications getByLevel and getByCategory exact results getByLevel returns exact count for each level
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ArrowFunction
runtime/notifications.ts:65:38
   }
 
   getByLevel(level: NotificationLevel): Notification[] {
-    return this.notifications.filter((n) => n.level === level);
+    return this.notifications.filter(() => undefined);
   }
 
killedBy: precision: notifications getByLevel and getByCategory exact results getByLevel returns exact count for each level
statusReason: expected +0 to be 2 // Object.is equality

[Killed] BlockStatement
runtime/notifications.ts:68:65
     return this.notifications.filter((n) => n.level === level);
   }
 
-  getByCategory(category: NotificationCategory): Notification[] {
-    return this.notifications.filter((n) => n.category === category);
-  }
+  getByCategory(category: NotificationCategory): Notification[] {}
 
   clear(): void {
killedBy: precision: notifications getByLevel and getByCategory exact results getByCategory returns exact count for each category
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] MethodExpression
runtime/notifications.ts:69:12
   }
 
   getByCategory(category: NotificationCategory): Notification[] {
-    return this.notifications.filter((n) => n.category === category);
+    return this.notifications;
   }
 
killedBy: precision: notifications getByLevel and getByCategory exact results getByCategory returns exact count for each category
statusReason: expected 5 to be 2 // Object.is equality

[Killed] EqualityOperator
runtime/notifications.ts:69:45
   }
 
   getByCategory(category: NotificationCategory): Notification[] {
-    return this.notifications.filter((n) => n.category === category);
+    return this.notifications.filter((n) => n.category !== category);
   }
 
killedBy: precision: notifications getByLevel and getByCategory exact results getByCategory returns exact count for each category
statusReason: expected 3 to be 2 // Object.is equality

[Killed] BlockStatement
runtime/notifications.ts:72:17
     return this.notifications.filter((n) => n.category === category);
   }
 
-  clear(): void {
-    this.notifications.length = 0;
-  }
+  clear(): void {}
 
   private mapEventToNotification(event: SessionEvent): {
killedBy: coverage: NotificationQueue methods clear removes all notifications
statusReason: expected 2 to be +0 // Object.is equality

[Killed] ConditionalExpression
runtime/notifications.ts:82:7
     message: string;
   } | null {
     switch (event.type) {
-      case 'run_created':
-        return { level: 'info', category: 'run', message: `Run ${event.run_id} created` };
+      case 'run_created':
       case 'run_started':
         return { level: 'info', category: 'run', message: `Run ${event.run_id} started` };
killedBy: precision: exact notification message strings run_created message is exact
statusReason: expected 'Run run-abc started' to be 'Run run-abc created' // Object.is equality

[Killed] StringLiteral
runtime/notifications.ts:83:25
   } | null {
     switch (event.type) {
       case 'run_created':
-        return { level: 'info', category: 'run', message: `Run ${event.run_id} created` };
+        return { level: "", category: 'run', message: `Run ${event.run_id} created` };
       case 'run_started':
         return { level: 'info', category: 'run', message: `Run ${event.run_id} started` };
killedBy: precision: notifications getByLevel and getByCategory exact results getByLevel returns exact count for each level
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ConditionalExpression
runtime/notifications.ts:84:7
     switch (event.type) {
       case 'run_created':
         return { level: 'info', category: 'run', message: `Run ${event.run_id} created` };
-      case 'run_started':
-        return { level: 'info', category: 'run', message: `Run ${event.run_id} started` };
+      case 'run_started':
       case 'run_completed':
         return { level: 'info', category: 'run', message: `Run ${event.run_id} completed` };
killedBy: precision: exact notification message strings run_started message is exact
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] StringLiteral
runtime/notifications.ts:84:12
     switch (event.type) {
       case 'run_created':
         return { level: 'info', category: 'run', message: `Run ${event.run_id} created` };
-      case 'run_started':
+      case "":
         return { level: 'info', category: 'run', message: `Run ${event.run_id} started` };
       case 'run_completed':
killedBy: precision: notifications getByLevel and getByCategory exact results getByLevel returns exact count for each level
statusReason: expected 1 to be 2 // Object.is equality

[Killed] StringLiteral
runtime/notifications.ts:85:25
       case 'run_created':
         return { level: 'info', category: 'run', message: `Run ${event.run_id} created` };
       case 'run_started':
-        return { level: 'info', category: 'run', message: `Run ${event.run_id} started` };
+        return { level: "", category: 'run', message: `Run ${event.run_id} started` };
       case 'run_completed':
         return { level: 'info', category: 'run', message: `Run ${event.run_id} completed` };
killedBy: precision: notifications getByLevel and getByCategory exact results getByLevel returns exact count for each level
statusReason: expected 1 to be 2 // Object.is equality

[Killed] StringLiteral
runtime/notifications.ts:85:59
       case 'run_created':
         return { level: 'info', category: 'run', message: `Run ${event.run_id} created` };
       case 'run_started':
-        return { level: 'info', category: 'run', message: `Run ${event.run_id} started` };
+        return { level: 'info', category: 'run', message: `` };
       case 'run_completed':
         return { level: 'info', category: 'run', message: `Run ${event.run_id} completed` };
killedBy: precision: exact notification message strings run_started message is exact
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] ConditionalExpression
runtime/notifications.ts:86:7
         return { level: 'info', category: 'run', message: `Run ${event.run_id} created` };
       case 'run_started':
         return { level: 'info', category: 'run', message: `Run ${event.run_id} started` };
-      case 'run_completed':
-        return { level: 'info', category: 'run', message: `Run ${event.run_id} completed` };
+      case 'run_completed':
       case 'run_failed':
         return { level: 'error', category: 'run', message: `Run ${event.run_id} failed` };
killedBy: precision: exact notification message strings run_completed message is exact
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] StringLiteral
runtime/notifications.ts:86:12
         return { level: 'info', category: 'run', message: `Run ${event.run_id} created` };
       case 'run_started':
         return { level: 'info', category: 'run', message: `Run ${event.run_id} started` };
-      case 'run_completed':
+      case "":
         return { level: 'info', category: 'run', message: `Run ${event.run_id} completed` };
       case 'run_failed':
killedBy: precision: exact notification message strings run_completed message is exact
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] StringLiteral
runtime/notifications.ts:87:59
       case 'run_started':
         return { level: 'info', category: 'run', message: `Run ${event.run_id} started` };
       case 'run_completed':
-        return { level: 'info', category: 'run', message: `Run ${event.run_id} completed` };
+        return { level: 'info', category: 'run', message: `` };
       case 'run_failed':
         return { level: 'error', category: 'run', message: `Run ${event.run_id} failed` };
killedBy: precision: exact notification message strings run_completed message is exact
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] ConditionalExpression
runtime/notifications.ts:88:7
         return { level: 'info', category: 'run', message: `Run ${event.run_id} started` };
       case 'run_completed':
         return { level: 'info', category: 'run', message: `Run ${event.run_id} completed` };
-      case 'run_failed':
-        return { level: 'error', category: 'run', message: `Run ${event.run_id} failed` };
+      case 'run_failed':
       case 'run_cancelled':
         return { level: 'warning', category: 'run', message: `Run ${event.run_id} cancelled` };
killedBy: precision: notifications getByLevel and getByCategory exact results getByLevel returns exact count for each level
statusReason: expected +0 to be 1 // Object.is equality

[Killed] StringLiteral
runtime/notifications.ts:88:12
         return { level: 'info', category: 'run', message: `Run ${event.run_id} started` };
       case 'run_completed':
         return { level: 'info', category: 'run', message: `Run ${event.run_id} completed` };
-      case 'run_failed':
+      case "":
         return { level: 'error', category: 'run', message: `Run ${event.run_id} failed` };
       case 'run_cancelled':
killedBy: precision: notifications getByLevel and getByCategory exact results getByLevel returns exact count for each level
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ObjectLiteral
runtime/notifications.ts:89:16
       case 'run_completed':
         return { level: 'info', category: 'run', message: `Run ${event.run_id} completed` };
       case 'run_failed':
-        return { level: 'error', category: 'run', message: `Run ${event.run_id} failed` };
+        return {};
       case 'run_cancelled':
         return { level: 'warning', category: 'run', message: `Run ${event.run_id} cancelled` };
killedBy: precision: notifications getByLevel and getByCategory exact results getByLevel returns exact count for each level
statusReason: expected +0 to be 1 // Object.is equality

[Survived] StringLiteral
runtime/notifications.ts:89:44
       case 'run_completed':
         return { level: 'info', category: 'run', message: `Run ${event.run_id} completed` };
       case 'run_failed':
-        return { level: 'error', category: 'run', message: `Run ${event.run_id} failed` };
+        return { level: 'error', category: "", message: `Run ${event.run_id} failed` };
       case 'run_cancelled':
         return { level: 'warning', category: 'run', message: `Run ${event.run_id} cancelled` };

[Killed] ConditionalExpression
runtime/notifications.ts:90:7
         return { level: 'info', category: 'run', message: `Run ${event.run_id} completed` };
       case 'run_failed':
         return { level: 'error', category: 'run', message: `Run ${event.run_id} failed` };
-      case 'run_cancelled':
-        return { level: 'warning', category: 'run', message: `Run ${event.run_id} cancelled` };
+      case 'run_cancelled':
       case 'step_started':
         return { level: 'info', category: 'step', message: `Step ${event.step_id} started` };
killedBy: precision: notifications getByLevel and getByCategory exact results getByLevel returns exact count for each level
statusReason: expected 3 to be 2 // Object.is equality

[Killed] StringLiteral
runtime/notifications.ts:90:12
         return { level: 'info', category: 'run', message: `Run ${event.run_id} completed` };
       case 'run_failed':
         return { level: 'error', category: 'run', message: `Run ${event.run_id} failed` };
-      case 'run_cancelled':
+      case "":
         return { level: 'warning', category: 'run', message: `Run ${event.run_id} cancelled` };
       case 'step_started':
killedBy: mutation-kill: notifications all event types run_cancelled -> warning
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
runtime/notifications.ts:91:25
       case 'run_failed':
         return { level: 'error', category: 'run', message: `Run ${event.run_id} failed` };
       case 'run_cancelled':
-        return { level: 'warning', category: 'run', message: `Run ${event.run_id} cancelled` };
+        return { level: "", category: 'run', message: `Run ${event.run_id} cancelled` };
       case 'step_started':
         return { level: 'info', category: 'step', message: `Step ${event.step_id} started` };
killedBy: precision: notifications getByLevel and getByCategory exact results getByLevel returns exact count for each level
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
runtime/notifications.ts:92:7
         return { level: 'error', category: 'run', message: `Run ${event.run_id} failed` };
       case 'run_cancelled':
         return { level: 'warning', category: 'run', message: `Run ${event.run_id} cancelled` };
-      case 'step_started':
-        return { level: 'info', category: 'step', message: `Step ${event.step_id} started` };
+      case 'step_started':
       case 'step_completed':
         return { level: 'info', category: 'step', message: `Step ${event.step_id} completed` };
killedBy: precision: exact notification message strings step_started message is exact
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] ConditionalExpression
runtime/notifications.ts:94:7
         return { level: 'warning', category: 'run', message: `Run ${event.run_id} cancelled` };
       case 'step_started':
         return { level: 'info', category: 'step', message: `Step ${event.step_id} started` };
-      case 'step_completed':
-        return { level: 'info', category: 'step', message: `Step ${event.step_id} completed` };
+      case 'step_completed':
       case 'step_failed':
         return { level: 'error', category: 'step', message: `Step ${event.step_id} failed` };
killedBy: precision: exact notification message strings step_completed message is exact
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] StringLiteral
runtime/notifications.ts:95:60
       case 'step_started':
         return { level: 'info', category: 'step', message: `Step ${event.step_id} started` };
       case 'step_completed':
-        return { level: 'info', category: 'step', message: `Step ${event.step_id} completed` };
+        return { level: 'info', category: 'step', message: `` };
       case 'step_failed':
         return { level: 'error', category: 'step', message: `Step ${event.step_id} failed` };
killedBy: precision: exact notification message strings step_completed message is exact
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] ConditionalExpression
runtime/notifications.ts:96:7
         return { level: 'info', category: 'step', message: `Step ${event.step_id} started` };
       case 'step_completed':
         return { level: 'info', category: 'step', message: `Step ${event.step_id} completed` };
-      case 'step_failed':
-        return { level: 'error', category: 'step', message: `Step ${event.step_id} failed` };
+      case 'step_failed':
       case 'action_authorized':
         return { level: 'info', category: 'security', message: `Action authorized for ${event.data.tool_name}` };
killedBy: precision: notifications getByLevel and getByCategory exact results getByCategory returns exact count for each category
statusReason: expected +0 to be 1 // Object.is equality

[Killed] StringLiteral
runtime/notifications.ts:96:12
         return { level: 'info', category: 'step', message: `Step ${event.step_id} started` };
       case 'step_completed':
         return { level: 'info', category: 'step', message: `Step ${event.step_id} completed` };
-      case 'step_failed':
+      case "":
         return { level: 'error', category: 'step', message: `Step ${event.step_id} failed` };
       case 'action_authorized':
killedBy: precision: notifications getByLevel and getByCategory exact results getByCategory returns exact count for each category
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ObjectLiteral
runtime/notifications.ts:97:16
       case 'step_completed':
         return { level: 'info', category: 'step', message: `Step ${event.step_id} completed` };
       case 'step_failed':
-        return { level: 'error', category: 'step', message: `Step ${event.step_id} failed` };
+        return {};
       case 'action_authorized':
         return { level: 'info', category: 'security', message: `Action authorized for ${event.data.tool_name}` };
killedBy: precision: notifications getByLevel and getByCategory exact results getByCategory returns exact count for each category
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
runtime/notifications.ts:98:7
         return { level: 'info', category: 'step', message: `Step ${event.step_id} completed` };
       case 'step_failed':
         return { level: 'error', category: 'step', message: `Step ${event.step_id} failed` };
-      case 'action_authorized':
-        return { level: 'info', category: 'security', message: `Action authorized for ${event.data.tool_name}` };
+      case 'action_authorized':
       case 'action_denied':
         return { level: 'warning', category: 'security', message: `Action denied for ${event.data.tool_name}: ${event.data.reason}` };
killedBy: precision: exact notification message strings action_authorized message is exact
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] ConditionalExpression
runtime/notifications.ts:100:7
         return { level: 'error', category: 'step', message: `Step ${event.step_id} failed` };
       case 'action_authorized':
         return { level: 'info', category: 'security', message: `Action authorized for ${event.data.tool_name}` };
-      case 'action_denied':
-        return { level: 'warning', category: 'security', message: `Action denied for ${event.data.tool_name}: ${event.data.reason}` };
+      case 'action_denied':
       case 'action_executed':
         return { level: 'info', category: 'tool', message: `Tool ${event.data.tool_name} executed` };
killedBy: precision: exact notification message strings action_denied message is exact
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] ObjectLiteral
runtime/notifications.ts:101:16
       case 'action_authorized':
         return { level: 'info', category: 'security', message: `Action authorized for ${event.data.tool_name}` };
       case 'action_denied':
-        return { level: 'warning', category: 'security', message: `Action denied for ${event.data.tool_name}: ${event.data.reason}` };
+        return {};
       case 'action_executed':
         return { level: 'info', category: 'tool', message: `Tool ${event.data.tool_name} executed` };
killedBy: precision: exact notification message strings action_denied message is exact
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] ConditionalExpression
runtime/notifications.ts:102:7
         return { level: 'info', category: 'security', message: `Action authorized for ${event.data.tool_name}` };
       case 'action_denied':
         return { level: 'warning', category: 'security', message: `Action denied for ${event.data.tool_name}: ${event.data.reason}` };
-      case 'action_executed':
-        return { level: 'info', category: 'tool', message: `Tool ${event.data.tool_name} executed` };
+      case 'action_executed':
       case 'model_called':
         return { level: 'info', category: 'model', message: `Model called (${event.data.model})` };
killedBy: precision: exact notification message strings action_executed message is exact
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] StringLiteral
runtime/notifications.ts:102:12
         return { level: 'info', category: 'security', message: `Action authorized for ${event.data.tool_name}` };
       case 'action_denied':
         return { level: 'warning', category: 'security', message: `Action denied for ${event.data.tool_name}: ${event.data.reason}` };
-      case 'action_executed':
+      case "":
         return { level: 'info', category: 'tool', message: `Tool ${event.data.tool_name} executed` };
       case 'model_called':
killedBy: precision: exact notification message strings action_executed message is exact
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] ObjectLiteral
runtime/notifications.ts:103:16
       case 'action_denied':
         return { level: 'warning', category: 'security', message: `Action denied for ${event.data.tool_name}: ${event.data.reason}` };
       case 'action_executed':
-        return { level: 'info', category: 'tool', message: `Tool ${event.data.tool_name} executed` };
+        return {};
       case 'model_called':
         return { level: 'info', category: 'model', message: `Model called (${event.data.model})` };
killedBy: precision: exact notification message strings action_executed message is exact
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] ConditionalExpression
runtime/notifications.ts:104:7
         return { level: 'warning', category: 'security', message: `Action denied for ${event.data.tool_name}: ${event.data.reason}` };
       case 'action_executed':
         return { level: 'info', category: 'tool', message: `Tool ${event.data.tool_name} executed` };
-      case 'model_called':
-        return { level: 'info', category: 'model', message: `Model called (${event.data.model})` };
+      case 'model_called':
       default:
         return null;
killedBy: precision: notifications getByLevel and getByCategory exact results getByCategory returns exact count for each category
statusReason: expected +0 to be 1 // Object.is equality

[Survived] ConditionalExpression
runtime/notifications.ts:106:7
         return { level: 'info', category: 'tool', message: `Tool ${event.data.tool_name} executed` };
       case 'model_called':
         return { level: 'info', category: 'model', message: `Model called (${event.data.model})` };
-      default:
-        return null;
+      default:
     }
   }
