[Killed] BlockStatement
tools/create-artifact.ts:18:106
   size: number;
 }
 
-export function createArtifact(vfs: VirtualFilesystem, input: CreateArtifactInput): CreateArtifactResult {
-  vfs.write(input.path, input.content);
-  const digest = createHash('sha256').update(input.content).digest('hex');
-  return { path: input.path, digest, artifact_type: input.artifact_type, size: input.content.length };
-}
+export function createArtifact(vfs: VirtualFilesystem, input: CreateArtifactInput): CreateArtifactResult {}
 
killedBy: AH-TOOLS-001: all nine tools through VFS/Sandbox create_artifact writes through VFS and returns digest
statusReason: Cannot read properties of undefined (reading 'digest')

[Killed] StringLiteral
tools/create-artifact.ts:20:29
 
 export function createArtifact(vfs: VirtualFilesystem, input: CreateArtifactInput): CreateArtifactResult {
   vfs.write(input.path, input.content);
-  const digest = createHash('sha256').update(input.content).digest('hex');
+  const digest = createHash("").update(input.content).digest('hex');
   return { path: input.path, digest, artifact_type: input.artifact_type, size: input.content.length };
 }
killedBy: coverage: tools edge cases createArtifact returns correct size
statusReason: Digest method not supported
