[Killed] BlockStatement
tools/edit-file.ts:17:88
   edits_applied: number;
 }
 
-export function editFile(vfs: VirtualFilesystem, input: EditFileInput): EditFileResult {
-  const content = vfs.read(input.path);
-  if (content === null) {
-    throw new Error(`File not found: ${input.path}`);
-  }
-
-  if (!content.includes(input.old_text)) {
-    throw new Error(`Stale content conflict: old_text not found in file (file may have been modified)`);
-  }
-
-  const newContent = content.replace(input.old_text, input.new_text);
-  vfs.write(input.path, newContent, { expectedVersion: input.expected_version });
-  const version = vfs.getVersion(input.path);
-  return { path: input.path, version, edits_applied: 1 };
-}
+export function editFile(vfs: VirtualFilesystem, input: EditFileInput): EditFileResult {}
 
killedBy: AH-TOOLS-001: all nine tools through VFS/Sandbox edit_file applies exact patch
statusReason: expected 'Hello World' to be 'Hello Universe' // Object.is equality

[Killed] ConditionalExpression
tools/edit-file.ts:19:7
 
 export function editFile(vfs: VirtualFilesystem, input: EditFileInput): EditFileResult {
   const content = vfs.read(input.path);
-  if (content === null) {
+  if (true) {
     throw new Error(`File not found: ${input.path}`);
   }
killedBy: AH-TOOLS-001: all nine tools through VFS/Sandbox edit_file applies exact patch
statusReason: File not found: /scratch/test.txt

[Killed] ConditionalExpression
tools/edit-file.ts:19:7
 
 export function editFile(vfs: VirtualFilesystem, input: EditFileInput): EditFileResult {
   const content = vfs.read(input.path);
-  if (content === null) {
+  if (false) {
     throw new Error(`File not found: ${input.path}`);
   }
killedBy: coverage: tools edge cases editFile throws for missing file
statusReason: expected [Function] to throw error matching /not found/ but got 'Cannot read properties of null (readi…'

[Killed] ConditionalExpression
tools/edit-file.ts:23:7
     throw new Error(`File not found: ${input.path}`);
   }
 
-  if (!content.includes(input.old_text)) {
+  if (true) {
     throw new Error(`Stale content conflict: old_text not found in file (file may have been modified)`);
   }
killedBy: AH-TOOLS-AUTH-001: all nine tools through Capability + PEP edit_file: succeeds with valid capability + PEP
statusReason: Stale content conflict: old_text not found in file (file may have been modified)

[Killed] BlockStatement
tools/edit-file.ts:23:42
     throw new Error(`File not found: ${input.path}`);
   }
 
-  if (!content.includes(input.old_text)) {
-    throw new Error(`Stale content conflict: old_text not found in file (file may have been modified)`);
-  }
+  if (!content.includes(input.old_text)) {}
 
   const newContent = content.replace(input.old_text, input.new_text);
killedBy: AH-TOOLS-001: all nine tools through VFS/Sandbox edit_file detects stale content
statusReason: expected [Function] to throw an error

[Survived] ObjectLiteral
tools/edit-file.ts:28:37
   }
 
   const newContent = content.replace(input.old_text, input.new_text);
-  vfs.write(input.path, newContent, { expectedVersion: input.expected_version });
+  vfs.write(input.path, newContent, {});
   const version = vfs.getVersion(input.path);
   return { path: input.path, version, edits_applied: 1 };

[Killed] ObjectLiteral
tools/edit-file.ts:30:10
   const newContent = content.replace(input.old_text, input.new_text);
   vfs.write(input.path, newContent, { expectedVersion: input.expected_version });
   const version = vfs.getVersion(input.path);
-  return { path: input.path, version, edits_applied: 1 };
+  return {};
 }
 
killedBy: AH-TOOLS-001: all nine tools through VFS/Sandbox edit_file applies exact patch
statusReason: expected undefined to be 1 // Object.is equality
