[Killed] BlockStatement
tools/list-directory.ts:17:103
   has_more: boolean;
 }
 
-export function listDirectory(vfs: VirtualFilesystem, input: ListDirectoryInput): ListDirectoryResult {
-  const limit = input.limit ?? 100;
-  const offset = input.offset ?? 0;
-  const all = vfs.list(input.path).sort();
-  const total = all.length;
-  const entries = all.slice(offset, offset + limit);
-  return { path: input.path, entries, total, has_more: offset + limit < total };
-}
+export function listDirectory(vfs: VirtualFilesystem, input: ListDirectoryInput): ListDirectoryResult {}
 
killedBy: AH-TOOLS-001: all nine tools through VFS/Sandbox list_directory lists VFS entries with pagination
statusReason: Cannot read properties of undefined (reading 'entries')

[Killed] LogicalOperator
tools/list-directory.ts:18:17
 }
 
 export function listDirectory(vfs: VirtualFilesystem, input: ListDirectoryInput): ListDirectoryResult {
-  const limit = input.limit ?? 100;
+  const limit = input.limit && 100;
   const offset = input.offset ?? 0;
   const all = vfs.list(input.path).sort();
killedBy: AH-TOOLS-001: all nine tools through VFS/Sandbox list_directory lists VFS entries with pagination
statusReason: expected 3 to be 2 // Object.is equality

[Survived] LogicalOperator
tools/list-directory.ts:19:18
 
 export function listDirectory(vfs: VirtualFilesystem, input: ListDirectoryInput): ListDirectoryResult {
   const limit = input.limit ?? 100;
-  const offset = input.offset ?? 0;
+  const offset = input.offset && 0;
   const all = vfs.list(input.path).sort();
   const total = all.length;

[Survived] MethodExpression
tools/list-directory.ts:20:15
 export function listDirectory(vfs: VirtualFilesystem, input: ListDirectoryInput): ListDirectoryResult {
   const limit = input.limit ?? 100;
   const offset = input.offset ?? 0;
-  const all = vfs.list(input.path).sort();
+  const all = vfs.list(input.path);
   const total = all.length;
   const entries = all.slice(offset, offset + limit);

[Killed] ArithmeticOperator
tools/list-directory.ts:22:37
   const offset = input.offset ?? 0;
   const all = vfs.list(input.path).sort();
   const total = all.length;
-  const entries = all.slice(offset, offset + limit);
+  const entries = all.slice(offset, offset - limit);
   return { path: input.path, entries, total, has_more: offset + limit < total };
 }
killedBy: AH-TOOLS-001: all nine tools through VFS/Sandbox list_directory lists VFS entries with pagination
statusReason: expected 1 to be 2 // Object.is equality

[Killed] MethodExpression
tools/list-directory.ts:22:19
   const offset = input.offset ?? 0;
   const all = vfs.list(input.path).sort();
   const total = all.length;
-  const entries = all.slice(offset, offset + limit);
+  const entries = all;
   return { path: input.path, entries, total, has_more: offset + limit < total };
 }
killedBy: AH-TOOLS-001: all nine tools through VFS/Sandbox list_directory lists VFS entries with pagination
statusReason: expected 3 to be 2 // Object.is equality

[Killed] ConditionalExpression
tools/list-directory.ts:23:56
   const all = vfs.list(input.path).sort();
   const total = all.length;
   const entries = all.slice(offset, offset + limit);
-  return { path: input.path, entries, total, has_more: offset + limit < total };
+  return { path: input.path, entries, total, has_more: false };
 }
 
killedBy: AH-TOOLS-001: all nine tools through VFS/Sandbox list_directory lists VFS entries with pagination
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
tools/list-directory.ts:23:56
   const all = vfs.list(input.path).sort();
   const total = all.length;
   const entries = all.slice(offset, offset + limit);
-  return { path: input.path, entries, total, has_more: offset + limit < total };
+  return { path: input.path, entries, total, has_more: offset + limit >= total };
 }
 
killedBy: AH-TOOLS-001: all nine tools through VFS/Sandbox list_directory lists VFS entries with pagination
statusReason: expected false to be true // Object.is equality
