[Killed] LogicalOperator
tools/search-files.ts:26:17
 }
 
 export function searchFiles(vfs: VirtualFilesystem, input: SearchFilesInput): SearchFilesResult {
-  const limit = input.limit ?? 100;
+  const limit = input.limit && 100;
   const files = vfs.list(input.directory);
   const matches: SearchResultEntry[] = [];
killedBy: AH-TOOLS-001: all nine tools through VFS/Sandbox search_files respects limit
statusReason: expected 3 to be 2 // Object.is equality

[Killed] ArrayDeclaration
tools/search-files.ts:28:40
 export function searchFiles(vfs: VirtualFilesystem, input: SearchFilesInput): SearchFilesResult {
   const limit = input.limit ?? 100;
   const files = vfs.list(input.directory);
-  const matches: SearchResultEntry[] = [];
+  const matches: SearchResultEntry[] = ["Stryker was here"];
   let regex: RegExp;
   
killedBy: coverage: tools edge cases searchFiles with regex
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
tools/search-files.ts:31:7
   const matches: SearchResultEntry[] = [];
   let regex: RegExp;
   
-  if (input.is_regex) {
+  if (false) {
     regex = new RegExp(input.pattern, 'i');
   } else {
killedBy: coverage: tools edge cases searchFiles with regex
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
tools/search-files.ts:31:23
   const matches: SearchResultEntry[] = [];
   let regex: RegExp;
   
-  if (input.is_regex) {
-    regex = new RegExp(input.pattern, 'i');
-  } else {
+  if (input.is_regex) {} else {
     regex = new RegExp(input.pattern.replace(/[.*+?^${}()|[\]\\]/g, '\\$&'), 'i');
   }
killedBy: coverage: tools edge cases searchFiles with regex
statusReason: Cannot read properties of undefined (reading 'test')

[Killed] BlockStatement
tools/search-files.ts:33:10
   
   if (input.is_regex) {
     regex = new RegExp(input.pattern, 'i');
-  } else {
-    regex = new RegExp(input.pattern.replace(/[.*+?^${}()|[\]\\]/g, '\\$&'), 'i');
-  }
+  } else {}
 
   const ignoredDirs = input.ignored_dirs ?? ['node_modules', '.git', 'dist'];
killedBy: precision: research vertical exact claims returns claims with exact source and line
statusReason: Cannot read properties of undefined (reading 'test')

[Survived] StringLiteral
tools/search-files.ts:34:69
   if (input.is_regex) {
     regex = new RegExp(input.pattern, 'i');
   } else {
-    regex = new RegExp(input.pattern.replace(/[.*+?^${}()|[\]\\]/g, '\\$&'), 'i');
+    regex = new RegExp(input.pattern.replace(/[.*+?^${}()|[\]\\]/g, ""), 'i');
   }
 

[Killed] LogicalOperator
tools/search-files.ts:37:23
     regex = new RegExp(input.pattern.replace(/[.*+?^${}()|[\]\\]/g, '\\$&'), 'i');
   }
 
-  const ignoredDirs = input.ignored_dirs ?? ['node_modules', '.git', 'dist'];
+  const ignoredDirs = input.ignored_dirs && ['node_modules', '.git', 'dist'];
 
   for (const file of files) {
killedBy: coverage: tools edge cases searchFiles with regex
statusReason: Cannot read properties of undefined (reading 'some')

[Survived] StringLiteral
tools/search-files.ts:37:46
     regex = new RegExp(input.pattern.replace(/[.*+?^${}()|[\]\\]/g, '\\$&'), 'i');
   }
 
-  const ignoredDirs = input.ignored_dirs ?? ['node_modules', '.git', 'dist'];
+  const ignoredDirs = input.ignored_dirs ?? ["", '.git', 'dist'];
 
   for (const file of files) {

[Killed] BlockStatement
tools/search-files.ts:39:29
 
   const ignoredDirs = input.ignored_dirs ?? ['node_modules', '.git', 'dist'];
 
-  for (const file of files) {
-    if (ignoredDirs.some((dir) => file.includes(`/${dir}/`))) continue;
-    
-    const content = vfs.read(file);
-    if (content === null) continue;
-    
-    const lines = content.split('\n');
-    for (let i = 0; i < lines.length; i++) {
-      if (regex.test(lines[i])) {
-        matches.push({ file, line_number: i + 1, line: lines[i] });
-        if (matches.length >= limit) {
-          return { directory: input.directory, matches, total: matches.length, truncated: true };
-        }
-      }
-    }
-  }
+  for (const file of files) {}
 
   return { directory: input.directory, matches, total: matches.length, truncated: false };
killedBy: precision: research vertical exact claims returns claims with exact source and line
statusReason: expected 0 to be greater than 0

[Killed] ConditionalExpression
tools/search-files.ts:40:9
   const ignoredDirs = input.ignored_dirs ?? ['node_modules', '.git', 'dist'];
 
   for (const file of files) {
-    if (ignoredDirs.some((dir) => file.includes(`/${dir}/`))) continue;
+    if (true) continue;
     
     const content = vfs.read(file);
killedBy: precision: research vertical exact claims returns claims with exact source and line
statusReason: expected 0 to be greater than 0

[Survived] ConditionalExpression
tools/search-files.ts:40:9
   const ignoredDirs = input.ignored_dirs ?? ['node_modules', '.git', 'dist'];
 
   for (const file of files) {
-    if (ignoredDirs.some((dir) => file.includes(`/${dir}/`))) continue;
+    if (false) continue;
     
     const content = vfs.read(file);

[Killed] ConditionalExpression
tools/search-files.ts:43:9
     if (ignoredDirs.some((dir) => file.includes(`/${dir}/`))) continue;
     
     const content = vfs.read(file);
-    if (content === null) continue;
+    if (true) continue;
     
     const lines = content.split('\n');
killedBy: precision: research vertical exact claims returns claims with exact source and line
statusReason: expected 0 to be greater than 0

[Killed] EqualityOperator
tools/search-files.ts:43:9
     if (ignoredDirs.some((dir) => file.includes(`/${dir}/`))) continue;
     
     const content = vfs.read(file);
-    if (content === null) continue;
+    if (content !== null) continue;
     
     const lines = content.split('\n');
killedBy: precision: research vertical exact claims returns claims with exact source and line
statusReason: expected 0 to be greater than 0

[Killed] EqualityOperator
tools/search-files.ts:46:21
     if (content === null) continue;
     
     const lines = content.split('\n');
-    for (let i = 0; i < lines.length; i++) {
+    for (let i = 0; i >= lines.length; i++) {
       if (regex.test(lines[i])) {
         matches.push({ file, line_number: i + 1, line: lines[i] });
killedBy: precision: research vertical exact claims returns claims with exact source and line
statusReason: expected 0 to be greater than 0

[Killed] BlockStatement
tools/search-files.ts:46:44
     if (content === null) continue;
     
     const lines = content.split('\n');
-    for (let i = 0; i < lines.length; i++) {
-      if (regex.test(lines[i])) {
-        matches.push({ file, line_number: i + 1, line: lines[i] });
-        if (matches.length >= limit) {
-          return { directory: input.directory, matches, total: matches.length, truncated: true };
-        }
-      }
-    }
+    for (let i = 0; i < lines.length; i++) {}
   }
 
killedBy: precision: research vertical exact claims returns claims with exact source and line
statusReason: expected 0 to be greater than 0

[Killed] ConditionalExpression
tools/search-files.ts:47:11
     
     const lines = content.split('\n');
     for (let i = 0; i < lines.length; i++) {
-      if (regex.test(lines[i])) {
+      if (false) {
         matches.push({ file, line_number: i + 1, line: lines[i] });
         if (matches.length >= limit) {
killedBy: precision: research vertical exact claims returns claims with exact source and line
statusReason: expected 0 to be greater than 0

[Killed] BlockStatement
tools/search-files.ts:47:33
     
     const lines = content.split('\n');
     for (let i = 0; i < lines.length; i++) {
-      if (regex.test(lines[i])) {
-        matches.push({ file, line_number: i + 1, line: lines[i] });
-        if (matches.length >= limit) {
-          return { directory: input.directory, matches, total: matches.length, truncated: true };
-        }
-      }
+      if (regex.test(lines[i])) {}
     }
   }
killedBy: precision: research vertical exact claims returns claims with exact source and line
statusReason: expected 0 to be greater than 0

[Survived] ArithmeticOperator
tools/search-files.ts:48:43
     const lines = content.split('\n');
     for (let i = 0; i < lines.length; i++) {
       if (regex.test(lines[i])) {
-        matches.push({ file, line_number: i + 1, line: lines[i] });
+        matches.push({ file, line_number: i - 1, line: lines[i] });
         if (matches.length >= limit) {
           return { directory: input.directory, matches, total: matches.length, truncated: true };

[Killed] EqualityOperator
tools/search-files.ts:49:13
     for (let i = 0; i < lines.length; i++) {
       if (regex.test(lines[i])) {
         matches.push({ file, line_number: i + 1, line: lines[i] });
-        if (matches.length >= limit) {
+        if (matches.length > limit) {
           return { directory: input.directory, matches, total: matches.length, truncated: true };
         }
killedBy: AH-TOOLS-001: all nine tools through VFS/Sandbox search_files respects limit
statusReason: expected 3 to be 2 // Object.is equality

[Killed] ConditionalExpression
tools/search-files.ts:49:13
     for (let i = 0; i < lines.length; i++) {
       if (regex.test(lines[i])) {
         matches.push({ file, line_number: i + 1, line: lines[i] });
-        if (matches.length >= limit) {
+        if (false) {
           return { directory: input.directory, matches, total: matches.length, truncated: true };
         }
killedBy: AH-TOOLS-001: all nine tools through VFS/Sandbox search_files respects limit
statusReason: expected 3 to be 2 // Object.is equality

[Killed] BooleanLiteral
tools/search-files.ts:50:91
       if (regex.test(lines[i])) {
         matches.push({ file, line_number: i + 1, line: lines[i] });
         if (matches.length >= limit) {
-          return { directory: input.directory, matches, total: matches.length, truncated: true };
+          return { directory: input.directory, matches, total: matches.length, truncated: false };
         }
       }
killedBy: AH-TOOLS-001: all nine tools through VFS/Sandbox search_files respects limit
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
tools/search-files.ts:50:18
       if (regex.test(lines[i])) {
         matches.push({ file, line_number: i + 1, line: lines[i] });
         if (matches.length >= limit) {
-          return { directory: input.directory, matches, total: matches.length, truncated: true };
+          return {};
         }
       }
killedBy: AH-TOOLS-001: all nine tools through VFS/Sandbox search_files respects limit
statusReason: Cannot read properties of undefined (reading 'length')

[Survived] BooleanLiteral
tools/search-files.ts:56:83
     }
   }
 
-  return { directory: input.directory, matches, total: matches.length, truncated: false };
+  return { directory: input.directory, matches, total: matches.length, truncated: true };
 }
 
