[Killed] BlockStatement
tools/write-file.ts:16:91
   size: number;
 }
 
-export function writeFile(vfs: VirtualFilesystem, input: WriteFileInput): WriteFileResult {
-  vfs.write(input.path, input.content, { expectedVersion: input.expected_version });
-  const version = vfs.getVersion(input.path);
-  return { path: input.path, version, size: input.content.length };
-}
+export function writeFile(vfs: VirtualFilesystem, input: WriteFileInput): WriteFileResult {}
 
killedBy: precision: writing vertical exact output produces draft with correct content
statusReason: the given combination of arguments (null and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string
